[
    {
        "english": "Children always appreciate small gifts of money.",
        "chinese": "孩子们总是喜欢得到一些零花钱。",
        "note": "1. appreciate (vt.) 欣赏，感激。比like更正式，带有“珍视”的意味。small gifts of money 指“小额的钱”。【关联点】这和我们第一句遇到的 pocket money 意思几乎一样，都是指零用钱。\n\n2. 句型为“主谓宾” (Children appreciate gifts)。副词 always (总是) 强调频率。【关联点】这和我们遇到的 “uncles and aunts are always a source…” 和 “it is always empty” 中的 always 用法相同，都表示一种持续的状态或习惯。"
    },
    {
        "english": "Mum or dad, of course, provide a regular supply of pocket money, but uncles and ants are always a source of extra income.",
        "chinese": "爸爸妈妈当然经常给孩子零花钱，但是，叔舅婶姨也是孩子们额外收入来源。",
        "note": "1. a regular supply of pocket money 指“定期的零花钱供应”。a source of extra income 指“额外收入的来源”。【关联点】这里的 pocket money 和我们之前遇到的 small gifts of money 意思相同。\n\n2. 句子用 but 连接，对比了两种句型。前半句是“主谓宾”结构 (provide money)，后半句是“主谓表”结构 (are a source)。【关联点】这里的 always 和我们遇到的 Children always appreciate... 以及 it is always empty 用法一致，都表示一种常态。"
    },
    {
        "english": "With some children, small sums go a long way.",
        "chinese": "对于有些孩子来说，少量的钱可以花很长一段时间。",
        "note": "1. 核心短语 go a long way 意为“很管用，能用很久”，形象地表达了价值的持久性。sum 在此指“一笔钱”。\n\n2. 句型为“主谓”结构 (Small sums go)。【关联点】这句话与 'Only very thrifty children...' 描述的是同一种孩子，'go a long way' 是 'thrifty' (节俭) 的具体表现。"
    },
    {
        "english": "If fifty pence pieces are not exchanged for sweets, they rattle for months inside money boxes.",
        "chinese": "如果50便士不拿来换糖吃，则可以放在储蓄罐里叮当响上好几月。",
        "note": "1. 核心词组：exchange for (用...换取...)；rattle (vi. 叮当响)。【关联点】这里的 money boxes (储蓄罐) 正是前面提到的 thrifty children (节俭的孩子) 设法填满 (manage to fill up) 的东西。\n\n2. 句型：这是一个描述普遍事实的条件句。从句用被动语态 are not exchanged (硬币“被”交换)。【关联点】这与 `For most of them, fifty pence is a small price to pay for... chocolate` 形成鲜明对比，一个讲存钱，一个讲花钱。"
    },
    {
        "english": "Only very thrifty children manage to fill up a money box.",
        "chinese": "但是能把储蓄罐装满的只有屈指可数的几个特别节俭的孩子。",
        "note": "1. 核心词汇：thrifty (adj.) 节俭的；manage to do sth 设法做成某事，强调克服困难后的成功。【关联点】thrifty 这个词正是对前面 `With some children, small sums go a long way` 中那些孩子的精准描述，节俭才能让钱“很管用”。\n\n2. 句首的 Only 强调了“只有”这类孩子能做到。句型是“主谓宾”结构 (children manage a money box)。【关联点】这句话描述的成功储蓄者，与 `My nephew, George, has a money box but it is always empty` 中的乔治形成鲜明对比。一个 `fill up` (装满)，一个 `empty` (空的)。"
    },
    {
        "english": "For most of them, fifty pence is a small price to pay for a nice big bar of chocolate.",
        "chinese": "对大部分孩子来说，用50便士来买一大块好的巧克力，是算不了什么的。",
        "note": "1. 核心短语 a small price to pay for... 意为“为...付出的小代价”，强调所得远大于所失。【关联点】这和我们之前遇到的 `If fifty pence pieces are not exchanged for sweets...` 形成鲜明对比，一个讲花钱，一个讲存钱。\n\n2. 句型核心是“主谓表”结构 (fifty pence is a price)。不定式短语 to pay for... 用来修饰 price，说明这个“代价”是用来做什么的。【关联点】这句话描述了大多数孩子的消费观，与前面提到的 thrifty children (节俭的孩子) 形成对比。"
    },
    {
        "english": "My nephew, George, has a money box but it is always empty.",
        "chinese": "我的外甥乔治有一个储蓄罐，但总是空空的。",
        "note": "1. 核心词汇 empty (adj.) 空的。它与 full 相对。【关联点】这与我们之前遇到的 `Only very thrifty children manage to fill up a money box` 形成鲜明对比。乔治的储蓄罐是 empty (空的)，而节俭孩子的目标是 fill up (装满)。\n\n2. 句子用 but 连接，前后形成转折。前半句是“主谓宾”结构 (George has a box)，后半句是“主谓表”结构 (it is empty)。【关联点】这里的 always 和我们遇到的 Children always appreciate... 用法一致，表示常态。这句话也引出了乔治这个存不住钱的人物形象。"
    },
    {
        "english": "Very few of the fifty pence pieces and pound coins I have given him have found their way there.",
        "chinese": "我给了不少50便士的硬币，但没有几个存到储蓄罐里。",
        "note": "1. 核心短语：Very few of... 意为“……中极少数的”。find their way there 是个形象说法，指钱“最终到达/存进”储蓄罐。这解释了为何乔治的储蓄罐总是空的。\n\n2. 句型：主语是 Very few...coins，其中 I have given him 是一个定语从句，用来修饰硬币。【关联点】这和我们遇到的 the lady who owns the sweet shop 结构类似，都用一个句子来限定前面的名词。同时，Very few of... 与 For most of them... 形成数量上的鲜明对比。"
    },
    {
        "english": "I gave him fifty pence yesterday and advised him to save it. Instead he bought himself fifty pence worth of trouble.",
        "chinese": "昨天，我给了他50便士让存起来，却拿这钱给自己买了50便士的麻烦。",
        "note": "1. 核心短语：advise sb to do sth (建议某人做某事)；...worth of... (价值...的...)，这里 fifty pence worth of trouble 是一个生动的比喻，指“价值50便士的麻烦”。【关联点】bought himself... trouble 与 pay for... chocolate 形成讽刺对比，同样是花钱，结果却截然不同。\n\n2. 句型：句子用 instead (反而) 连接，表达了与期望完全相反的结果。注意动词后跟双宾语的用法：gave him fifty pence 和 bought himself trouble，结构都是“动词 + 谁 + 什么”。【关联点】这里的 gave him fifty pence 就是前文 the fifty pence pieces... I have given him 所描述的具体动作。instead 一词则鲜明地展示了他与那些 thrifty children (节俭的孩子) 的不同选择。"
    },
    {
        "english": "On his way to the sweet shop, he dropped his fifty pence and it bounced along the pavement and then disappeared down a drain.",
        "chinese": "在他去糖果店的路上，50便士掉在地上，在人行道上跳了几下，掉进了阴沟里。",
        "note": "1. 核心词汇：bounce (vi. 弹跳)，disappear (vi. 消失)，drain (n. 阴沟)。这三个词生动地描绘了硬币掉落、弹跳、最终消失不见的完整路径。\n\n2. 句型：这是一个典型的叙事句，用 and 和 then 连接了 dropped, bounced, disappeared 三个连续动作。【关联点】这和之后 George took off..., rolled up..., and pushed... 结构类似，都用 and 连接一串动作，叙事紧凑。这也具体解释了上一句中他买到的“麻烦”是什么。"
    },
    {
        "english": "George took off his jacket, rolled up his sleeves and pushed is right arm through the drain cover.",
        "chinese": "乔治脱掉外套，卷起袖子，将右胳膊伸进了阴沟盖。",
        "note": "1. 核心动词短语：take off (脱掉), roll up (卷起), push through (穿过)。这三个短语描绘了一套连贯的准备动作和核心行为，解释了他如何试图找回掉进 drain (阴沟) 的硬币。\n\n2. 句型：用 and 连接 took off, rolled up, pushed 三个连续动作，省略了主语，叙事紧凑有力。【关联点】这和我们之前遇到的 he dropped..., it bounced... and then disappeared... 结构完全一样，都是用 and 连接一串动词来讲述故事。"
    },
    {
        "english": "He could not find his fifty pence piece anywhere, and what is more, he could no get his arm out.",
        "chinese": "但他摸了半天也没找到那50便士硬币，他的胳膊反倒退不出来了。",
        "note": "1. 核心短语：what is more 意为“更重要的是，而且”，用来引出一个更糟或更重要的信息，有雪上加霜的意味。get... out 意为“把...弄出来”。【关联点】这个动作与上一句的 push his arm through (把胳膊伸进去) 形成直接的因果关系：伸进去，结果却拿不出来了。\n\n2. 句型：句子用 and 连接了两个坏消息，what is more 起到雪上加霜的递进作用。注意原文的 could no get 是非标准用法，应为 could not get。【关联点】这具体揭示了之前提到的 fifty pence worth of trouble (价值50便士的麻烦) 的全部内容：不仅钱没了，人也卡住了，麻烦升级了。"
    },
    {
        "english": "A crowd of people gathered round him and a lady rubbed his arm with soap and butter, but George was firmly stuck.",
        "chinese": "这时在他周围上了许多人，一位女士在乔治胳膊上抹了肥皂，黄油，但乔治的胳膊仍然卡得紧紧的。",
        "note": "1. 核心词汇：gather round (聚集在...周围)；rub... with... (用...擦拭...)；firmly stuck (牢牢卡住)，stuck 是形容词，表示“动不了的”。\n\n2. 句型：用 and 连接两个救助动作，再用 but 转折点明无效结果，叙事感强。【关联点】这和我们之前遇到的 he dropped... and it bounced... 以及 George took off... and pushed... 类似，都用 and 连接连续动作讲故事。\n\n3. 【关联点】注意区分人们尝试的土方法 (rubbed with soap and butter) 和后来消防员用的专业方法 (freed... using a special type of grease)，形成对比。这个 stuck 的状态正是他之前 push his arm through 的直接后果。"
    },
    {
        "english": "The fire brigade was called and two fire fighter freed George using a special type of grease.",
        "chinese": "有人打电话叫来消防队，两位消防队员使用了一种特殊的润滑剂才使乔治得以解脱。",
        "note": "1. 核心词汇：freed (v. 解救，使…自由)；grease (n. 润滑剂)。【关联点】注意区分消防员的专业方法 (using a special type of grease) 和之前那位女士失败的土方法 (rubbed his arm with soap and butter)，形成鲜明对比。\n\n2. 句型：句子用 and 连接。前半句是被动语态 The fire brigade was called (消防队“被”叫来)，强调事件本身。【关联点】这和我们之前遇到的 If fifty pence pieces are not exchanged... 类似，都使用了被动语态。后半句的 using... 则说明了救助的方式。"
    },
    {
        "english": "George was not too upset by his experience because the lady who owns the sweet shop heard about his troubles and rewarded him with large box of chocolates.",
        "chinese": "不过，此事并没使乔治过于伤心，因为糖果店老板娘听说了他遇到的麻烦后，赏给他一大盒巧克力。",
        "note": "1. 核心短语：reward sb with sth (用某物奖励某人)。be upset by (因...而难过)。【关联点】注意对比：乔治之前用钱“买”来了 fifty pence worth of trouble (麻烦)，现在他的 troubles (麻烦) 却为他换来了 a large box of chocolates (奖励)。一个坏结果，一个好结果，形成鲜明对比。\n\n2. 句型：because 引导原因。其中 the lady who owns the sweet shop 是一个定语从句。【关联点】这和我们之前遇到的 I have given him 结构类似，都用一个短句来修饰前面的名词。同时，heard... and rewarded... 这种动词并列的叙事方式，也和 George took off..., rolled up..., and pushed... 类似。"
    }
]