[
    {
        "english": "We have been brought up to fear insects.",
        "chinese": "我们自幼就在对昆虫的惧怕中长大。",
        "note": "1. 核心用法: be brought up to do sth. 意为“从小被教养成做某事”。have been brought up 是现在完成时的被动语态，强调“被抚养”的经历对现在造成了“害怕昆虫”的结果。\n\n2. 【关联点】注意这里的被动语态。这和我们之后遇到的 I had been completely defeated (我被彻底打败了) 结构类似，主语都是动作的承受者。对比时态，体会它们表达的“过去”有何不同。"
    },
    {
        "english": "We regard them as unnecessary creatures that do more harm than good.",
        "chinese": "我们把昆虫当作害多益少的无用东西。",
        "note": "1. 核心用法是 regard A as B (把A看作B)，属“主谓宾补”结构。that引导的从句修饰creatures，说明其“弊大于利”。\n2. 【关联点】此“主谓宾补”结构与后文 find them crawling 类似。词缀 un- (不) 也见于uninvited, unreasonable。"
    },
    {
        "english": "We continually wage war on them, for they contaminate our food, carry diseases, or devour our crops.",
        "chinese": "人类不断同昆虫斗争，因为昆虫弄脏我们的食物，传播疾病，吞噬庄稼。",
        "note": "1. 核心用法：wage war on 意为“与…作斗争”。for 在此是连词，相当于 because，引出前半句“斗争”的原因。\n\n2. 【关联点】后半句用 contaminate..., carry..., or devour... 形成动词短语并列，有力地列举了昆虫的三大“罪状”。这和我们之前遇到的 They sting or bite...; they fly... or beat... 结构类似，都是通过并列结构来增强表达效果。"
    },
    {
        "english": "They sting or bite without provocation; they fly uninvited into our rooms on summer nights, or beat ageist our lighted windows.",
        "chinese": "它们无缘无故地又叮又咬；夏天的晚上，它们未经邀请便飞到我们房间里，或者对着露出亮光的窗户乱扑乱撞。",
        "note": "1. 句式亮点：本句用分号连接两个并列分句，生动描绘了昆虫的两种滋扰行为。每个分句内部又使用 or 连接并列动词 (sting or bite; fly or beat)，形成富有节奏感的排比，增强了表达效果。\n\n2. 【关联点】这种通过并列结构来列举行为的方式，和我们之前遇到的 contaminate..., carry..., or devour... 结构完全相同，都是为了有力地展示昆虫的多重“罪状”。\n\n3. 核心词组：without provocation (无缘无故地)；uninvited (不请自来的)。uninvited 中的前缀 un- 表示“不”，这和我们学过的 unnecessary (不必要的) 和 unreasonable (不合理的) 用法一致。\n\n4. 动词辨析：sting 指蜜蜂等用尾刺“蜇人”，bite 指蚊子等用口器“咬人”。beat against 则生动描绘了飞蛾等昆虫对着灯光“乱扑乱撞”的画面。"
    },
    {
        "english": "We live in dread not only of unpleasant insects like spiders or wasps, but of quite harmless one like moths.",
        "chinese": "我们在日常生活中，不但憎恶如蜘蛛、黄蜂之类令人讨厌的昆虫，而且憎恶并无大害的飞蛾等。",
        "note": "1. 核心句型 not only... but... (不但…而且…)，连接两个并列成分。注意这里为了句式工整，连接的是 of unpleasant insects 和 of quite harmless one 两个介词短语。\n\n2. 核心词组 live in dread of (生活在对…的恐惧中)。dread 是比 fear 更强烈的恐惧感。harmless (无害的) 与前文 do more harm than good (弊大于利) 中的 harm 形成反义对比。\n\n3. 语法细节：句末的 one 是代词，指代前文的 insects，以避免重复。这种用法简洁地道。\n\n4. 【关联点】not only... but... 结构也出现在 I am proud of it, not only because... 一句中，用法完全相同。此外，unpleasant 中的否定前缀 un- 和我们遇到的 unnecessary, uninvited 用法一致。"
    },
    {
        "english": "Reading about them increases our understanding without dispelling our fears.",
        "chinese": "阅读有关昆虫的书能增加我们对它们的了解，却不能消除我们的恐惧的心理。",
        "note": "1. 核心句型: “Reading about them”是动名词短语作主语，引出“阅读”这件事。全句揭示了一个矛盾：知识增加（increases our understanding），但恐惧并未消除（without dispelling our fears）。\n\n2. 核心用法: without + V-ing 结构表示“不…，却没有…”。词汇 dispel (驱散) 比 remove 更生动，dispel fears (消除恐惧) 是常用搭配。\n\n3. 【关联点】动名词作主语的用法，和我们之后遇到的 \"Knowing that... does nothing to...\" 结构完全相同，都是高级主语形式，值得模仿。"
    },
    {
        "english": "Knowing that the industrious ant lives in a highly organized society does nothing to prevent us from being filled with revulsion when we find hordes of them crawling over a carefully prepared picnic lunch.",
        "chinese": "即使知道勤奋的蚂蚁生活具有高度组织性的社会里，当看到大群蚂蚁在我们精心准备的午间野餐上爬行时，我们也无法抑制对它们的反感。",
        "note": "1. 核心结构: 动名词短语 \"Knowing that...\" 作主语，谓语 \"does nothing to prevent...\" 意为“对阻止…毫无作用”，精妙地揭示了理智与情感的矛盾。\n\n2. 句末 when 从句中，find sb. doing sth. (发现某物做某事) 是“主谓宾补”结构，生动描绘了 \"hordes of them\" (大群的它们) 正在 \"crawling\" (爬行) 的动态画面。\n\n3. 【关联点】动名词作主语的用法，和我们之前遇到的 \"Reading about them...\" 结构完全相同，都是高级主语形式。\n\n4. 【关联点】\"find them crawling\" 的“主谓宾补”结构，和我们遇到的 \"regard them as...\" 及 \"watching ants crawling\" 类似，都是补充说明宾语的状态或动作。\n\n5. 【关联点】本句“理智不敌情感”的主题，与 \"Reading about them increases our understanding without dispelling our fears\" 所表达的矛盾如出一辙。"
    },
    {
        "english": "No matter how much we like honey, or how much we have read about the uncanny sense of direction which bees possess, we have a horror of being stung.",
        "chinese": "不管我们多么爱吃蜂蜜，或读过多少关于蜜蜂具有神秘的识别方向的灵感的书，我们仍然十分害怕被蜂蜇。",
        "note": "1. 核心句型: No matter how... or how... 引导两个并列的让步从句，表达“无论…也无论…，结果都…”，生动地展现了理智与情感的冲突。\n\n2. 【关联点】这种“理智不敌情感”的主题，与我们之前遇到的 Knowing that... does nothing to prevent... 和 Reading... without dispelling our fears 所表达的矛盾如出一辙。\n\n3. 核心词组: a horror of being stung (对被蜇的恐惧)。其中 being stung 是动名词的被动形式，表示“被”做某事。\n\n4. 【关联点】这种被动用法，和我们学过的 We have been brought up (我们被抚养) 和 I had been defeated (我被打败) 类似，都强调主语是动作的承受者。\n\n5. 语法细节: which bees possess 是一个定语从句，用来修饰 a sense of direction。possess 是 have 的正式用法。"
    },
    {
        "english": "Most of our fears are unreasonable, but they are impossible to erase.",
        "chinese": "我们的恐惧大部分是没有道理的，但去无法消除。",
        "note": "1. 核心句型是 adj. + to do sth，如 impossible to erase (不可能消除)。本句用 but 揭示了“恐惧”的矛盾：道理上不合理 (unreasonable)，但情感上却无法根除。\n\n2. 【关联点】注意否定前缀 un-。这和我们遇到的 unnecessary (不必要的), uninvited (不请自来的), unpleasant (令人不快的) 用法完全一致。\n\n3. 【关联点】impossible to do sth 的用法，与后文 making it impossible for the ants to reach... (使蚂蚁不可能到达...) 的结构遥相呼应，都是在说明“可能性”。"
    },
    {
        "english": "At the same time, however, insects are strangely fascinating.",
        "chinese": "同时，不知为什么昆虫又是迷人的。",
        "note": "1. 核心功能：“At the same time, however,”是强转折组合，引出与前文（昆虫的害处）完全相反的观点，即昆虫“迷人”的一面。副词 strangely (奇怪地) 修饰形容词 fascinating (迷人的)，暗示这种吸引力不合常理，充满矛盾。\n\n2. 【关联点】这里的 however 与后文 Most of our fears are unreasonable, but... 中的 but 功能相同，都用于引出转折。\n\n3. 【关联点】“副词+形容词”的用法在本课中反复出现，如 perfectly horrible (极其可怕的)，都是为了加强语气。\n\n4. 【关联点】fascinating (迷人的) 与后文 entranced (入迷的), awe (敬畏) 在情感色彩上形成呼应，共同描绘了我们对昆虫的矛盾情感。"
    },
    {
        "english": "We enjoy reading about them, especially when we find that, like the praying mantis, they lead perfectly horrible lives.",
        "chinese": "我们喜欢看有关昆虫的书，尤其是当我们了解螳螂等过着一种令人生畏的生活时，就更加爱读有关昆虫的书了。",
        "note": "1. 核心用法是 enjoy doing sth. (喜欢做某事)。句子通过 when 引导的从句展开，其中 find that... 引导一个宾语从句，说明“发现”的具体内容。like the praying mantis 是插入语，用作举例。\n\n2. 【关联点】词组 perfectly horrible (极其可怕的) 中，副词 perfectly 极大地加强了形容词 horrible 的语气。这和我们之前遇到的 strangely fascinating (奇怪地迷人) 用法完全相同，都是通过“副词+形容词”的结构来增强表达效果。\n\n3. 【关联点】注意区分 find 的用法。本句是 find that... (发现某个事实)，后面跟一个完整的从句。这和我们之后遇到的 find them crawling (发现它们正在爬) 不同。后者是“主谓宾补”结构，强调发现宾语正在进行的动作，画面感更强。"
    },
    {
        "english": "We enjoy staring at them, entranced as they go about their business, unaware (we hope) of our presence.",
        "chinese": "我们喜欢入迷地看它们做事，它们不知道（但愿如此）我们就在它们身边。",
        "note": "1. 本句亮点在于用两个分词短语同时描绘主客体状态：我们(We)是 entranced (入迷的)，而它们(they)是 unaware (未察觉的)。(we hope)是插入语，表达主观愿望。\n\n2. 【关联点】我们入迷(entranced)的状态，与前文的 fascinating (迷人)和 awe (敬畏)在情感上呼应，都描绘了昆虫的魅力。\n\n3. 【关联点】注意 unaware 中的否定前缀 un-。这和我们遇到的 unnecessary, uninvited, unreasonable 用法完全一致。"
    },
    {
        "english": "Who has not stood in awe at the sight of a spider pouncing on a fly, or a column of ants triumphantly bearing home an enormous dead beetle?",
        "chinese": "当看到蜘蛛扑向一只苍蝇时，一队蚂蚁抬着一只巨大的死甲虫凯旋归时，谁能不感到敬畏呢？",
        "note": "1. 这是一个反问句，意为“每个人都感到敬畏”。它通过 at the sight of A or B 的并列结构，生动描绘了两个令人惊叹的自然画面。\n\n2. 核心短语 stand in awe (感到敬畏)。【关联点】这种“敬畏”之情，与前文的 fascinating (迷人的) 和 entranced (入迷的) 情感呼应，共同描绘了我们对昆虫的复杂情感。\n\n3. 句中 a spider pouncing 和 ants bearing 描绘了动态画面。【关联点】这和我们之前遇到的 find them crawling 和 watching them scurrying 结构类似，都是用 V-ing 形式生动描绘宾语正在进行的动作。\n\n4. 【关联点】注意区分 pounce on (猛扑) 和 devour (吞噬)。前者强调攻击的瞬间动作，后者强调毁灭性的吞食结果。"
    },
    {
        "english": "Last summer I spent days in the garden watching thousands of ants crawling up the trunk of my prize peach tree.",
        "chinese": "去年夏天，我花了好几天时间站在花园里观察成千只蚂蚁爬上我那棵心爱的桃树的树干。",
        "note": "1. 核心用法是 spend time doing sth. (花时间做某事) 和 watch sb. doing sth. (看某人做某事)。前者说明“我”如何度过时间，后者则生动描绘了“蚂蚁正在爬”的动态画面。\n\n2. 【关联点】watch sb. doing 的用法，与我们遇到的 find them crawling 及 I watched them scurrying 异曲同工，都是补充说明宾语正在进行的动作。画面感极强。\n\n3. 【关联点】词汇上，thousands of (成千上万的) 与 hordes of (大群的) 类似，都是描绘昆虫数量众多的生动表达。"
    },
    {
        "english": "The tree has grown against a warm wall on a sheltered side of the house.",
        "chinese": "那棵树是靠着房子有遮挡的一面暖墙生长的。",
        "note": "1. 核心是现在完成时 has grown，表示树生长至今的结果。介词短语 against a warm wall (靠着暖墙) 和 on a sheltered side (在有遮挡的一面) 共同描绘了树木生长的具体位置和优越环境。\n\n2. 【关联点】介词 against (靠着) 的用法，和我们之前遇到的飞蛾 beat against our lighted windows (撞击着我们亮灯的窗户) 类似，都表示一种物理上的接触或依靠。\n\n3. 【关联点】动词 grow (生长) 侧重自然成长，可与第一句的 bring up (抚养长大) 对比。前者是植物的自然过程，后者是人的教育培养过程，词义相关但侧重不同。"
    },
    {
        "english": "I am especially proud of it, not only because it has survived several severe winters, but because it occasionally produces luscious peaches.",
        "chinese": "我为这棵树感到特别自豪，不仅因为它度过了几个寒冬终于活了下来，而且还因为它有时结出些甘甜的桃子来。",
        "note": "1. 核心句型是 not only... but...，用两个 because 从句引出感到自豪的两个并列原因：一是顽强幸存(survive)，二是结出果实。动词 has survived (现在完成时) 强调“活到现在”的结果。\n\n2. 【关联点】not only... but... 句型与 We live in dread not only of... but of... 完全相同。现在完成时 has survived 的用法也与 The tree has grown... 一致，都表示过去动作对现在的影响。"
    },
    {
        "english": "During the summer, I noticed tat the leaves of the tree were beginning to wither.",
        "chinese": "到了夏天，我发现树叶开始枯萎，",
        "note": "1. 核心用法是 notice that...，引导一个宾语从句，即“我发现”的完整内容是“树叶开始枯萎”这件事。\n\n2. 【关联点】这种“动词+that从句”的结构是本课重点。这和我们之后遇到的 find that..., see that..., realize that... 等用法完全相同，都是用来引出一个事实或观察到的情况。\n\n3. 时态组合：noticed (过去式) 捕捉到了一个瞬间，而 were beginning (过去进行时) 则生动描绘了在那个瞬间正在发生的、持续的过程。\n\n4. 【关联点】过去进行时生动描绘了过去的动态场景。这和我们之后遇到的 the ants were swarming (蚂蚁在聚集) 和 they were climbing (它们在爬) 的用法一致。\n\n5. 词汇 wither (枯萎) 专指植物的衰败。【关联点】注意区分 wither 和 devour (吞噬)。前者是植物自身的变化，后者是昆虫主动的破坏行为。"
    },
    {
        "english": "Clusters of tin insects called aphids were to be found on the underside of the leaves.",
        "chinese": "结果在树叶背面找到成串的叫作蚜虫小虫子。",
        "note": "1. 核心结构是“长主语 + 被动语态”。主语是 Clusters of tiny insects called aphids (成串的、叫作蚜虫的小虫子)，谓语 were to be found 意为“结果被发现”，强调一种被动的发现。\n\n2. 语法细节：called aphids 是过去分词作后置定语，修饰 insects，意为“被称作蚜虫的”。【关联点】这和我们遇到的 a carefully prepared picnic lunch (精心准备的午餐) 用法一致，都是用过去分词来描述名词。\n\n3. 【关联点】注意 were to be found 这种特殊的被动语态。这和我们之前遇到的 We have been brought up (我们被抚养) 以及之后遇到的 They were visited by... (它们被...拜访) 类似，都强调主语是动作的承受者。"
    },
    {
        "english": "They were visited by a large colony of ants which obtained a sort of honey from them.",
        "chinese": "蚜虫遭到一窝蚂蚁的攻击，蚂蚁从它们身上可以获得一种蜜。",
        "note": "1. 核心结构：本句由“被动语态主句 + 定语从句”构成。主句 They were visited by... (它们被...拜访) 表明蚜虫是动作承受者。which obtained (获得) ... 从句则补充说明蚂蚁的行为。\n\n2. 【关联点】被动语态和我们遇到的 were to be found... 及 We have been brought up... 类似，都强调主语“被”怎么样。\n\n3. 【关联点】which 引导的定语从句，和我们之前遇到的 ...sense of direction which bees possess 及 ...creatures that do more harm... 结构类似，都是用来修饰前面的名词。\n\n4. 【关联点】词汇 a colony of (一群) 与前文的 clusters of (一簇), hordes of (一大群), a column of (一队) 都是描述昆虫群体的生动词汇，可以归类记忆。"
    },
    {
        "english": "I immediately embarked on an experiment which, even though if failed to get rid of the ants, kept me fascinated for twenty-four hours.",
        "chinese": "我当即动手作了一项试验，这项试验尽管没有使我摆脱这些蚂蚁，却使我着迷了24小时。",
        "note": "1. 核心词组：embark on (开始，带有“扬帆起航”的仪式感)；get rid of (摆脱)；fascinated (着迷的)。\n\n2. 句子的核心是 which 引导的从句，它用 even though... (尽管…) 引出失败结果，再用 kept me fascinated (使我着迷) 表达意外收获，形成精妙转折。\n\n3. 【关联点】kept me fascinated 是“主谓宾补”结构。这和我们遇到的 find them crawling (发现它们在爬) 和 watching them scurrying (看着它们乱跑) 结构类似，都是补充说明宾语的状态或动作。\n\n4. 【关联点】情感上，fascinated (着迷的) 与前文的 awe (敬畏), entranced (入迷的) 形成呼应，共同描绘了昆虫虽有害却也迷人的矛盾主题。"
    },
    {
        "english": "I bound the base of the tree with sticky tape, making it impossible for the ants to reach the aphids.",
        "chinese": "我用一条胶带把桃树底部包上，不让蚂蚁接近蚜虫。",
        "note": "1. 核心结构：making... 是现在分词作结果状语，生动说明了主句动作 I bound... (我捆绑) 带来的直接后果。\n\n2. 黄金句型：make it + 形容词 + for sb. to do sth. (使某人做某事变得…)。it 是形式宾语，真正宾语是后面的 to do 短语。\n\n3. 【关联点】这和我们之前遇到的 Most of our fears are impossible to erase. 遥相呼应。一个是 it is impossible to do (做某事不可能)，一个是 make it impossible to do (使做某事不可能)，都是关于“可能性”的表达。\n\n4. 【关联点】注意区分：这里的 making... 表“结果”，而之前遇到的 find them crawling 或 watching ants crawling 中的 V-ing 形式是宾语补足语，表“正在进行的动作”。前者有因果关系，后者是同步发生。"
    },
    {
        "english": "The tape was so stick that they did not dare to cross it.",
        "chinese": "胶带极粘，蚂蚁不敢从上面爬过。",
        "note": "1. 核心句型 so...that... (如此…以至于…)，用于连接原因和结果。前半句 The tape was so sticky 是原因，后半句 that they did not dare to cross it 是结果。\n\n2. 核心词汇：sticky (粘的)；dare to do sth. (敢于做某事)。dare 常用于否定句，表示“不敢”。\n\n3. 【关联点】so...that...句型强调了“因果”，即“太粘”导致“不敢过”。这和我们遇到的 making it impossible... 异曲同工，后者用分词短语表达“捆绑”带来的“无法到达”的结果。"
    },
    {
        "english": "For a long time.",
        "chinese": "在很长一段时间里，",
        "note": "1. 核心用法: 这是一个表示“持续多久”的时间状语，本身不是完整句子。它像一个时间标签，用来补充说明主句动作持续的时间长度。\n\n2. 【关联点】这和我们之后遇到的 ...kept me fascinated for twenty-four hours 用法完全相同，都表示持续时间。但需注意区分本课另一用法：for they contaminate... (因为它们污染…)，这里的 for 意为“因为”。"
    },
    {
        "english": "I watched them scurrying around the base of the tree in bewilderment.",
        "chinese": "我看见蚂蚁围着大树底部来回转悠，不知所措。",
        "note": "1. 核心用法是 watch sb. doing sth. (看某人做某事)，属“主谓宾补”结构。scurrying (小步快跑) 生动描绘了“它们”的动态。in bewilderment (困惑地) 则点明了“我”的状态。\n\n2. 【关联点】本句的 watch them scurrying 与 find them crawling, watching ants crawling 结构完全相同，都是用 V-ing 形式作宾补，生动描绘“发现/看见宾语正在做某事”的动态画面。\n\n3. 【关联点】注意区分描绘昆虫动作的词：scurry (小步快跑，慌乱感) vs. crawl (爬行，缓慢感)。这和我们遇到的 pounce on (猛扑) 一样，都是描绘具体动作的生动词汇。"
    },
    {
        "english": "I even went out at midnight with a torch and noted with satisfaction (and surprise) that the ants were still swarming around the sticky tape without being able to do anything about it.",
        "chinese": "半夜，我还拿着电筒来到花园里，满意地（同时惊奇地）发现那些蚂蚁还围着胶带团团转。无能为力。",
        "note": "1. 核心结构是 I went out... and noted that... (我出去……并注意到……)。note that... 意为“注意到……”，后接一个完整的从句。were swarming (正在聚集) 是过去进行时，生动描绘了当时持续的动态画面。swarm around 意为“围着……聚集”。\n\n2. 【关联点】note that... 的用法，和我们之前遇到的 notice that..., find that..., see that..., realize that... 等结构完全相同，都是“动词+that从句”的核心句型，用来引出一个观察到的事实。\n\n3. 【关联点】过去进行时 were swarming，和我们遇到的 were beginning to wither (正开始枯萎) 及 they were climbing (它们正在爬) 用法一致，都是为了生动描绘过去某个时间点正在发生的场景。\n\n4. 【关联点】短语 without being able to do anything about it (无能为力) 描绘了蚂蚁的窘境。其中 without + V-ing 的用法，和我们之前遇到的 without dispelling our fears (没有消除我们的恐惧) 结构类似。"
    },
    {
        "english": "I got up early next morning hoping to find that the ants had given up in despair.",
        "chinese": "第二天早上，我起床后希望看见蚂蚁已因无望而放弃了尝试，",
        "note": "1. 核心结构: hoping... 是现在分词作伴随状语，生动描绘了主语“我”起床时的状态和目的。find that... 引导宾语从句，说明希望发现的具体内容。\n\n2. 时态亮点: 过去完成时 had given up 强调“蚂蚁放弃”这个动作发生在主句动作“我起床”(got up)之前，体现了时间的先后顺序。\n\n3. 【关联点】find that... 的用法，和我们遇到的 notice that..., see that..., realize that... 等结构完全相同，都是“动词+that从句”的核心句型。\n\n4. 【关联点】过去完成时的用法，也见于 they had discovered... 和 I had been defeated...，都表示“过去的过去”。\n\n5. 【关联点】注意区分分词用法：这里的 hoping 修饰主语“我”，而 find them crawling 中的 crawling 是宾语补足语，修饰宾语“它们”。"
    },
    {
        "english": "Instead, I saw that they had discovered a new route.",
        "chinese": "结果却发现它们又找到一条新的路径。",
        "note": "1. 核心结构是 I saw that... (我看到…)，后接一个宾语从句。时态是关键：had discovered (过去完成时) 表示“发现”这个动作，发生在 saw (过去时) 之前。\n\n2. 【关联点】这种“动词+that从句”的用法是本课重点。这和我们遇到的 notice that..., find that..., realize that... 等用法完全相同，都是用来引出一个观察到的事实。\n\n3. 【关联点】过去完成时 had discovered 的用法，也和 the ants had given up (蚂蚁已经放弃) 及 I had been defeated (我被打败) 类似，都表示“过去的过去”。\n\n4. 词汇 Instead (反而) 表示转折，与 however 和 but 功能相似，都引出与预期相反的情况。"
    },
    {
        "english": "They were climbing up the wall of the house and then on to the leaves of the tree.",
        "chinese": "它们正在顺着房子的外墙往上爬，然后爬上树叶。",
        "note": "1. 核心用法是过去进行时 were climbing，生动描绘了过去某个时间点正在发生的、持续的动作。句子通过 up... and then on to... 的结构，清晰地勾勒出“它们”从墙到树叶的连续移动路径。\n\n2. 【关联点】过去进行时生动描绘了过去的动态场景。这和我们之前遇到的 the leaves were beginning to wither (树叶正开始枯萎) 和 the ants were swarming (蚂蚁在聚集) 的用法一致。"
    },
    {
        "english": "I realized sadly that I had been completely defeated by their ingenuity.",
        "chinese": "我懊丧地感到败在了足智多谋的蚂蚁的手下。",
        "note": "1. 核心结构是 realize that...，引导一个宾语从句，说明“意识到”的具体内容。【关联点】这和我们遇到的 notice that..., find that..., see that... 等用法完全相同，都是“动词+that从句”的核心句型。\n\n2. 时态亮点：had been defeated 是过去完成时被动语态，强调“被打败”发生在“意识到”之前。【关联点】这和我们遇到的 We have been brought up (被动) 及 they had discovered (过去的过去) 类似。\n\n3. 词汇亮点：副词 completely (完全地) 强调了 defeat (打败) 的彻底性。ingenuity (足智多谋) 点明了蚂蚁获胜的关键。【关联点】副词用法和 strangely fascinating 及 perfectly horrible 类似。"
    },
    {
        "english": "The ants had been quick to find an answer to my thoroughly unscientific methods!",
        "chinese": "蚂蚁已很快找到了相应的对策，来对付我那套完全不科学的办法！",
        "note": "1. 核心用法是 be quick to do sth. (很快做某事)。副词 thoroughly (完全地) 极大地加强了 unscientific (不科学的) 的程度，生动描绘了作者方法的拙劣。\n\n2. 时态亮点：过去完成时 had been quick 强调蚂蚁的“快”发生在作者过去某个行为之前。【关联点】这和我们之后遇到的 had discovered, had given up, had been defeated 用法一致，都表示“过去的过去”。\n\n3. 【关联点】注意 unscientific 中的否定前缀 un-。这和我们遇到的 unnecessary, uninvited, unreasonable 等词的构词法完全相同，可以归类记忆。"
    }
]