[
    {
        "english": "We are less credulous than we used to be.",
        "chinese": "我们不再像以往那样轻易相信别人了。",
        "note": "1. credulous: 形容词，意为“轻信的，易受骗的”。【关联点】这和我们之前遇到的 naive (天真的) 意思相近。19世纪的读者很 credulous，所以能接受 naive solution，而现代读者则会觉得 unacceptable (无法接受的)。\n\n2. less...than...: 比较结构，表示“不如...那么...”，用来进行程度的对比。例如：He is less interested in sports than his brother. (他不如他哥哥对运动那么感兴趣。)\n\n3. used to be: 意为“过去曾经是”，强调今非昔比的状态变化。句末的 be 后面省略了 credulous，避免重复。【关联点】这和我们之前遇到的 a novelist would bring... 中的 would 类似，都可用来描述过去的情况或习惯。"
    },
    {
        "english": "In the nineteenth century, a novelist would bring his story to a conclusion by presenting his readers with a series of coincidences -- most of them wildly improbable.",
        "chinese": "在19世纪，小说家常在小说结尾处给读者准备一系列的巧合——大部分是牵强附会，极不可能的。",
        "note": "1. 这里的 would 表示过去的一种习惯，常用于描述反复发生的动作。【关联点】这和我们遇到的 we used to be 中的 used to 功能相似。注意区分后面 Modern readers would find... 中 would 表推测的用法。\n\n2. 短语 bring...to a conclusion 意为“使……结束”。【关联点】这和后面遇到的 bring about (导致) 结构相似，都用 bring 加介词构成短语，表达“带来某种结果”的含义。\n\n3. coincidences (巧合) 由 wildly improbable (极其不可能的) 修饰。【关联点】这些巧合就是指“失散多年的兄弟还活着”这类情节，这种天真的结局 (naive solution) 在现代读者看来是 unacceptable 的。\n\n4. 句型 ...by presenting... 是一个“方式状语”，用 by + V-ing 的形式说明小说家是“通过何种方式”来结束故事的，清晰解释了动作与方法的关系。"
    },
    {
        "english": "Readers happily accepted the fact that an obscure maidservant was really the hero's mother.",
        "chinese": "当时的读者却愉快地接受这样一些事实，一个低贱的女佣实际上是主人公的母亲；",
        "note": "1. 动词 accept (接受) 体现了当时读者的轻信。【关联点】这与后面 Modern readers 觉得 naive solution totally unacceptable (完全无法接受) 形成鲜明对比，也呼应了首句的 We are less credulous now. (我们不再那么轻信了。)\n\n2. 句型 the fact that... 中，that 从句具体解释 fact 的内容，是同位语从句。【关联点】这个“事实”本身，即“女佣是英雄的母亲”，正是前文所说的 wildly improbable coincidences (极其不可能的巧合) 的一个典型例子。\n\n3. 副词 really (实际上) 在此用于揭示一个惊人的真相。【关联点】这和后面故事里 he really was Franz's long-lost brother (他确实是弗朗兹失散多年的兄弟) 的用法如出一辙，都是小说中制造戏剧性效果的常用手法。"
    },
    {
        "english": "A long-lost brother, who was presumed dead, was really alive all the time and wickedly plotting to bring about the hero's downfall.",
        "chinese": "主人公一位长期失散的兄弟，大家都以为死了，实际上一直活着，并且正在策划暗算主人公；",
        "note": "1. 词组 long-lost 意为“失散多年的”。was presumed dead 意为“被大家以为死了”，是被动语态。【关联点】这和后面故事里 Franz 的兄弟 who was thought to have been killed (被认为已遭杀害) 的表达方式几乎一样，都是用来设置悬念的经典手法。\n\n2. 短语 plot to bring about... downfall 意为“密谋导致……的垮台”。【关联点】这里的 bring about (导致) 和我们之前遇到的 circumstances... bring about coincidences (情况促成巧合) 中的用法相同，都表示“引起，造成”。\n\n3. 整个句子是19世纪小说中 wildly improbable coincidences (极其不可能的巧合) 的绝佳范例。【关联点】句中的 really (实际上) 和前文 was really the hero's mother 的用法一致，都用于揭示惊人真相，而这种 naive solution (天真的结局) 正是现代读者觉得 unacceptable 的。"
    },
    {
        "english": "And so on.",
        "chinese": "如此等等，",
        "note": "1. 常用短语，意为“等等”，用于列举的末尾，表示省略了其他类似的项目，使表达更简洁。例如：She likes reading, writing, drawing, and so on.\n\n2. 【关联点】这个短语常用来收尾一个例子列表。比如课文提到的各种巧合(coincidences)，如“女仆是英雄母亲”、“兄弟死而复生”等等，就可以用 and so on 来概括。"
    },
    {
        "english": "Modern readers would find such naive solution totally unacceptable.",
        "chinese": "现代读者会觉得这种天真的结局完全无法接受。",
        "note": "1. naive solution (天真的结局) 指的就是前文提到的各种 improbable coincidences (不可能的巧合)。【关联点】这与之前读者 happily accepted (欣然接受) 形成鲜明对比，呼应了首句 We are less credulous (我们不再那么轻信了)。\n\n2. 这里的 would 表示一种推测 (会觉得)。【关联点】注意区分它和 a novelist would bring... 中表示“过去习惯”的用法。\n\n3. 句型 find + O + C (宾语+宾补) 意为“觉得/认为...是...样的”。【关联点】这和我们后面遇到的 find incredible (觉得难以置信) 结构完全相同，是表达观点的高频句型。"
    },
    {
        "english": "Yet, in real life, circumstances do sometimes conspire to bring about coincidences which anyone but a nineteenth century novelist would find incredible.",
        "chinese": "不过，在现实生活中，有时确实会出现一些巧合，这些巧合除了19世纪小说家外谁也不会相信。",
        "note": "1. 动词 conspire 此处意为“(事件)巧合地促成”，而非“密谋”。短语 bring about 意为“导致，引起”。【关联点】这和我们之前遇到的 plot to bring about the hero's downfall (密谋导致英雄的垮台) 中的用法一致，都表示“造成某种结果”。\n\n2. 句型 find + O + C (宾语+宾补) 意为“觉得...是...样的”。此处 find incredible 意为“觉得难以置信”。【关联点】这和我们之前遇到的 Modern readers would find such naive solution unacceptable (现代读者会觉得这种结局无法接受) 的句型完全相同，都是用来表达观点。\n\n3. 词汇 but 在此意为“除了”(except)。anyone but a novelist 意为“除了小说家之外的任何人”。【关联点】这句话点明了只有19世纪的小说家才会相信这种巧合(coincidences)，与普通人形成对比。"
    },
    {
        "english": "When I was a boy, my grandfather told me how a German taxi driver, Franz Bussman, found a brother who was thought to have been killed twenty years before.",
        "chinese": "当我是个孩子的时候，我祖父给我讲了一位德国出租汽车司机弗朗兹。巴斯曼如何找到了据信已在20年前死去的兄弟的事。",
        "note": "1. 句型 told sb. how... 意为“告诉某人某事是如何发生的”，how 引导的从句作直接宾语，生动地引出一个故事。【关联点】这和后面 Hans explained how... 的用法一致，都是用来叙述事情的经过。\n\n2. 短语 who was thought to have been killed 意为“被认为已经遇害”，用来修饰 a brother。【关联点】这和我们之前遇到的 who was presumed dead (被大家以为死了) 表达方式几乎完全一样，是小说中设置悬念、引出巧合(coincidence)的经典手法。"
    },
    {
        "english": "While on a walking tour with his wife, he stooped to talk to a workman.",
        "chinese": "一次，他与妻子徒步旅行。途中，停下来与一个工人交谈，",
        "note": "1. 句首 While on... 是 While he was on... 的简洁说法，交代了故事发生的时间背景。【关联点】这和我们后面遇到的 pointing out... (指出...) 和 Assuming that... (以为...) 类似，都是用一个短语来补充说明主句的背景，使句子更紧凑。\n\n2. 动词 stoop 意为“弯腰”。stoop to talk to... 用 to do 的形式说明弯腰的目的——“为了和...交谈”。【关联点】这和我们后面遇到的 sent a boy to ask him... (派男孩去问他) 结构完全一样，都是用不定式来解释动作的目的。"
    },
    {
        "english": "After they had gone on, Mrs. Bussman commented on the workman's close resemblance to her husband and even suggested that he might be his brother.",
        "chinese": "接着他们继续往前走去。巴斯曼夫人说那工人与她丈夫相貌很像，甚至猜测他可能就是她丈夫的兄弟。",
        "note": "1. 核心短语 comment on... resemblance to... 意为“评论……和……的相像之处”。resemblance (相像) 是整个巧合 (coincidence) 的起点，引出了后续的故事。\n\n2. 动词 suggest 在此意为“猜测，认为”，后接 that 从句。她猜测的内容 (he might be his brother) 正是课文开头提到的那种 improbable coincidence (不可能的巧合)。\n\n3. 句首 After they had gone on 中，过去完成时 (had gone on) 表示动作发生在主句动作 (commented, suggested) 之前，交代了事件顺序。【关联点】这和后面故事中用 had been killed, had been bombed 来交代背景事件的用法一致，是叙事常用技巧。"
    },
    {
        "english": "Franz poured scorn on the idea, pointing out that his brother had been killed in action during the war.",
        "chinese": "弗朗兹对此不屑一顾，指出他兄弟已经在战争中阵亡了。",
        "note": "1. 核心短语 pour scorn on 意为“对...不屑一顾”，生动表达强烈鄙视。killed in action 意为“阵亡”。Franz 的不屑正是现代人对“天真结局”的正常反应。【关联点】这和 Modern readers would find... unacceptable (觉得无法接受) 的态度类似。\n\n2. 句型 ...pointing out... 是现在分词作状语，补充说明 Franz 的动作，并解释了他不屑的原因。【关联点】这和我们之前遇到的 While on... (在...时) 和后面将遇到的 Assuming that... (以为...) 类似，都是用一个简洁的短语来交代主句的背景或原因。\n\n3. 时态 had been killed (过去完成时) 表示“兄弟阵亡”发生在 Franz “指出”这个动作之前，清晰交代了事件的先后顺序。【关联点】这和我们之前遇到的 After they had gone on... 中的用法一致，都是叙事中交代背景事件的常用技巧。"
    },
    {
        "english": "Though Mrs. Busssman fully acquainted with this story, she thought that there was a chance in a million that she might be right.",
        "chinese": "尽管巴斯曼夫人熟知这个情况，但她仍然认为自己的想法仍有百万分之一的可能性。",
        "note": "1. Though (尽管) 引出让步状语从句，表达“明知事实如此，但仍抱有希望”的转折。【关联点】这和她丈夫 Franz 的反应形成鲜明对比，Franz 听到同样的想法后 poured scorn on it (对此不屑一顾)，凸显了夫妻二人截然不同的态度。\n\n2. 短语 a chance in a million (百万分之一的机会) 形象地描述了极小的可能性。【关联点】这个“极小的可能”正是课文反复讨论的 improbable coincidence (不可能的巧合)。巴斯曼夫人愿意相信这种巧合，这让她更像一个轻信的 (credulous) 19世纪读者。\n\n3. 情态动词 might be right (可能是对的) 表达了非常不确定的猜测，可能性比 may 更小。【关联点】这呼应了 a chance in a million，强调她自己也明白这个想法听起来有多么 improbable (不可能)，但仍未完全放弃。"
    },
    {
        "english": "A few days later, she sent a boy to the workman to ask him if his name was Hans Bussman.",
        "chinese": "几天后，她派了一个男孩去问那人是否叫汉斯.巴斯曼。",
        "note": "1. 句型 send sb to do sth 意为“派某人去做某事”。其中 to ask... 部分清晰说明了派男孩去的目的。【关联点】这和我们之前遇到的 he stooped to talk to a workman (他弯腰去和工人说话) 结构完全一样，都是用不定式 to do 来解释动作的目的。\n\n2. 句型 ask sb if... 意为“询问某人是否...”，用于转述一个“是不是”的问题，后面跟一个完整的陈述句。【关联点】这和我们遇到的 told me how... (告诉我如何...) 和后面将遇到的 explained how... (解释如何...) 类似，都是将直接的疑问或陈述转为间接引语的常用方式。\n\n3. 这个派人去问的行动，是巴斯曼夫人怀疑的直接体现。【关联点】这与她丈夫 Franz poured scorn on the idea (对此不屑一顾) 的消极态度形成鲜明对比，正是这个行动最终证实了这个 improbable coincidence (不可能的巧合)。"
    },
    {
        "english": "Needless to say, the man's name was Hans Bussman and he really was Franz's long-lost brother.",
        "chinese": "不出巴斯曼夫人所料，那人的名字真是汉斯.巴斯曼，他确实是弗朗兹失散多年的兄弟。",
        "note": "1. Needless to say: 意为“不用说，显而易见”，放在句首，引出一个意料之中的结论。这个短语点明了，对于相信直觉的巴斯曼夫人来说，这个结局并不意外。\n\n2. long-lost brother: 意为“失散多年的兄弟”。【关联点】这正是课文开头提到的19世纪小说中那种 wildly improbable coincidences (极其不可能的巧合) 在现实生活中的再现。\n\n3. really: 副词，意为“确实”，在此加强语气，确认一个惊人的事实。【关联点】这和我们之前遇到的 was really the hero's mother 以及 was really alive 的用法完全一致，都是用来揭示一个令人难以置信的真相，是故事达到高潮的关键信号。"
    },
    {
        "english": "When the brothers were reunited, Hans explained how it was that he was still alive.",
        "chinese": "兄弟俩团聚之时，汉斯说明了他活下来的经过，",
        "note": "1. 句型 explained how... 意为“解释了……的经过”。【关联点】这和我们之前遇到的 my grandfather told me how... 的用法一致，都是用来引出一段详细的叙述或故事，回答了之前的悬念。\n\n2. When the brothers were reunited (当兄弟俩团聚时) 是时间状语从句，标志着故事的高潮。【关联点】这次团聚正是课文开头所讨论的那种 improbable coincidence (不可能的巧合) 在现实中的体现。\n\n3. 结构 how it was that... 是对 how he was still alive 的强调，突出“如何活下来”这一过程的曲折。alive (活着) 与之前的 presumed dead (被认为已死) 形成强烈对比，揭开谜底。"
    },
    {
        "english": "After having been wounded towards the end of the war, he had been sent to hospital and was separated from his unit.",
        "chinese": "战争即将结束时，他负伤被送进医院，并与部队失去联系。",
        "note": "1. 结构 After having been wounded... 是一个完成时分词短语，表示“受伤”这个动作发生在主句动作“被送进医院”之前，简洁地交代了事件顺序。【关联点】这和我们之前遇到的 pointing out... 以及后面将遇到的 Assuming that... 类似，都是用一个分词短语来交代主句的背景或原因。\n\n2. 语态 句中所有动词均为被动语态 (having been wounded, had been sent, was separated)，强调主语“他”是所有事件的承受者，而非主动执行者，突显其在战争中的无助与被动。\n\n3. 时态 动词 had been sent 使用了过去完成时，表明“被送医”发生在过去某个时间点或另一过去动作 (was separated) 之前。【关联点】这和我们之前遇到的 his brother had been killed in action 一样，都是用过去完成时来清晰地交代事件发生的先后顺序，是叙事中的常用技巧。"
    },
    {
        "english": "The hospital had been bombed and Hans had made his way back into Western Germany on foot.",
        "chinese": "医院遭到轰炸，汉斯步行回到了西德。",
        "note": "1. 时态 had been bombed 和 had made 均为过去完成时，表示这两个动作都发生在故事主要时间点之前，是背景交代。【关联点】这和我们之前遇到的 his brother had been killed in action 一样，都是用过去完成时来清晰交代事件发生的先后顺序，是叙事常用技巧。\n\n2. 语态 had been bombed 是被动语态，强调医院是战争的受害者。【关联点】这和我们之前遇到的 having been wounded (受伤) 和 was separated (失散) 类似，都突显了人物在战争中的无助与被动。\n\n3. 短语 make one's way 意为“前往，行进”，on foot 意为“步行”。两者结合，生动描绘了汉斯艰难的返乡旅程。"
    },
    {
        "english": "Meanwhile, his unit was lost and all records of him had been destroyed.",
        "chinese": "与此同时，他所在部队被击溃，他的所有档案材料全部毁于战火。",
        "note": "1. 核心结构是两个并列的被动语态：his unit was lost (部队被击溃) 和 records... had been destroyed (档案被摧毁)。【关联点】这和我们之前遇到的 the hospital had been bombed (医院被轰炸) 和 his brother had been killed (兄弟被杀害) 类似，都用被动语态来强调战争中人与物的无助与被动。\n\n2. 时态 had been destroyed (过去完成时) 表示“档案被毁”发生在故事主要时间点之前，是背景交代。【关联点】这和我们之前遇到的 the house had been bombed 和 his brother had been killed in action 一样，都是用过去完成时来清晰交代事件发生的先后顺序，是叙事中的常用技巧。"
    },
    {
        "english": "Hans returned to his family home, but the house had been bombed and no one in the neighbourhood knew what had become of the inhabitants.",
        "chinese": "汉斯重返故里，但他的家已被炸毁，左邻右舍谁也不知原住户的下落，",
        "note": "1. 核心时态是过去完成时 (had been bombed, had become)，表示这些事发生在汉斯回来 (returned) 之前，是背景交代。【关联点】这和我们之前遇到的 his brother had been killed in action 一样，都是用过去完成时来清晰交代事件发生的先后顺序，是叙事中的常用技巧。\n\n2. 语态 had been bombed 是被动语态，强调房子是战争的受害者，而非主动行为者。【关联点】这和我们遇到的 the hospital had been bombed 和 his brother had been killed 类似，都用被动语态来强调战争中人与物的无助与被动。\n\n3. 句型 knew what... 意为“知道……的情况”，what 引导的从句作 knew 的宾语。【关联点】这和我们遇到的 told me how... 和 explained how... 类似，都是用一个从句来作动词的宾语，具体说明“告诉”或“知道”的内容。"
    },
    {
        "english": "Assuming that his family had been killed during an air raid, Hans settled down in a village fifty miles away where he had remained ever since.",
        "chinese": "汉斯以为全家人都在空袭中遇难，于是便在距此50英里外的一座村子里定居下来，直至当日。",
        "note": "1. 句首 Assuming that... (以为...) 是现在分词作状语，解释了汉斯定居的原因。【关联点】这和我们之前遇到的 pointing out... (指出...) 和 After having been wounded... (在受伤后...) 类似，都是用一个分词短语来交代主句的背景或原因，使句子更紧凑。\n\n2. 时态 had been killed 和 had remained 均为过去完成时，表示这些事发生在汉斯定居 (settled down) 之前，是背景交代。【关联点】这和我们之前遇到的 the house had been bombed 和 his brother had been killed in action 一样，都是用过去完成时来清晰交代事件发生的先后顺序，是叙事中的常用技巧。\n\n3. 汉斯“以为”家人遇难 (Assuming...had been killed) 是整个故事的起点，正是这个错误的假定，才导致了后来的“失散”与重逢。【关联点】这与 Franz 同样认为兄弟已阵亡 (had been killed in action) 的情况如出一辙，两个错误的“以为”共同构成了这个 improbable coincidence (不可能的巧合)。"
    }
]