[
    {
        "english": "The word justice is usually associated with courts of law.",
        "chinese": "“正义”这个词常常是同法庭连在一起的。",
        "note": "1. 核心短语 be associated with 意为“与...联系在一起”，用来引出与主语紧密相关的事物。courts of law 指法庭，是执行法律的地方。\n2. 【关联点】本句的被动语态 is associated (be+过去分词)，和我们之后遇到的 justice has been done (正义得到伸张) 结构类似，都表示主语“被”怎么样了。"
    },
    {
        "english": "We might say that justice has been done when a man's innocence or guilt has been proved beyond doubt.",
        "chinese": "当某人被证据确凿地证明无罪的时候，我们也许会说正义得到了伸张。",
        "note": "1. 核心短语 justice has been done 意为“正义得到伸张”，是一个固定说法。beyond doubt 意为“毫无疑问，证据确凿地”，用来强调事实的确定性。innocence (无辜) 与 guilt (有罪) 是一对反义词。\n\n2. 句型解析 本句通过 \"when\" 从句设定了一个条件。核心结构是两个现在完成时的被动语态：justice has been done (正义被伸张) 和 has been proved (已被证明)，都强调动作已经完成且主语是动作的承受者。\n\n3. 【关联点】这里的被动语态用法，和我们遇到的 is associated with (被联系) 结构类似，都是“be动词 + 过去分词”的形式。注意体会这种“主语被怎么样了”的表达，它在后续的 a thief was caught (小偷被抓住) 等句子中会反复出现。"
    },
    {
        "english": "Justice is part of the complex machinery of the law.",
        "chinese": "正义是复杂的法律机器组成部分。",
        "note": "1. 核心词汇 complex 意为“复杂的”；machinery 在此是比喻，指整个法律体系的运作机制，而非实体机器。\n\n2. 句型解析 本句用“A is B”的结构，将正义(A)定义为庞大复杂的法律体系(B)中的一个组成部分。\n\n3. 【关联点】这和我们之后遇到的 justice acts like a living force (正义像一种生命力) 类似，都用具体事物(机器、力量)来比喻抽象的“正义”概念，帮助我们理解。"
    },
    {
        "english": "Those who seek it undertake an arduous journey and can never be sure that they will find it.",
        "chinese": "那些寻求正义的人走的是一条崎岖的道路，从来没有把握他们最终将到正义。",
        "note": "1. 核心词汇 seek (追求，常指抽象事物)；undertake (承担艰巨任务)；arduous (艰苦的)。句型 Those who... 用来指代“那些...的人”，引出这类人的共同特征。\n\n2. 句子通过 and 连接两个并列部分：过程艰辛 (undertake an arduous journey) 与结果不确定 (can never be sure...)。that 从句具体说明了“不确定”的内容。\n\n3. 【关联点】这里的 be sure that (确定...) 和我们之后遇到的 could not be certain (无法确定...) 意思相近，结构也类似(be+形容词)，都是表达确定性。注意它们可以互换使用。"
    },
    {
        "english": "Judges, however wise or eminent, are human and can make mistakes.",
        "chinese": "法官无论如何聪明与有名，毕竟也是人，也会出差错的。",
        "note": "1. 核心句型 \"however + 形容词\" 意为“无论多么...”，是一种让步的表达方式。本句通过它引出核心观点：即便法官再聪明、再杰出(eminent)，他们终究是人，也会犯错(make mistakes)。\n\n2. 【关联点】这和我们之后遇到的 \"Reward or punishment are meted out quite independent of human interference\" (奖惩的实施不受人类干涉) 形成了鲜明对比。本句强调了人类（法官）会犯错，而那句则描述了一种不受人类影响的、绝对的“正义”。"
    },
    {
        "english": "There are rare instances when justice almost ceases to be an abstract concept.",
        "chinese": "在个别情况下，正义不再是一种抽象概念。",
        "note": "1. 核心短语 cease to be 意为“不再是”，比 stop being 更正式。abstract concept 指非实体、靠思考理解的“抽象概念”，如爱、自由。\n\n2. 句型解析 句子使用 \"There are... when...\" 结构，意为“存在着...的情况，在这些情况下...”。when 从句详细描述了 a rare instance 的内容，即正义变得具体、真实。\n\n3. 【关联点】这和我们之后遇到的 justice acts like a living force (正义像一种生命力) 完美呼应。本句说正义“不再抽象”，那句则说明了它变成了什么——一种鲜活的力量。"
    },
    {
        "english": "Reward or punishment are meted out quite independent of human interference.",
        "chinese": "奖惩的实施是不受人意志支配的。",
        "note": "1. 核心短语 mete out 意为“给予，施加(奖惩)”；independent of 意为“不受...影响”。human interference 指“人为干预”。\n\n2. 句型解析 本句为被动语态，强调“奖惩”是动作的承受者，它们“被”实施。后面的 independent of... 则说明了这种实施方式的特点：完全不受人类意志的控制。\n\n3. 【关联点】这与之前“法官会犯错”形成对比，揭示了一种绝对公正。这种不受人为干预的特点，也呼应了 justice acts of its own accord (正义自动发生作用) 的概念。"
    },
    {
        "english": "At such times, justice acts like a living force.",
        "chinese": "在这种时候，正义像一种有生命的力量行使其职能。",
        "note": "1. 核心短语 act like 意为“表现得像...一样”，此处用生动的比喻说明正义不再是静止的规则，而是像 a living force (一种有生命的力量) 一样主动发挥作用。\n\n2. 【关联点】这完美呼应了我们之前遇到的 \"justice almost ceases to be an abstract concept\" (正义不再是抽象概念)。那一句是铺垫，这一句则给出了答案：正义变成了具体、鲜活的力量。这也和用 machinery (机器) 比喻法律体系的思路一致。"
    },
    {
        "english": "When we use a phrase like 'it serves him right', we are, in part, admitting that a certain set of circumstances has enabled justice to act of its own accord.",
        "chinese": "当我们说“他罪有应得”这句话的时候，我们部分承认了某种特定的环境使得正义自动地起了作用。",
        "note": "1. 核心短语与句型：it serves him right 是“他活该”的口语说法。enable sb to do sth 意为“使某人能做某事”。of its own accord 意为“自动地，不受外力干预地”。\n\n2. 句型解析：本句结构为“When X, we admit that Y”。Y是一个宾语从句，其核心是 a set of circumstances (某种环境) + has enabled (使得) + justice (正义) + to act of its own accord (自动起作用)。\n\n3. 【关联点】短语 of its own accord (自动地) 完美呼应了之前提到的 justice acts like a living force (像生命力一样活动) 和 reward... are meted out independent of human interference (奖惩不受人为干预)。它们共同描绘了一种不以人的意志为转移的、客观存在的“正义”。"
    },
    {
        "english": "When a thief was caught on the premises of large jewellery store on morning, the shop assistants must have found it impossible to resist the temptation to say 'it serves him right.'",
        "chinese": "一天上午，当一个小偷在一家大型珠宝店里被人抓住的时候，店员一定会忍不住说：“他罪有应得。”",
        "note": "1. 核心短语 resist the temptation 意为“忍不住做某事”。it serves him right 是口语“他活该，罪有应得”的意思，指某人因做错事而得到应有下场。\n\n2. 句型解析 must have found... 是对过去事情的强烈推测，意为“一定觉得...”。find it impossible to do sth 是一个固定句型，意为“发现做某事是不可能的”，it是形式宾语。\n\n3. 【关联点】句中的被动语态 a thief was caught (小偷被抓住)，和我们之前遇到的 justice has been done (正义得到伸张) 等用法一致。而 it serves him right 这句话，正是之前所说的“让正义自动发挥作用”的具体体现。"
    },
    {
        "english": "The shop was an old converted house with many large, disused fireplaces and tall, narrow chimneys.",
        "chinese": "那是一座老式的、经过改造的房子，店里有许多废置不用的大壁炉和又高又窄的烟囱。",
        "note": "1. 核心词汇 converted (改造过的) 和 disused (废弃的) 都是过去分词作形容词，生动描述了事物的状态。句型 A is B with C... (商店是...的房子，带有...) 是一种高效的描述方式，用 with 短语来补充说明 B 的具体特征。\n\n2. 【关联点】这里的 converted (被改造的) 和 disused (被废弃的) 在用法上，与我们之后遇到的 a man had been trapped (一个人被困住) 中的 trapped 类似。它们都源于动词的过去分词，表示一种“被动”或“已完成”的状态。"
    },
    {
        "english": "Towards midday, a girl heard a muffed cry coming from behind on of the walls.",
        "chinese": "快到中午的时候，一个女售货员听见从一堵墙里传出一种闷声闷气的叫声。",
        "note": "1. 核心词汇 Towards midday 意为“快到中午时”。muffed cry 指“沉闷的、不清晰的叫声”，muffed 来自 muffle (捂住)，生动地描绘了声音被阻碍的状态。\n\n2. 句型解析 核心结构是“主+谓+宾+doing”，即 a girl heard a cry coming from...。这里的 coming... 是现在分词短语，作后置定语修饰 cry，生动地描述了叫声的来源和动态。\n\n3. 【关联点】这里的 muffed (被捂住的) 和 coming (传来的) 都是分词作定语。这和我们遇到的 converted house (被改造的房子) 和 disused fireplaces (废弃的壁炉) 用法一致，都是用分词来高效地描述事物状态。"
    },
    {
        "english": "As the cry was repeated several times, she ran to tell the manager who promptly rang up the fire brigade.",
        "chinese": "由于这种喊叫声重复了几次，她跑去报告经理，经理当即给消防队挂了电话。",
        "note": "1. 核心词汇 As... 意为“由于，当...时”，引出原因。promptly 意为“立即地”。ring up (过去式 rang up) 意为“打电话”。\n\n2. 句型解析 句子按时间顺序展开：As... (原因状语从句) -> she ran... (主句) -> who... (定语从句)。who 指代前面的 manager，引出其后续动作。\n\n3. 【关联点】本句的 who 定语从句与 Those who seek it... 结构类似，都用来修饰人。句首的 As... 从句则与 When a thief was caught... 作用相同，都是交代事件背景。"
    },
    {
        "english": "The cry had certainly come form one of the chimneys, but as there were so many of them, the fire fighters could not be certain which one it was.",
        "chinese": "喊叫声肯定是从烟囱里传出来的，然而，因为烟囱太多，消防队员无法确定到底是哪一个。",
        "note": "1. 核心词汇辨析 a certain (确定的) 是形容词，常用于 be certain 结构，表示主语的状态。certainly (肯定地) 是副词，用来加强动词的语气，强调动作的确定性。\n\n2. 句型解析 本句用 but 连接前后两个分句，形成转折：前半句肯定了声音来源(had certainly come from)，后半句则因烟囱太多(as there were so many)而无法确定具体是哪一个(could not be certain which one)。\n\n3. 【关联点】这里的 be certain (确定) 和我们之前遇到的 be sure that... (确定...) 意思和用法几乎完全相同。此外，句中的 as (因为) 也和 As the cry was repeated... 的用法一致，都用来引出原因。"
    },
    {
        "english": "They located the right chimney by tapping at the walls and listening for the man's cries.",
        "chinese": "他们通过叫击烟囱倾叫声而确定传出声音的那个烟囱。",
        "note": "1. 核心短语 locate 意为“定位，找到确切位置”。listen for 意为“留心听（某个期待的声音）”，与 tap (轻敲) 共同构成了寻找的方法。\n\n2. 句型解析 本句的核心结构是“做事 by doing...”，用 by 加动名词短语来具体说明“通过什么方式”完成动作。tapping... and listening... 是两个并列的方式状语。\n\n3. 【关联点】本句用 by tapping and listening (通过敲击和倾听) 来解释“如何定位”。这和我们之后遇到的 free him by cutting a huge hole (通过挖一个大洞来救他) 的用法完全一致，都是用 “by + 动作” 来回答 “how” (如何做) 的问题。"
    },
    {
        "english": "After chipping through a wall which was eighteen inches thick, they found that a man had been trapped in the chimney.",
        "chinese": "他们凿透了18英寸厚的墙壁，发现有个人卡在烟囱里。",
        "note": "1. 核心时态 had been trapped (过去完成时被动语态)，强调“被困”这个动作发生在“发现”(found)之前。句型 a wall which was... thick 用定语从句来描述物体的属性。\n\n2. 【关联点】这种用过去完成时表示“过去的过去”的用法，和我们之后遇到的 Justice had been done even before... 的逻辑完全一致，都是一个动作发生在另一个过去动作之前。"
    },
    {
        "english": "As it was extremely narrow, the man was unable to move, but the fire fighters were eventually able to free him by cutting a huge hole in the wall.",
        "chinese": "由于烟囱太窄，那人无法动弹。消防队员在墙上挖了个大洞，才终于把他解救出来。",
        "note": "1. 核心词汇 unable (不能) 与 able (能够) 形成对比。free 此处是动词，意为“解救”。句型 by doing... 用来解释“通过何种方式”完成动作。\n\n2. 【关联点】本句用 by cutting a huge hole (通过挖一个大洞) 来解释“如何解救”。这和我们之前遇到的 by tapping at the walls (通过敲墙) 的用法完全一致。句首的 As (由于) 也和 As the cry was repeated... 中的用法相同。"
    },
    {
        "english": "The sorry-looking, blackened figure that emerged, admitted at once that he had tried to break into the shop during the night but had got stuck in the chimney.",
        "chinese": "那个看来满脸沮丧、浑身漆黑的家伙从烟囱里一出来，就承认头天夜里他企图到店里行窍，但让烟囱卡住了。",
        "note": "1. 句型解析 本句主干是 The figure admitted that...。主语部分用 sorry-looking (看起来沮丧的) 和 blackened (被熏黑的) 两个形容词，以及 that emerged (那个出现的) 定语从句来描述人物。宾语是一个由 that 引导的长从句，其中用 but 连接了两个并列动作：had tried to break into (试图闯入) 和 had got stuck (被卡住)。\n\n2. 核心时态 宾语从句中的 had tried 和 had got stuck 都是过去完成时，表示“试图闯入”和“被卡住”这两个动作，都发生在主句动词 admitted (承认) 之前。这种时态清晰地交代了事件的先后顺序。\n\n3. 【关联点】这里的过去完成时用法，和我们遇到的 a man had been trapped (在被发现前就已受困) 的逻辑完全一致，都表示“过去的过去”。此外，形容词 blackened (被熏黑的) 用法也和 converted house (被改造的房子) 类似，都是过去分词作定语。"
    },
    {
        "english": "He had been there for nearly ten hours.",
        "chinese": "他已经在烟囱里被困了将近10个小时。",
        "note": "1. 核心时态 had been (过去完成时)，表示“被困”的状态发生在故事主要情节（如被发现）之前，并已持续了“将近十小时”(for nearly ten hours)。\n\n2. 【关联点】这个“过去的过去”时态是理解故事时间线的关键。它和我们之后遇到的 a man had been trapped 和 he had tried... 用法一致，都用来交代主线故事发生前的事。"
    },
    {
        "english": "Justice had been done even before the man was handed over to the police.",
        "chinese": "甚至在那人还没被送交给警察之前，正义就已得到了伸张。",
        "note": "1. 核心时态与短语 本句用过去完成时被动(had been done)对比一般过去时被动(was handed over)，清晰展示了动作先后：“正义伸张”先于“人被移交”(hand over)。even before 强调了这种时间差。\n\n2. 【关联点】这种用过去完成时表示“过去的过去”的用法，和我们遇到的 a man had been trapped (在被发现前就已受困) 的逻辑完全一致，都是用一个更早的过去动作来为故事背景作铺垫。"
    }
]