[
    {
        "english": "The New Year is a time for resolutions. Mentally, at least, most of us could compile formidable lists of 'dos' and 'don'ts'.",
        "chinese": "新年是下决心的时候，至少在大多数人的心里会编排出一份“应做什么”和“不应做什么”的令人生畏的单子。",
        "note": "1. 核心词汇：resolution (n.) 指“决心”，尤指新年目标。而 formidable (adj.) 形容这些决心因其艰巨或繁多而“令人生畏”。【关联点】这和我们马上会遇到的动词 resolve (v. 下决心) 是同根词，名词 resolution 就是下决心的结果。\n\n2. 核心短语：compile a list 指“编制一份清单”，将信息汇集整理。而 'dos' and 'don'ts' 是固定搭配，指“行为准则”或“应做与不应做之事”。【关联点】文中提到的这份 formidable list，在下一句中就具体展开为一长串并列的决心。\n\n3. 句型解析：句子由两部分构成。第一部分 “The New Year is a time...” 是一个主谓表结构，为全文设定背景。第二部分 “most of us could compile...” 是主谓宾结构，说明我们（主语）能编制（谓语）一份清单（宾语）。Mentally 点明这一切发生在头脑中。"
    },
    {
        "english": "The same old favorites recur year in year out with monotonous regularity.",
        "chinese": "相同的决心以单调的规律年复一年地出现。",
        "note": "1. 核心词汇：recur (vi.) 意为“反复出现”。favorites 在此特指那些“常立的决心”。monotonous regularity 指“单调的规律”，形容这种重复的乏味感。\n\n2. 核心短语：year in year out 意为“年复一年地”，生动地表达了时间的重复性。【关联点】这和我们后面遇到的 Little by little (一点一点地) 类似，都通过词语重复来强调过程的持续。\n\n3. 句型解析：本句核心是主谓结构 (S+V)：favorites (主语) + recur (谓语)。动词 recur 是不及物动词，本身意义完整。【关联点】这和我们后面遇到的 my enthusiasm waned (热情减退了) 结构一致，都用不及物动词描述主语自身的变化。\n\n4. 深度理解：句中的 a monotonous regularity (单调的规律) 与之前提到的 ambitious schemes (宏大的规划) 形成鲜明对比，揭示了新年决心“雷声大雨点小”的讽刺现实。"
    },
    {
        "english": "We resolve to get up earlier each morning, eat less, find more time to play with the children, do a thousand and one jobs about the house, be nice to people we don't' like, drive carefully, and take the dog for a walk every day.",
        "chinese": "我们决心每天早晨起得早些；吃得少些；多花点时间与孩子们一起做游戏；做大量的家务；对不喜欢的人友善一些；小心驾车；每天都要带着狗散步；等等。",
        "note": "1. 核心词汇：resolve to do sth. 意为“下决心做某事”。【关联点】这正是第一句中名词 resolution (决心) 的动词形式。下决心 (resolve) 的结果就是一份决心 (resolution)。\n\n2. 句型解析：本句核心是 “We resolve + to do...”，其后用一连串并列的动词原形 (get up, eat, find...) 来具体说明决心的内容，生动地列出了一份决心清单。【关联点】这正是对第一句 formidable lists of 'dos' and 'don'ts' 的具体展示。\n\n3. 核心短语：a thousand and one jobs 是一个夸张的说法，意为“数不清的杂事”，强调事情繁多琐碎，而非确切数字。"
    },
    {
        "english": "Past experience has taught us that certain accomplishments are beyond attainment.",
        "chinese": "以往的经验告诉我们有些事是办不到的。",
        "note": "1. 核心短语：beyond attainment 意为“无法实现”。其中 beyond 意为“超越…范围”，常用于表达“力所不能及”。【关联点】这和后面遇到的 This problem is beyond my understanding (这个问题我无法理解) 用法一致，都是“be beyond + 名词”结构，表示超出某个范围。\n\n2. 句型解析：核心为“事物 + teach + 人 + that从句”，即“某事教会了某人一个道理”。that 引导的宾语从句解释了“道理”的具体内容。【关联点】这和我们后面遇到的 I argued that... (我辩解说...) 结构类似，都是用 that 从句来引出所说或所教的具体内容。\n\n3. 深度理解：动词 has taught (现在完成时) 强调过去的经验至今仍有指导意义。这解释了为何人们会对某些宏大的决心 (ambitious schemes) 望而却步。"
    },
    {
        "english": "If we remain inveterate smokers, it is only because we have so often experienced the frustration that results from failure.",
        "chinese": "如果我们烟瘾大，戒不掉，那是因为屡戒屡败，失去信心。",
        "note": "1. 核心词汇：inveterate (adj.) 意为“积习难改的”，常形容难以戒除的坏习惯。frustration (n.) 指“挫败感”。result from 是一个关键短语，意为“由…造成”，强调因果。\n\n2. 句型解析：本句用 \"If..., it is only because...\" 结构，解释了“烟瘾难戒”的唯一原因：屡戒屡败带来的挫败感。这里的 because 与之前遇到的 for (That proved to be my undoing, for...) 作用相似，都是引出原因。\n\n3. 深度关联：`that results from failure` 是一个定语从句，具体说明了挫败感的来源。【关联点】这和我们遇到的 `the time I spent at exercises` (我花在锻炼上的时间) 结构类似，都是用一个从句来修饰前面的名词，使其含义更具体。\n\n4. 主题关联：本句的 failure (失败) 与之前的 `fail in our efforts` (努力失败) 和 `beyond attainment` (无法实现) 相互呼应，共同揭示了新年决心难以坚持的心理根源。"
    },
    {
        "english": "Most of us fail in our efforts at self-improvement because our schemes are too ambitious and we never have time to carry them out.",
        "chinese": "我们大多数人想自我完善却遭到失败，这是因为我们的规划过于宏大，而又根本没有时间去实施。",
        "note": "1. 核心短语：fail in our efforts (努力失败) 和 carry out a plan (执行计划) 是常用搭配。ambitious (宏大的) 形容计划不切实际，是导致失败的关键。\n\n2. 句型解析：本句结构为“结果 + because + 原因1 + and + 原因2”，清晰地解释了我们自我完善失败的两个核心原因：计划过大和时间不足。\n\n3. 【关联点】这里的 too ambitious (过于宏大) 与开篇的 formidable lists (令人生畏的清单) 意思相近，都指向失败根源。注意与后文作者吸取教训后制定的 modest ambitions (适度的目标) 形成鲜明对比。\n\n4. 【关联点】动词 fail (失败) 与后文的名词 failure (失败) 遥相呼应。短语 carry out (执行) 也在后文“新年晚会”一句中再次出现，是本文高频短语。"
    },
    {
        "english": "We also make the fundamental error of announcing our resolutions to everybody so that we look even more foolish when we slip back into our bad old ways.",
        "chinese": "我们还犯有一个根本性的错误，即把我们的决心向大家宣布。这样一旦滑回到那些老习惯上去，我们在别人的眼里会显得更加难堪。",
        "note": "1. 核心短语：slip back into our bad old ways 意为“滑回那些不好的老习惯”，生动地描绘了故态复萌的过程。【关联点】这和我们后面遇到的 got back to my old bad habit (恢复了我的旧习惯) 意思几乎完全相同，都是描述计划失败后的状态倒退。\n\n2. 句型解析：本句的核心结构是“make the error of doing sth.” (犯了做某事的错误)，其后用 so that 引导结果状语从句，说明该错误导致的后果 (显得更愚蠢)，再用 when 从句点明后果发生的时间 (当我们故态复萌时)。\n\n3. 深度关联：作者指出的这个 fundamental error (根本性错误)——公开宣布决心，恰好与他后文吸取教训后的做法 “I attempted to keep my resolutions to myself” (我尝试将决心保密) 形成鲜明对比，体现了从失败中学习的转变。"
    },
    {
        "english": "Aware of these pitfalls, this year I attempted to keep my resolutions to myself. I limited myself to two modest ambitions: to do physical exercise every morning and to read more of an evening.",
        "chinese": "我深知这些问题，于是，今年我对自己的计划要严加保密，只给自己定下两项适中的任务；每天早上锻炼身体，每天晚上多看点书。",
        "note": "1. 核心短语：Aware of these pitfalls (意识到这些问题) 指作者吸取了之前的教训。modest ambitions (适度的目标) 指不大、易实现的目标。\n\n2. 【关联点】作者决定 keep my resolutions to myself (将决心保密)，这正是为了避免之前提到的 fundamental error of announcing our resolutions (公开宣布决心的根本错误)，体现了从失败中学习。\n\n3. 【关联点】注意区分：这次作者只定下 two modest ambitions (两个适度的目标)，与开篇提到的 formidable lists (令人生畏的清单) 和 too ambitious schemes (过于宏大的规划) 形成鲜明对比，说明他变得更务实了。\n\n4. 句型解析：句首的 Aware of... 是原因状语，解释了“我”为何这样做。冒号后的两个 to do 不定式短语，具体说明了 “two modest ambitions” 的内容。"
    },
    {
        "english": "An all-night party on New Year's Eve provided me with a good excuse for not carrying out either of these new resolutions on the first day of the year, but on the second, I applied myself assiduously to the task.",
        "chinese": "新年除夕举办的一次通宵晚会，使我理直气壮地在新年头一天免去了这两项任务。不过，新年第二天，我全力以赴地照着去做了。",
        "note": "1. 核心短语：provide sb with sth (为某人提供某物) 是一个固定搭配。【关联点】注意 carry out (执行) 这个短语，这和我们之前遇到的 “we never have time to carry them out” (没时间去执行) 是同一个用法，是本文高频短语。\n\n2. 核心短语：apply oneself to (全身心投入于)。assiduously 是副词，意为“刻苦地”，加强了投入的程度。【关联点】这里的 myself 用法，和我们后面遇到的 limited myself (限制我自己) 以及 drag myself out of bed (把自己拽下床) 类似，都用反身代词强调动作作用于自身。\n\n3. 深度理解：本句用 but 连接了“找借口”和“全力以赴”两种截然相反的行为，体现了决心与惰性之间的挣扎。【关联点】这里的 a good excuse (好借口) 与后文提到的 self-discipline (自律) 形成鲜明对比，揭示了坚持新年决心的核心矛盾。"
    },
    {
        "english": "The daily exercises lasted only eleven minutes and I proposed to do them early in the morning before anyone had got up.",
        "chinese": "早锻炼一共只有11分钟，我打算在别人起床之前进行。",
        "note": "1. 核心词汇：last (vi.) 意为“持续”。propose to do sth. 意为“打算/计划做某事”。【关联点】这里的 propose to do (打算做) 与我们之前遇到的 resolve to do (下决心做) 都表达了计划，但 propose 更侧重于提出一个计划，而 resolve 语气更强，指下定决心。\n\n2. 句型解析：本句由 and 连接，描述了两件事：锻炼持续多久，以及我打算何时进行。后半句中的 before anyone had got up 是一个时间状语从句，精确说明了锻炼的时间点。\n\n3. 【关联点】这个 before 时间从句，和我们后面遇到的 before anyone found me out (在任何人发现我之前) 用法完全相同。\n\n4. 时态辨析：had got up (过去完成时) 强调“起床”这个动作发生在过去“我打算做锻炼”这个时间点之后。【关联点】这和后面遇到的 I was back to where I had started from 中的 had started 用法一致，都表示一个发生在“过去的过去”的动作。"
    },
    {
        "english": "The self-discipline required to drag myself out of bed eleven minutes earlier than usual was considerable.",
        "chinese": "这就要求我比平时早11分钟把自己从床上拽起来，这种自我约束是很艰苦的。",
        "note": "1. 核心词汇：self-discipline (自律) 与 considerable (相当大的) 结合，点明了坚持计划需要巨大努力。【关联点】这种自律与之前提到的 a good excuse (好借口) 形成鲜明对比，是新年决心的核心矛盾。\n\n2. 核心短语：drag myself out of bed (把自己从床上拽起来) 生动描绘了起床的艰难。【关联点】这和我们遇到的 limited myself (限制自己) 和 applied myself to (投身于) 用法一致，都用反身代词强调动作作用于自身。\n\n3. 句型解析：本句主干是 The self-discipline was considerable。中间的 required... 是后置定语。【关联点】这种“名词+过去分词”的修饰结构，和我们后面遇到的 a book entitled... (一本名为...的书) 完全相同。\n\n4. 结构对比：本句的主语部分很长，核心谓语 was considerable 在句尾。【关联点】这和我们后面遇到的 The time I spent at exercises gradually diminished 结构非常相似，都是用一个长长的短语或从句来定义主语“是什么”。"
    },
    {
        "english": "Nevertheless, I managed to creep down into the living room for two days before anyone found me out.",
        "chinese": "不过开头两天我还是成功地蹑手蹑脚地来到楼下起居室，被谁也没发现。",
        "note": "1. 核心短语：managed to do sth. 意为“设法做成某事”，强调付出了努力并成功。creep down 生动描绘了“蹑手蹑脚地走下来”的秘密行动。find sb. out 意为“发现某人的秘密”。\n\n2. 【关联点】这里的 managed to (成功做到) 与文中反复出现的 fail (失败) 和 frustration (挫败感) 形成鲜明对比，暗示作者在“秘密”计划上反而比公开的决心更成功。\n\n3. 句型解析：before anyone found me out 是一个时间状语从句，说明主句动作发生的截止时间。【关联点】这和我们之前遇到的 \"...before anyone had got up\" (在任何人起床之前) 用法完全相同。\n\n4. 语法细节：find out 是动词短语，当宾语是代词 me 时，必须放在中间。【关联点】这和我们之前遇到的 carry them out (执行它们) 结构一致，都是“动词+代词+副词”的顺序。"
    },
    {
        "english": "After jumping about on the carpet and twisting the human frame into uncomfortable positions, I sat down at the breakfast table in an exhausted condition.",
        "chinese": "我在地毯上跳来蹦过去，扭曲身子，摆出各种姿势，弄得浑身不舒服，然后坐到桌边吃早饭，一副筋疲力尽的样子。",
        "note": "1. 句型解析：本句采用“After + 动名词短语, 主句”的结构。句首长长的 After 短语生动描绘了原因（一通折腾），引出主句的结果（筋疲力尽地坐下）。\n\n2. 【关联点】核心词 exhausted (筋疲力尽的) 是形容词，描述运动后的状态。这与后文作者为自己辩解时提到的 exhausting myself (让自己筋疲力尽) 词根相同，前者是结果，后者是过程。\n\n3. 【关联点】作者本想通过锻炼获得精神上的 fresh (清醒)，结果却先感到了肉体上的 exhausted (筋疲力尽)。这与文中提到的 frustration (挫败感)、unsettling (令人不安) 等负面感受共同描绘了作者的挣扎。"
    },
    {
        "english": "It was this that betrayed me.",
        "chinese": "正是这副模样泄露了我的秘密。",
        "note": "1. 核心词汇：betray (vt.) 此处意为“泄露，暴露”，而非“背叛”。例如，一个不经意的表情可能会 betray one's true feelings (暴露真实情感)。\n\n2. 句型解析：本句是 “It was... that...” 强调句型，用于突出 “this” 是泄密的原因。去掉强调结构后，原句为 “This betrayed me.”。【关联点】这和我们遇到的 “it is only because...” 类似，都是为了突出句子的某个部分。\n\n3. 【关联点】注意区分：此处的 that 是强调句的标志，不同于 “Past experience has taught us that...” (宾语从句) 和 “the frustration that results from failure” (定语从句) 中的 that。"
    },
    {
        "english": "The next morning the whole family trooped in to watch the performance.",
        "chinese": "第二天早晨全家人结队来到起居室看我表演。",
        "note": "1. 核心词汇：troop (v.) 意为“成群结队地走”，生动地描绘了一家人像小分队 (troops) 一样集体行动。performance (n.) 在此指作者的晨练在家人眼中成了一场“表演”。\n\n2. 句型解析：本句核心是“主语+动作+目的”。“to watch the performance”是不定式作目的状语，说明他们进来的原因。【关联点】这和我们遇到的“resolve to do sth.”(下决心做某事)不同，后者中的“to do”是动词resolve的宾语，说明决心的内容。\n\n3. 【关联点】这次“表演”是作者计划失败的转折点。正是因为被家人围观，才引出了后文的 “unsettling” (令人不安) 以及家人的 “taunts and jibes” (嘲笑和奚落)，最终导致他热情减退。"
    },
    {
        "english": "That was really unsettling, but I fended off the taunts and jibes of the family good-humouredly and soon everybody got used to the idea. However, my enthusiasm waned.",
        "chinese": "这真叫人不好意思，但我心平气和地顶住全家人的嘲笑和奚落。不久，大家对我习以为常了，而这时我的热情却减退了。",
        "note": "1. 核心词汇：unsettling (adj.) 意为“令人不安的”，描述一种心里不舒服的感觉。【关联点】这和我们之前遇到的 frustration (挫败感) 和 exhausted (筋疲力尽的) 类似，都是作者在坚持决心过程中体验到的负面情绪。\n\n2. 核心短语：fend off the taunts and jibes 意为“顶住嘲笑和奚落”。【关联点】这里的 fend off (抵挡) 与后文的 resisting the hypnotizing effect of television (抵抗电视的诱惑) 类似，都体现了作者为坚持计划而付出的努力。\n\n3. 核心短语：get used to the idea 意为“习惯于这个想法”。【关联点】注意区分：get used to 是指“习惯新事物”，而文中多次出现的 slip back into 或 get back to 则是“退回旧习惯”，前者是适应，后者是倒退。\n\n4. 核心词汇：wane (vi.) 意为“逐渐减弱”。【关联点】这和我们之前遇到的 favorites recur (决心反复出现) 句型一致，都是“主语+不及物动词”描述主语自身变化。它也与后文的 diminished (减少) 和 fell to zero (降到零) 意思相近。"
    },
    {
        "english": "The time I spent at exercises gradually diminished.",
        "chinese": "我花在锻炼上的时间逐渐减少，",
        "note": "1. 核心词汇：diminished (v.) 意为“减少，变小”。【关联点】这和我们之前遇到的 my enthusiasm waned (热情减退了) 以及后面将看到的 the eleven minutes fell to zero (11分钟降为零) 意思相近，都生动地描述了“逐渐减少”的过程。副词 gradually (逐渐地) 也与后文的 Little by little (一点一点地) 表达方式类似。\n\n2. 句型解析：本句主干是 The time diminished (时间减少了)。其特点是主语部分很长，由一个名词 (The time) 和一个省略了that的定语从句 (I spent at exercises) 共同构成，用来具体说明是“哪一种”时间。【关联点】这和我们之前遇到的 The self-discipline required...was considerable 结构非常相似，都是用一个长定语来修饰主语。\n\n3. 语法关联：修饰主语的 I spent at exercises 是一个定语从句。【关联点】这种“名词+从句”的修饰结构，和我们之前遇到的 the frustration that results from failure (由失败造成的挫败感) 用法一致，都是为了让名词的意义更明确。"
    },
    {
        "english": "Little by little the eleven minutes fell to zero.",
        "chinese": "慢慢地从11分钟减到了零。",
        "note": "1. 核心短语：Little by little 意为“一点一点地”，生动描绘了逐渐的过程。【关联点】这和我们之前遇到的 year in year out (年复一年地) 类似，都通过词语重复来强调持续性；也和 gradually (逐渐地) 意思相同。\n\n2. 核心词汇：fell to zero 意为“降到了零”。动词 fall 在此意为“减少，下降”。【关联点】这和我们之前遇到的 my enthusiasm waned (热情减退了) 和 The time...diminished (时间减少了) 意思相近，都是描述数量或程度的降低。\n\n3. 句型解析：本句核心是主谓结构 (S+V)：the eleven minutes (主语) + fell (谓语)。动词 fell 是不及物动词，描述主语自身的变化。【关联点】这和 favorites recur (决心反复出现) 以及 enthusiasm waned (热情减退) 的句型完全一致。"
    },
    {
        "english": "By January 10th, I was back to where I had started from.",
        "chinese": "到了1月10日，我恢复了原来的作息时间。",
        "note": "1. 核心短语：back to 意为“回到…”。【关联点】这和我们之前遇到的 slip back into (滑回) 和 got back to (恢复) 意思相近，但本句指回到起点，后两者则指故态复萌。\n\n2. 时态辨析：本句用“was (过去时) + had started (过去完成时)”表示“开始”这个动作发生在“回到”之前。【关联点】这和我们之前遇到的 ...before anyone had got up (在任何人起床之前) 用法完全一致，都表示一个发生在“过去的过去”的动作。\n\n3. 深度理解：这句话是作者锻炼计划失败的总结。在经历了种种努力 (self-discipline) 和挣扎 (exhausted) 后，他又回到了原点，与开篇提到的 a monotonous regularity (单调的规律) 形成呼应。"
    },
    {
        "english": "I argued that if I spent less time exhausting myself at exercises in the morning, I would keep my mind fresh for reading when I got home formwork",
        "chinese": "我辩解说，早晨少耗费精力锻炼，晚上下班回家看书时头脑更清醒些。",
        "note": "1. 句型解析：核心为 “I argued that...”，即“我辩解说…”。that引导的宾语从句是辩解的具体内容。【关联点】这和我们之前遇到的 Past experience has taught us that... (经验教会我们...) 结构完全相同，都是用that从句引出观点或内容。\n\n2. 核心词汇：exhausting myself 意为“让自己筋疲力尽”。【关联点】注意区分：这和我们之前遇到的 in an exhausted condition (处于筋疲力尽的状态) 词根相同。exhausting是过程，exhausted是结果。\n\n3. 虚拟语气：if I spent..., I would keep... 是对与现在事实相反的假设，表示“如果我少花时间…我就会…”。【关联点】注意区分：这和我们遇到的 If we remain... (如果我们仍然是...) 这种真实条件句不同，后者描述的是真实的可能性。\n\n4. 核心短语：keep my mind fresh 意为“保持头脑清醒”。【关联点】这正是作者锻炼的初衷，但实际结果却是身体上的 exhausted (筋疲力尽)，理想与现实形成对比，也呼应了文中的 frustration (挫败感)。"
    },
    {
        "english": "Resisting the hypnotizing effect of television, I sat in my room for a few evenings with my eyes glued to book.",
        "chinese": "有几天晚上，我极力摆脱了电视的诱惑，坐在自己的房间里，两眼盯在书上。",
        "note": "1. 核心短语：resist the effect (抵抗影响)，指与诱惑对抗。eyes glued to book (眼睛紧盯书本) 生动描绘了专注。【关联点】这种“对抗”贯穿全文，从 fend off (抵挡) 家人嘲笑，到 resist (抵抗) 电视诱惑，都展现了作者内心的挣扎。\n\n2. 句型解析：句首的 Resisting... 是现在分词短语作状语，描绘了主语“我”的伴随动作。【关联点】这和我们后面遇到的 feeling cold and lonely, I went... 以及 ...sat... pretending to read 结构完全相同，都是用现在分词短语补充说明主语的状态或动作。\n\n3. 句型解析：句尾的 with my eyes glued to book 是“with复合结构”作伴随状语，具体描绘了“我”坐着时的神态，让画面更生动。"
    },
    {
        "english": "One night, however, feeling cold and lonely, I went downstairs and sat in front of the television pretending to read.",
        "chinese": "可是，有一天夜里，我感到又冷又孤单，便来到楼下坐在电视机前假装看书。",
        "note": "1. 句型解析：本句亮点是两个现在分词短语：feeling... 描述了“我”当时的状态，而 pretending... 则描绘了“我”坐着时的伴随动作。【关联点】这和我们之前遇到的 \"Resisting..., I sat...\" 结构完全相同，都是用现在分词短语来生动描绘主语的状态或动作。\n\n2. 核心词汇与短语：however (然而) 表示转折。pretend to do sth. 意为“假装做某事”。【关联点】however 与 \"However, my enthusiasm waned.\" 用法相同。in front of (在…前面) 也在后文 \"dozing off in front of the screen\" 中出现。"
    },
    {
        "english": "That proved to be my undoing, for I soon got back to my old bad habit of dozing off in front of the screen.",
        "chinese": "这下我可完了，因为不一会儿，我就恢复了以前的坏习惯，在屏幕前打起瞌睡来。",
        "note": "1. 核心结构：That proved to be my undoing (那成了我的败因)。prove to be 是一个系动词短语，意为“结果证明是”，引出表语 my undoing。【关联点】这里的 undoing (败因) 是全文“失败”主题的最终体现，与之前的 fail (失败) 和 frustration (挫败感) 遥相呼应。\n\n2. 连词辨析：for 在此意为“因为”，引出原因。【关联点】注意区分：这和我们之前遇到的 because (e.g., ...because our schemes are too ambitious) 作用相同，但 for 的语气更偏向于补充说明，常用于书面语。\n\n3. 核心短语：got back to my old bad habit (恢复了旧的坏习惯)。【关联点】这和我们之前遇到的 slip back into our bad old ways (滑回老习惯) 意思几乎完全相同，都生动地描述了故态复萌。而 dozing off in front of the screen (在屏幕前打瞌睡) 也与之前的 sat in front of the television 场景一致。"
    },
    {
        "english": "I still haven't given up my resolution to do more reading.",
        "chinese": "但我还没有放弃多看些书的决心。",
        "note": "1. 核心词汇：give up (放弃) 和 resolution (决心)。【关联点】resolution 是本文核心词，这和我们开篇遇到的 a time for resolutions (下决心的时候) 以及动词 resolve to do (下决心做) 是同根词。多读书正是作者之前立下的两个 modest ambitions (适度的目标) 之一。\n\n2. 句型解析：本句核心是“I haven't given up my resolution”。后面的 to do more reading 是不定式短语作后置定语，具体说明“决心”的内容。【关联点】这种“名词+to do”的修饰结构，和我们之前遇到的 ambitions: to do... (目标是去做…) 以及后面遇到的 time to read it (读它的时间) 用法完全相同。\n\n3. 时态与主题：现在完成时 haven't given up 强调“至今仍未放弃”。【关联点】这和文中反复出现的 fail (失败)、waned (减退)、got back to (恢复旧习) 等描述计划失败的词语形成对比，是作者对自己仅存的决心所做的最后辩护，充满讽刺意味。"
    },
    {
        "english": "In fact, I have just bought a book entitled How to Read a Thousand Words a Minute.",
        "chinese": "事实上，我刚买来一本叫《一分钟读一千字的诀窍》的书。",
        "note": "1. 核心结构：a book entitled... 意为“一本名叫…的书”。entitled 是过去分词作后置定语，用来修饰 a book。【关联点】这和我们之前遇到的 The self-discipline required... (被要求的自律) 结构完全相同，都是“名词+过去分词”的修饰方式。\n\n2. 时态辨析：have just bought 是现在完成时，强调“刚刚买”这个动作的结果（我现在拥有这本书）。【关联点】这和我们之前遇到的 Past experience has taught us... (经验教会了我们...) 用法类似，都用现在完成时强调过去动作对现在的影响。\n\n3. 主题关联：作者买这本书是为了解决“没时间读书”的问题，这本身就是一种自我完善的尝试 (self-improvement)。【关联点】然而讽刺的是，在文章结尾我们发现，他“just haven't had time to read it!” (根本没时间读它)，这完美呼应了全文“决心常立，计划常败”的主题。"
    },
    {
        "english": "Perhaps it will solve my problem, but I just haven't had time to read it!",
        "chinese": "也许这本书能解决我的问题，但我一直还没时间去看这本书！",
        "note": "1. 核心短语：have time to do sth. 意为“有时间做某事”。【关联点】这和我们之前遇到的失败原因 “we never have time to carry them out” (我们从没时间去执行) 遥相呼应，都点明了“时间不足”是计划失败的核心障碍。\n\n2. 句型解析：本句由 but 连接，形成转折：书或许能解决问题，但我却没时间读。后半句的 to read it 是不定式作定语，修饰 time。【关联点】这和我们之前遇到的 resolution to do more reading (多读书的决心) 结构完全相同，都是用“名词+to do”来说明具体内容。\n\n3. 时态辨析：现在完成时 haven't had 强调了“没时间”这一状态从过去持续到现在。【关联点】这和我们之前遇到的 Past experience has taught us... (经验教会了我们) 用法类似，都用现在完成时强调过去的状态或动作对现在造成的影响。"
    }
]