[
    {
        "english": "Punctuality is a necessary habit in all public affairs in civilized society.",
        "chinese": "准时是文明社会中进行一切社交活动时必须养成的习惯。",
        "note": "1. 本句是经典的主谓表结构(S+V+P)，核心是“Punctuality is a necessary habit”，清晰地点明了主语“准时”的本质。后面的两个介词短语则进一步限定了该习惯适用的范围。\n\n2. 【关联点】本句的核心词 Punctuality (准时)，与后面将出现的 unpunctuality (不准时) 和 over-punctual (太过准时) 形成对比。注意 un- (否定) 和 over- (过度) 这两个前缀的用法。\n\n3. 【关联点】这和我们之后遇到的“their only fault is cutting things fine”句型一致，都是用系动词 is 来解释说明主语是什么。"
    },
    {
        "english": "Without it, nothing could ever be brought to a conclusion; everything would be in state of chaos.",
        "chinese": "不准时将一事无成，事事都会陷入混乱不堪的境地。",
        "note": "1. 本句用“Without..., ...”结构引出虚拟条件，即“如果没有准时”。分号后的两个分句用could和would描绘了并列的、假设性的糟糕后果，结构清晰有力。\n\n2. 【关联点】词组 be brought to a conclusion 意为“被完成”。in a state of chaos (混乱状态) 与前文知识分子将一切 coordinated and organized (协调组织好的) 形成鲜明对比，突显了准时的重要性。\n\n3. 【关联点】注意被动语态 be brought to... 的用法。这和我们遇到的 people are often reproached (被责备) 以及 rules could not be broken (不能被打破) 类似，都强调动作的承受者是句子的焦点。"
    },
    {
        "english": "Only in a sparsely-populated rural community is it possible to disregard it.",
        "chinese": "只有在人口稀少的农村，才可以忽视准时的习惯。",
        "note": "1. 本句为“Only+状语”置于句首引发的部分倒装，即将系动词 is 提至主语 it 之前以示强调。这是英语中常见的强调句式。\n\n2. 句中 it is possible to do sth 是经典句型，it 为形式主语，真正的主语是后面的不定式短语 to disregard it (忽视这件事)。\n\n3. 【关联点】这个 it 作形式主语的用法，和我们遇到的 It is hard for... to waste time 结构完全相同，可以对比学习。\n\n4. 【关联点】词汇 disregard (忽视) 强调主观上的漠视。同时，sparsely-populated rural community (人烟稀少的农村) 与开篇的 civilized society (文明社会) 形成场景对比。"
    },
    {
        "english": "In ordinary living, there can be some tolerance of unpunctuality.",
        "chinese": "在日常生活中人们可以容忍一定程度的不准时。",
        "note": "1. 本句使用“There can be...”句型，表示“可以存在...”。核心是阐述在“ordinary living”（日常生活）这个场景下，“some tolerance of unpunctuality”（对不准时的一些容忍）是存在的。\n\n2. 【关联点】核心词 unpunctuality (不准时) 由 punctual (准时的) 加上否定前缀 un- 构成。注意与开篇的 Punctuality (准时) 和后文的 over-punctual (太过准时) 形成一组反义和程度对比词。\n\n3. 【关联点】词汇 tolerance (容忍) 是一种态度。这和我们之后遇到的知识分子因专注于工作而迟到会被 forgiven (原谅) 的具体情境相呼应，前者是态度，后者是结果。\n\n4. 【关联点】这里的 ordinary living (日常生活) 与后面提到的 sparsely-populated rural community (人烟稀少的农村) 形成场景对比，暗示了不同环境下对准时的要求不同。"
    },
    {
        "english": "The intellectual, who is working on some abstruse problem, has everything coordinated and organized for the matter in hand.",
        "chinese": "一个专心钻研某个复杂问题的知识分子，为了搞好手头的研究，要把一切都协调一致，组织周密。",
        "note": "1. 本句主干为“主谓宾补”句型(S+V+O+C): The intellectual has everything coordinated and organized。其中 has 意为“使…处于某种状态”，宾补 coordinated and organized (过去分词) 说明了宾语 everything 的状态。\n\n2. 中间的“, who is working on some abstruse problem,”是一个定语从句，补充说明 intellectual 的工作状态，让人物形象更具体。\n\n3. 【关联点】注意这里的宾补是过去分词(coordinated)，表示宾语“被协调”。这和我们之后遇到的 watch that train disappear (看火车消失) 不同，后者的宾补是动词原形，表示宾语的主动行为。\n\n4. 【关联点】知识分子将一切 coordinated and organized (协调组织好的)，这与之前提到的 in a state of chaos (混乱状态) 形成鲜明对比，突显了有序的重要性。"
    },
    {
        "english": "He is therefore forgiven if late for a dinner party.",
        "chinese": "因此，他要是赴宴迟到了会得到谅解。",
        "note": "1. 本句核心结构为主谓表(He is forgiven)，后接一个省略了主语和be动词的条件状语从句(if he is late的简化)，结构紧凑。\n\n2. 词汇 forgiven (被原谅的) 是过去分词作表语，表被动状态。【关联点】这和我们遇到的 be brought to..., are reproached, could not be broken 等被动语态用法一致，都强调主语是动作的承受者。\n\n3. 【关联点】注意区分 forgiven (被原谅的) 和 unforgivable (不可原谅的)。前者呼应了前文提到的 tolerance (容忍) 的态度，后者则体现了规则的严肃性。"
    },
    {
        "english": "But people are often reproached for unpunctuality when their only fault is cutting things fine.",
        "chinese": "但有些人不准时常常因为掐钟点所致，他们常常受到责备，",
        "note": "1. 核心词组：be reproached for (因…被责备)，cut things fine (掐钟点)。本句指出人们常因掐点办事而被责备不准时。\n\n2. 句型为“主句+when引导的时间状语从句”。主句是被动语态，从句是“主谓表”结构，用动名词短语作表语。\n\n3. 【关联点】被动语态are reproached，与我们遇到的be brought to a conclusion (被完成)和He is forgiven (被原谅)用法一致，都强调动作的承受者。\n\n4. 【关联点】后半句“their only fault is cutting things fine”的句型，和开篇句“Punctuality is a necessary habit”完全一致，都是用is来解释主语。"
    },
    {
        "english": "It is hard for energetic, quick-minded people to waste time, so they are often tempted to finish a job before setting out to keep an appointment.",
        "chinese": "精力充沛、头脑敏捷的人极不愿意浪费时间，因此他们常想做完一件事后再去赴约。",
        "note": "1. 句型核心是“It is + adj. + for sb to do sth”，其中 it 是形式主语，真正的主语是后面的不定式短语 to waste time。\n\n2. 【关联点】这和我们遇到的“Only... is it possible to disregard it”句型完全相同，都是用 it 作形式主语，可以对比学习。\n\n3. 后半句用 so 连接结果，核心短语 be tempted to do sth 意为“很想做某事”，生动描绘了这类人急于完成工作的心理。\n\n4. 【关联点】这种“想先做完一件事”的行为，与前文提到的知识分子 (intellectual) 专注于手头工作 (matter in hand) 的形象相呼应，解释了他们为何有时会“掐点办事”(cut things fine)。"
    },
    {
        "english": "If no accidents occur on the way, like punctured tires, diversions of traffic, sudden descent of fog, they will be on time.",
        "chinese": "要是路上没有发生如爆胎、改道、突然起雾等意外事故，他们决不会迟到。",
        "note": "1. 本句是典型的if条件句，遵循“主将从现”原则：即if从句用一般现在时(occur)，主句用将来时(will be)。中间like引导的部分是列举意外情况。\n\n2. 【关联点】这和我们遇到的“Without it, ...”所表达的虚拟条件，以及“if late for a dinner party”这种省略形式的条件句，形成了鲜明对比。\n\n3. 【关联点】动词occur意为“发生”，是不及物动词。注意与后面遇到的befell区分，befell常指意想不到的事情“降临到”某人身上，是及物动词。\n\n4. 【关联点】短语on time (准时) 呼应了全文主题Punctuality。注意punctured tires(爆胎)中的punctured，它是过去分词作定语，表示“被刺破的”。"
    },
    {
        "english": "They are often more industrious, useful citizens than those who are never late.",
        "chinese": "他们与那些从不迟到的人相比，常常是更勤奋有用的公民。",
        "note": "1. 本句是典型的比较句，核心结构为“more + adj. + than...”，用于比较“他们”与“从不迟到的人”。\n\n2. 注意“those who...”的用法，它常用来指代“那些...的人”。【关联点】这和我们之后遇到的“The guest who arrives...”用法类似，都是用定语从句来限定先行词指代的人。\n\n3. 【关联点】注意区分本句的“more...than”（比...更）结构，与之后“The over-punctual can be as much a trial...as...”（和...一样）的同级比较结构。\n\n4. 【关联点】词汇 industrious (勤奋的) 呼应了前文提到的 energetic, quick-minded people (精力充沛、头脑敏捷的人) 的特质，他们因专注于工作而可能迟到。"
    },
    {
        "english": "The over-punctual can be as much a trial to others as the unpunctual.",
        "chinese": "早到的人同迟到的人一样令人讨厌。",
        "note": "1. 本句核心为“as...as...”同级比较结构，指出“早到的人”(The over-punctual)和“迟到的人”(the unpunctual)在“令人讨厌”(a trial)的程度上一样。\n\n2. “The over-punctual”与“the unpunctual”均使用“The+形容词”指代一类人。【关联点】注意前缀over-(过度)与un-(否定)的用法，它们都源于贯穿全文的核心词punctual。\n\n3. 【关联点】注意区分本句的“as...as...”同级比较，和我们之前遇到的“more industrious...than...”的等级比较，前者是“和...一样”，后者是“比...更”。\n\n4. 【关联点】词汇 trial 在此意为“讨厌的人或事”。这和我们之后遇到的 nuisance (令人讨厌的人或事) 含义相近，可以一同记忆。"
    },
    {
        "english": "The guest who arrives half an hour too soon is the greatest nuisance.",
        "chinese": "客人提前半小时到达是令人讨厌的。",
        "note": "1. 本句主干为主谓表结构(The guest... is... nuisance)，主语The guest后接一个who引导的定语从句，用以明确是哪一种客人。\n\n2. 【关联点】句中“who arrives...”的用法，和我们遇到的“those who are never late”完全一致，都是用定语从句来限定先行词，指代某一类人。\n\n3. 【关联点】核心词 nuisance (令人讨厌的人或事) 含义上与我们遇到的 trial (讨厌的人或事) 非常接近，可以一同记忆。\n\n4. 【关联点】短语 too soon (太早) 描述的行为，正是前文提到的 The over-punctual (太过准时的人) 的具体表现，两者在语意上紧密相关。"
    },
    {
        "english": "Some friends of my family had this irritating habit.",
        "chinese": "我家有几个朋友就有这有令人恼火的习惯。",
        "note": "1. 本句是简洁的主谓宾结构，清晰地说明了“谁(Some friends of my family)有什么(had this irritating habit)”。核心词 irritating 意为“令人恼火的”，生动地描述了习惯的性质。\n\n2. 【关联点】核心词 habit (习惯) 贯穿全文。这和我们开篇遇到的“Punctuality is a necessary habit” (准时是必要的习惯) 直接呼应，此处则引出了一个坏习惯的例子。\n\n3. 【关联点】注意 irritating (令人恼火的) 这个词。这和我们之后遇到的 trial (讨厌的事) 和 nuisance (令人讨厌的人或事) 属于同一语义场，都表达了“烦人”的概念，可以归类记忆。"
    },
    {
        "english": "The only thing to do was ask them to come half an hour later than the other guests.",
        "chinese": "唯一的办法就是请他们比别的客人晚来半小时。",
        "note": "1. 本句是主谓表结构，主语“The only thing to do”由不定式“to do”修饰。表语是动词短语“ask them to come...”，具体说明了“唯一的办法”是什么。\n\n2. 【关联点】句中“ask them to come”的用法，和我们之后遇到的“cause the friends...to make two journeys”结构相似，都是“动词+宾语+不定式”作宾补。\n\n3. 【关联点】本句“...was ask...”结构，与我们遇到的“An even harder situation is to be...”类似，都是用不定式作表语。注意本句表语ask前省略了to。\n\n4. 【关联点】这里的“later than”（比...晚）是时间比较。注意区分我们遇到的“more industrious than”（比...更勤奋）的等级比较，以及“as much a trial as”（和...一样讨厌）的同级比较。"
    },
    {
        "english": "Then they arrived just when we wanted them.",
        "chinese": "这样，他们可以恰好在我们要求的时间到达。",
        "note": "1. 核心短语 just when 意为“恰好在…时候”，引导一个时间状语从句，精确说明主句动作“arrived”发生的时间点。句首 Then 在此表示“于是，这样一来”，引出结果。\n\n2. 【关联点】这和我们遇到的“arriving at the very moment when the train is drawing out...”类似，都是用 when 引导一个从句来精确描述某个时间点。\n\n3. 【关联点】注意 just 在此处的强调作用。这和我们之后遇到的“Just as that moment the train came into the station”中的 just as 用法异曲同工，都突出了时间的巧合性。"
    },
    {
        "english": "If you are citing a train, it is always better to be comfortably early than even a fraction of a minted too late.",
        "chinese": "如果赶火车，早到总比晚到好，哪怕早到一会儿也好。",
        "note": "1. 句型核心是“It is better to do A than to do B”，意为“做A比做B更好”。it是形式主语，真正的主语是后面的不定式短语。\n\n2. 【关联点】这个 it 作形式主语的用法，和我们遇到的“It is hard for... to waste time”结构完全相同，可以对比学习。\n\n3. 核心短语：comfortably early (充裕地提早) 与 a fraction of a minute too late (哪怕晚一分半秒) 形成鲜明对比。\n\n4. 【关联点】注意区分本句的“better...than”等级比较，与我们遇到的“more industrious than”和“as...as...”等其他比较结构。"
    },
    {
        "english": "Although being early may mean wasting a little time, this will be less than if you miss the train and have to wait an hour or more for the next one; and you avoid the frustration of arriving at the very moment when the train is drawing out of the station and being unable to get on it.",
        "chinese": "虽然早到可能意味着浪费一点时间，但这比误了火车等上一个多小时坐下班车浪费的时间要少，而且可以避免那种正好在火车驶出站时赶到车站，因上不去车而感到的沮丧。",
        "note": "1. 本句结构清晰，用Although引出让步（早到会浪费时间），主句用less than进行利弊比较，再用and引出第二个好处（避免沮丧），逻辑层层递进。\n\n2. 【关联点】短语“at the very moment when...”意为“恰好在…时刻”。这和我们遇到的“just when we wanted them”（恰好在我们想要他们的时候）用法类似，都用来精确描述一个时间点。\n\n3. 【关联点】这里的“wasting a little time”（浪费一点时间）与前文“It is hard for... people to waste time”（浪费时间是困难的）相呼应，从不同角度探讨了时间观念。\n\n4. 【关联点】本句用“less than”作比较。注意区分我们遇到的“more industrious than”（比...更）的等级比较，以及“as much a trial as”（和...一样）的同级比较。"
    },
    {
        "english": "An even harder situation is to be on the platform in good time for a train and still to see it go off without you.",
        "chinese": "更难堪的情况是虽然及时赶到站台上，却眼睁睁地看着那趟火车启动，把你抛下。",
        "note": "1. 本句是主谓表结构，核心是“A situation is to do... and to do...”。表语由两个并列的不定式短语构成，描述了这种“难堪情况”的具体内容。\n\n2. 核心短语 to see it go off 是“感官动词+宾语+动词原形”结构，生动描绘了“眼睁睁看着它离开”的无奈画面。\n\n3. 【关联点】本句“...is to be...”的用法，和我们遇到的“The only thing to do was ask...”结构类似，都是用不定式作表语，解释说明主语是什么。\n\n4. 【关联点】注意“see it go off”中宾补go off是动词原形。这和我们之后遇到的“watch that train disappear”用法完全一致，都表示看到了动作的全过程。\n\n5. 【关联点】句中“眼睁睁看着火车开走”的无奈，与后文提到的“avoid the frustration of arriving at the very moment when the train is drawing out”所描述的沮丧感，在情感上是相通的。"
    },
    {
        "english": "Such an experience befell a certain young girl the first time she was traveling alone.",
        "chinese": "一个小姑娘第一次单独出门就碰到了这种情况。",
        "note": "1. 核心动词 befell (vt.)，指意想不到的事“降临到”某人身上。后半句 the first time... 是时间状语，点明事件背景。\n\n2. 【关联点】注意区分 befell 和我们之前遇到的 occur。befell 是及物动词，后面直接跟承受者(a girl)；而 occur 是不及物动词，仅表示事件“发生”，如 accidents occur。\n\n3. 【关联点】本句是下文小姑娘在火车站一系列经历的总起句。Such an experience (这样的经历) 具体指什么，将在后续句子中展开，例如她被告知早到两小时(was two hours too soon)、眼看火车开走(watch that train disappear)等。"
    },
    {
        "english": "She entered the station twenty minutes before the train was due, since her parents had impressed upon her that it would be unforgivable to miss it and cause the friends with whom she was going to stay to make two journeys to meet her.",
        "chinese": "在火车进站20分钟前她就进了车站。因为她的父母再三跟她说，如果误了这趟车，她的东道主朋友就得接她两趟，这是不应该的。",
        "note": "1. 核心词：impress upon (强调)，unforgivable (不可原谅的)。【关联点】注意区分 unforgivable 和我们遇到的 forgiven (被原谅的)，前者体现了规则的严肃性。\n\n2. 句型：cause sb to do sth (导致某人做某事)。【关联点】这和我们遇到的 ask them to come 结构类似，都是“动词+宾语+不定式”作宾补。\n\n3. 【关联点】句中 it would be unforgivable to... 的用法，和我们遇到的 It is hard to... 和 It is better to... 结构完全相同，都是用 it 作形式主语。\n\n4. 【关联点】时态：had impressed (过去完成时)表示动作发生在过去另一动作(entered)之前。这和我们之后遇到的 had written down 用法一致，都强调了动作的先后顺序。"
    },
    {
        "english": "She gave her luggage to a porter and showed him her ticket.",
        "chinese": "她把行李交给搬运工并给他看了车票。",
        "note": "1. 本句由and连接两个并列动作。第一个是“give sth to sb”结构，第二个是“show sb sth”的双宾语结构。注意后者也可以写成“show sth to sb”的形式。\n\n2. 核心词汇：luggage (行李) 是不可数名词，指行李总称，没有复数形式。\n\n3. 【关联点】这里的 porter (搬运工) 和我们之后遇到的 station master (站长) 都是与火车站场景相关的人物词汇，可以归类记忆。\n\n4. 【关联点】注意区分“showed him her ticket”这种双宾语结构，和我们遇到的“watch that train disappear”这种宾语+宾补结构。前者是“给谁看什么”，后者是“看某物做某事”。"
    },
    {
        "english": "To her horror he said that she was two hours too soon.",
        "chinese": "搬运工说她早到了两个小时，她听后大吃一惊。",
        "note": "1. 核心短语“To her horror”意为“令她震惊的是”，常置于句首，为整个句子设定了惊讶的情绪基调。\n\n2. 句子的主干是“he said that...”，即“他说...”。【关联点】这和我们遇到的“he agreed that...”(他同意...)和“indicated that...”(表明...)结构完全相同，都是用that引导宾语从句，说明动词的具体内容。\n\n3. 短语“two hours too soon”意为“早了两小时”。【关联点】注意这里的too soon(太早)，与我们遇到的“The guest who arrives... too soon”直接呼应，也与“a fraction of a minute too late”(晚了一点点)形成鲜明反差。"
    },
    {
        "english": "She felt inhere handbag for the piece of paper on which her father had written down al the details of the journey and gave it to the porter.",
        "chinese": "她从钱包里摸出一张纸条，那上面有她父亲对这次旅行详细说明，她把这张纸条交给了搬运工。",
        "note": "1. 本句由and连接两个并列动作(felt和gave)。中间的 on which... 是一个定语从句，用来修饰 a piece of paper，说明纸上写了什么。\n\n2. 核心时态：had written down (过去完成时) 表示“写下”的动作发生在 felt (摸索) 和 gave (递给) 这两个过去动作之前。【关联点】这和我们遇到的 her parents had impressed upon her 用法完全一致，都强调了动作的先后顺序。\n\n3. 【关联点】注意 on which... 的用法，它用来修饰事物(paper)。这和我们遇到的 who... (修饰 a guest) 和 with whom... (修饰 friends) 类似，都是用定语从句来补充说明先行词。\n\n4. 【关联点】句末 gave it to the porter 的用法，与我们遇到的 She gave her luggage to a porter 结构完全相同，都是“give sth to sb”的句式。"
    },
    {
        "english": "He agreed that a train did come into the station at the time on the paper and that it did stop, but only to take on mail, not passengers.",
        "chinese": "搬运工说，正如纸条所说，确有一趟火车在那个时刻到站，但它只停站装邮件，不载旅客。",
        "note": "1. 核心结构为“He agreed that... and that...”，用两个并列的that从句作宾语，清晰陈述了搬运工同意的两件事。\n\n2. 动词强调：did come/did stop 用助动词did强调动作“确实”发生。【关联点】这和我们遇到的Only...句首倒装一样，都是英语中用于加强语气的常见手法。\n\n3. 【关联点】本句“agreed that...”的用法，和我们遇到的“he said that...”以及“indicated that...”结构完全相同，都是用that引导宾语从句，说明动词的具体内容。\n\n4. 核心短语 take on mail, not passengers (装邮件，不载客) 用“only... not...”结构形成对比，揭示了误会的根源。这解释了为何女孩最终还是“was left behind”。"
    },
    {
        "english": "The girl asked to see a timetable, feeling sure that her father could not have made such a mistake.",
        "chinese": "姑娘要求看到时刻表，因为她相信父亲不能把这么大的事弄错。",
        "note": "1. 核心结构是现在分词短语 feeling sure... 作状语，生动地解释了主句动作的原因，即她“确信”父亲不会犯错。\n\n2. 【关联点】这和我们遇到的“The girl, tears streaming down her face, begged...”类似，都是用分词短语来补充说明主语当时的状态，让描述更形象。\n\n3. 情态动词短语 could not have made 表示对过去事情“不可能”的确定推测，语气非常强烈。\n\n4. 【关联点】句中 ask to do (要求做某事) 的用法，和我们遇到的 begged to be allowed (央求被允许) 结构相似，都表达了请求。"
    },
    {
        "english": "The porter went to fetch one and arrive back with the station master, who produced it with a flourish and pointed out a microscopic 'o' beside the time of the arrival of the train at his station; this little 'o' indicated that the train only stopped for mail.",
        "chinese": "搬运工跑回去取时刻表，同时请来了站长。站长拿着时刻表一挥手，指着那趟列车到站时刻旁边一个很小的圆圈标记。这个标记表示列车是为装邮件而停车。",
        "note": "1. 本句用and, who和分号(;)连接了三个连续的动作场景，生动地叙述了搬运工取时刻表、站长指出标记、标记表明含义的全过程。\n\n2. 核心词：with a flourish (潇洒地挥舞)，microscopic (极小的)。动词 indicate 意为“表明，指出”。\n\n3. 【关联点】句中 who produced it... 是定语从句。这和我们遇到的 The intellectual, who is working... 以及 The guest who arrives... 用法一致，都用来补充说明先行的人。\n\n4. 【关联点】indicated that... 的用法，和我们遇到的 he said that... 及 he agreed that... 结构完全相同，都是用that引导宾语从句，说明动词的具体内容。"
    },
    {
        "english": "Just as that moment the train came into the station.",
        "chinese": "正在这时，火车进站了。",
        "note": "1. 核心短语 Just as... 意为“恰好在…时候”，常置于句首以强调时间的巧合性，使叙述更具戏剧性。\n\n2. 【关联点】这和我们遇到的“Then they arrived just when...”中的 just when 用法异曲同工，都用 just 突出了时间的精确。\n\n3. 句子主干为“the train came into the station”，是简洁的主谓结构，其中 came 是不及物动词，into the station 是地点状语。\n\n4. 【关联点】本句核心动作 the train came (主谓结构)，与我们遇到的 they arrived 结构一致，都简洁地描述了一个动作的发生。"
    },
    {
        "english": "The girl, tears streaming down her face, begged to be allowed to slip into the guard's van.",
        "chinese": "女孩泪流满面，央求让她不声不响地到押车员车厢里去算了。",
        "note": "1. 核心短语 begged to be allowed... (央求被允许...)，生动地表达了女孩迫切的请求。【关联点】这和我们遇到的 asked to see a timetable (要求看时刻表) 结构相似，都表达了请求。\n\n2. 中间的 tears streaming down her face 是现在分词短语作状语，生动描绘了女孩央求时的伴随状态。【关联点】这和我们遇到的 feeling sure... (确信...) 用法完全一致，都用来补充说明主语当时的状态。\n\n3. 注意被动语态 to be allowed (被允许)。【关联点】这和我们遇到的 be brought to a conclusion (被完成), is forgiven (被原谅), are reproached (被责备) 等用法一致，都强调主语是动作的承受者。"
    },
    {
        "english": "But the station master was adamant: rules could not be broken and she had to watch that train disappear towards her destination while she was left behind.",
        "chinese": "但站长态度坚决，规章制度不能破坏，姑娘只得眼看那趟火车消逝在她要去的方向而撇下了她。",
        "note": "1. 核心词 adamant 意为“坚决的”，生动刻画了站长不容商量的态度。【关联点】这与前文提到的 tolerance (容忍) 形成对比，也因其导致的后果呼应了 unforgivable (不可原谅的)。\n\n2. 句型 watch that train disappear 是“感官动词+宾语+动词原形”结构。【关联点】这和我们遇到的 to see it go off (看着它开走) 用法完全一致，都生动描绘了目睹一个完整动作发生时的无奈。\n\n3. 句中包含两个被动语态：rules could not be broken 和 she was left behind。【关联点】这和我们遇到的 be brought to..., is forgiven, are reproached, be allowed 等用法一致，都强调主语是动作的承受者。"
    }
]