[
    {
        "english": "The old lady was glad to be back at the block of flats where she lived.",
        "chinese": "老妇人回到了她居住的公寓楼，心里很高兴。",
        "note": "1. glad to be back: 高兴回来。这是一个常用句型“be + 形容词 + to do”，用来解释高兴的原因。【关联点】这和我们后面遇到的 `she was ready to set off` (她准备出发) 结构类似，都是用不定式说明形容词的原因或内容。\n\n2. block of flats: 公寓楼。英式英语用法。【关联点】注意，flat (公寓) 这个词在本文中多次出现，比如 `ransacked flat` (被洗劫的公寓)，是理解故事场景的关键。\n\n3. where she lived: 一个地点“标签”，用来修饰前面的“公寓楼”，说明是“她住的”那一栋。【关联点】注意区分：`where`修饰地点，而后面我们会遇到用`who`修饰人 (`intruders who...`) 和用`that/which`修饰物 (`bundle that...`) 的情况。"
    },
    {
        "english": "Her shopping had tired her and her basket ad grown heavier with every step of the way home.",
        "chinese": "去商店买东西把她搞得筋疲力尽；在回家的路上，她每走一步，就感到手里的篮子又重了一点。",
        "note": "1. 核心动词：tire (vt. 使疲劳) 和 grow (vi. 变得)。句中“购物”是主语，主动“使她疲劳”。而 grow heavier 表示“变得更重”，描述篮子状态的渐变。\n\n2. 句型与时态：这是一个由 and 连接的并列句。前半句是“主谓宾”，后半句是“主谓表”。【关联点】注意过去完成时 had tired/had grown，表示动作发生在过去某个时间点之前。这和我们遇到的 she had turned the keys (她早已锁了门) 用法一致，是理解故事时间线的关键。\n\n3. 生动表达：with every step of the way home (在回家的每一步路上) 是一个非常形象的短语，它强调了负担是随着步伐一步步加重的，让画面感十足。"
    },
    {
        "english": "In the life her thoughts were on lunch and a good rest; but when she got out at her own floor, both were forgotten in her sudden discovery that her front door was open.",
        "chinese": "她乘上电梯后，只想着午餐和好好休息一下。但她到自己的楼层走出电梯后，就把这两件事忘了个干净，因为她突然发现她家的大门开着。",
        "note": "1. 核心短语: her thoughts were on (她的心思在...) 描述了她最初放松的状态。注意，原文 In the life 极可能是 In the lift (在电梯里) 的笔误，点明了场景。\n\n2. 结构转折: but 是转折点，将“期待休息”和“惊恐发现”对立起来。both were forgotten 使用被动语态，强调“午餐和休息”是因震惊而被动忘记的，而非她主动不想了。\n\n3. 关键信息: in her sudden discovery that... (在她突然发现...)，其中 that 引导的从句等于直接解释了 discovery 的内容：发现 = 前门开着。【关联点】这个发现是故事的开端，后面她会向警察复述 `her discovery of the ransacked flat` (她发现了被洗劫的公寓)。开着的前门也是后面发现 `all the room doors were open` 的第一个不祥信号。"
    },
    {
        "english": "She was thinking that she must reprimand her home help the next morning for such a monstrous piece of negligence, when she remembered that she had gone shopping after the home help had left and she knew that she had turned both keys in their locks,",
        "chinese": "她心想明天上午一定要好好训斥那个干家务的帮手，她竟如此疏忽大意。但突然记起来了，帮手是在她出去买东西之前走的，她还记得曾用了两把钥匙把大门锁上了。",
        "note": "1. 核心词组：reprimand sb for sth (因某事训斥某人)；monstrous piece of negligence (极大的疏忽)，用 monstrous 形容程度之深；turn keys in their locks (锁门) 是一个生动的动作描述。\n\n2. 句子结构：这是一个描述思绪转变的长句。以 She was thinking... (她当时正在想...) 开头，用 when she remembered... (这时她突然想起...) 作为转折点，引出与之前想法完全相反的事实。\n\n3. 【关联点】时态是理解本句的关键。had gone (已离开) 和 had turned (已锁上) 都是过去完成时，表示这些动作发生在 remembered (想起) 之前。这和我们之前遇到的 had tired (已使她疲劳) 和 had shut (已关上) 用法完全相同，都用来交代背景或更早发生的动作。"
    },
    {
        "english": "She walked slowly into the hall and at once noticed that all the room doors were open, yet following her regular practice she had shut them before going out.",
        "chinese": "她慢慢地走进前厅，立即发现所有的房门都敞开着，而她记得在出门买东西前，她按老规矩是把房门一一锁上的。",
        "note": "1. 句子由 and 和 yet 连接，清晰地展示了“走进-发现-回忆”的连贯动作。at once (立即) 强调了发现的突然性，与 slowly (慢慢地) 形成对比，凸显了她的震惊。\n\n2. yet (然而) 是关键转折词，引出“看到的景象”(doors were open) 与“记忆中的事实”(she had shut them) 之间的强烈矛盾，这是故事悬念的核心。\n\n3. 【关联点】时态是关键。had shut (已经关上) 与我们之前遇到的 had turned the keys (已经锁上) 用法完全一致，都用过去完成时强调“出门前”的动作早已完成，证明门不是她自己忘关的。"
    },
    {
        "english": "Looking into the drawing room, she saw a scene of confusion over by her writing desk.",
        "chinese": "她往起居室里看去，写字台边一片狼籍。",
        "note": "1. 句首的 Looking into... 是现在分词短语，作为伴随状语，生动描绘了主句 she saw 发生时的背景画面，让动作更有层次感。\n\n2. a scene of confusion 意为“一片混乱的景象”，是描述环境的常用搭配，生动地传达了视觉冲击。句尾的 over by... 则精确定位了混乱发生的具体地点。\n\n3. 【关联点】这里的 saw (看见) 与后面她 at once noticed (立刻注意到) 都是发现异常的瞬间。而 a scene of confusion (混乱景象) 则是对后面 The chaos was inconceivable (混乱难以想象) 的具体描绘。"
    },
    {
        "english": "It was as clear as daylight then that burglars had forced an entry during her absence.",
        "chinese": "事情很清楚，在她外出时，窃贼曾闯进家门。",
        "note": "1. 核心短语: as clear as daylight (像白天一样清楚)，比喻事情一目了然；force an entry (强行进入)。【关联点】注意，后面警察的发现是门锁 had not been forced (未被强行破坏)，这形成了关键线索，暗示窃贼另有进入方式。\n\n2. 句型解析: It was... that... 是一个常见句型，句首的 It 是“形式主语”，像个占位符，真正的主语是 that 引导的整个从句，即“窃贼闯入”这件事。\n\n3. 时态分析: had forced 是过去完成时，表示“强行闯入”这个动作发生在“事情变得清楚”(was clear) 之前。【关联点】这和我们之前遇到的 had turned the keys (已锁门) 和 had shut them (已关门) 用法完全一致，都用来强调一个更早发生的动作，是理解故事时间顺序的关键。"
    },
    {
        "english": "Her first impulse was to go round all the rooms looking for the thieves, but then she decided that at her age it might be more prudent to have someone with her, so she went to fetch the porter from his basement.",
        "chinese": "她第一个条件反射是各个房间搜寻一下窃贼，但转念一想，像她这个年纪，最好找个人一起去。于是她到地下室去找看门的人。",
        "note": "1. 核心词汇：impulse (冲动) vs. prudent (谨慎的) 体现了她从情绪反应到理性思考的转变。fetch (去请来) 则是她谨慎思考后采取的具体行动。\n\n2. 句子结构：这是一个展现思维过程的完整链条：最初冲动 (but前) -> 谨慎决定 (but后) -> 最终行动 (so后)。连接词 but 和 so 清晰地标示了思绪的转折与行动的结果。\n\n3. 句型解析：it might be more prudent to... (做某事可能更谨慎) 是一个常用句型，it是形式主语。【关联点】这和我们遇到的 It was as clear as daylight that... 结构类似，都是用 It 作“占位符”，真正的主语是后面的 to do 短语或 that 从句。\n\n4. 【关联点】注意，文中的“窃贼”用了多个词：这里的 thieves，后面的 burglars (入室窃贼) 和 intruders (入侵者)。它们意思相近，可以替换使用，是积累同义词的好机会。"
    },
    {
        "english": "By this time her legs were beginning to tremble, so she sat down and accepted a cup of very strong tea, while he telephoned the police.",
        "chinese": "这时她两腿累得开始发抖，于是坐了下来，喝了一杯浓茶。与此同时，看门的人给警察挂了电话。",
        "note": "1. 核心词汇：tremble (v. 发抖)；strong tea (浓茶)，strong形容味道浓度；telephone (v. 打电话)。【关联点】这里的 telephone 作动词，和我们后面遇到的 ring up (打电话) 意思相同，都是打电话的表达。\n\n2. 句子由 so 和 while 连接，展示了“因果”与“同步”两条线索。so 连接“发抖”与“坐下喝茶”的因果关系。while 表示“与此同时”，连接两个同步发生的动作。【关联点】这和后面 The inspector began..., while the constable checked... 的用法完全一致。\n\n3. 结构拆解：本句由三个小句组成：她腿发抖 (原因)，so 她坐下喝茶 (结果)，while 他打电话 (同步动作)。通过连接词将多个简单动作串联成一个完整的场景。"
    },
    {
        "english": "Then, her composure regained, she was ready to set off with the porter's assistance to search for nay intruders who might still be lurking in her flat.",
        "chinese": "此刻老妇人也镇定了下来，准备在看门人的协助下搜寻可能仍躲藏在她房里的窍贼。",
        "note": "1. 核心结构: her composure regained (她恢复镇静后)。这是一个“独立主格结构”(名词+过去分词)，作状语交代主句动作的前提，非常简洁。类似用法：His work finished, he went home. (工作完成后，他回家了。)\n\n2. 核心动作: she was ready to set off... to search for... (她准备出发去搜寻...)。【关联点】这个 `be ready to do` 的结构，和我们最开始遇到的 `was glad to be back` 类似，都是用不定式 `to do` 来说明形容词的内容。\n\n3. 修饰与词汇: ...intruders who might still be lurking... (可能仍潜藏着的入侵者)。【关联点】注意区分：这里用 who 修饰人 (intruders)，而之前用 where 修饰地点 (flats where she lived)。同时，intruders 和我们遇到的 thieves, burglars 都是“窃贼”的同义词。"
    },
    {
        "english": "They went through the rooms, being careful to touch nothing, as they did not want to hinder the police in their search for fingerprints.",
        "chinese": "他俩搜遍这每一个房间，小心翼翼地不接触任何东西，因为他们怕妨碍警察寻找指纹。",
        "note": "1. 核心词汇：go through (仔细搜查)；hinder (妨碍)。前者指彻底检查一个地方，后者指阻碍某个进程。\n\n2. 结构解析：being careful... 是现在分词短语，生动描述了他们搜查时的伴随状态。as... 则解释了他们如此小心的原因。【关联点】这和我们遇到的 `Looking into the drawing room, she saw...` 结构完全一致，都是用-ing形式补充画面感。\n\n3. 【关联点】他们小心翼翼是怕妨碍警察 `in their search for fingerprints` (寻找指纹)，这直接关联到后面警察的实际行动 `The inspector began to look for fingerprints` 和老妇人自己 `to search for intruders` (搜寻入侵者)。"
    },
    {
        "english": "The chaos was inconceivable.",
        "chinese": "房间里的紊乱状况是无法想像的。",
        "note": "1. 核心词汇：chaos (n. 混乱)；inconceivable (adj. 无法想象的)，由 in- (不) + conceive (想象) 构成。【关联点】这里的 chaos (混乱) 是对前面 `a scene of confusion` (混乱的景象) 的程度升级，从具体景象上升到了抽象状态。\n\n2. 句型解析：这是一个典型的主谓表句型，用来描述主语“混乱”的状态。【关联点】这和我们之前遇到的 `her basket had grown heavier` (篮子变得更重了) 和 `her front door was open` (前门开着) 结构完全相同，都是用“主语+系动词+表语”来描述事物的性质或状态。"
    },
    {
        "english": "She had lived in the flat for thirty years and was a veritable magpie at hoarding; and it seemed as though everything she possessed had been tossed out and turned over and over.",
        "chinese": "老妇人在这套公寓里住了30年，她又是个名副其实的收藏家。看来她的每一件东西都被翻了出来，并且被里里外外看了遍。",
        "note": "1. 核心词组：veritable magpie at hoarding (名副其实的囤物喜鹊)，用喜鹊爱收集闪亮东西的习性，生动比喻老妇人极爱囤积物品。tossed out and turned over and over (被翻出并反复搜查) 描绘了混乱的现场。\n\n2. 关键句型：it seemed as though... (看起来好像...)，用于根据眼前所见进行推断。这里的主语 it 是形式主语，真正的内容在 as though 之后。【关联点】这和我们之前遇到的 `It was as clear as daylight that...` 结构类似，都用 It 作“占位符”，引出真正要说明的情况。\n\n3. 时态与语态：had lived (已住了) 和 had been tossed out (已被翻出) 都是过去完成时，表示动作发生在“看起来”之前。【关联点】这与文中反复出现的 `had tired`, `had turned`, `had shut` 等用法完全一致，是理解故事时间顺序的关键。被动语态 `had been tossed out` 强调物品被翻乱，与 `both were forgotten` (两件事被忘了) 的用法相似。"
    },
    {
        "english": "At least sorting out the things she should have discarded years ago was now being made easier for her.",
        "chinese": "这样一来，她倒是容易将那些几年前就该扔掉的东西找出来了。",
        "note": "1. 核心结构: was being made easier (正被变得更容易)。被动语态强调有外力使整理这件事变得容易（讽刺的是，是窃贼）。【关联点】这和我们遇到的 `both were forgotten` (被忘记) 和 `had been tossed out` (被翻出) 类似，都用被动语态描述发生在主角身上的事。\n\n2. 关键短语: should have discarded (本该扔掉但没扔)，表达对过去的遗憾或虚拟。【关联点】注意区分：这表示“本该做但未做”，而文中多次出现的过去完成时如 `had shut` (已经关了) 则表示“过去确实已完成”的动作。\n\n3. 句子主语: sorting out... 这一长串动作是整个句子的主语，它把“整理东西”这件事当作一个名词看待。这种用法能让句子表达更复杂的概念。"
    },
    {
        "english": "Then a police inspector arrived with a constable and she told them of her discovery of the ransacked flat.",
        "chinese": "过了一会儿，一位巡官带着一名警察来了。她向他们讲述了发现公寓遭劫的经过。",
        "note": "1. 核心短语: told them of her discovery (向他们讲述了她的发现)。of 后面直接跟名词，说明了“讲述”的内容。【关联点】这和我们之前遇到的 `in her sudden discovery that her front door was open` 紧密相连。之前是她自己“发现”，现在是她向警方“复述”这个发现。\n\n2. 核心词汇: ransacked (adj. 被洗劫一空的)。这个词生动地描绘了公寓被彻底翻找过的惨状。【关联点】这个词解释了之前 `a scene of confusion` (混乱的景象) 和 `The chaos was inconceivable` (混乱难以想象) 的原因，将抽象的“混乱”具象化为窃贼的“洗劫”行为。\n\n3. 人物角色: inspector (巡官) 和 constable (警员) 是英国警察体系中的具体职衔。他们的到来，标志着故事从个人惊恐进入到正式的案件调查阶段。【关联点】注意，后面巡官和警员会分工合作 (`look for fingerprints` vs. `checked the locks`)，展现专业调查的流程。"
    },
    {
        "english": "The inspector began to look for fingerprints, while the constable checked that the front door locks had not been forced, thereby proving that the burglars had either used skeleton keys or entered over the balcony.",
        "chinese": "巡官开始搜寻指纹，警察经检查发现大门锁头并无撬过的迹象。由此可以证明，窍贼或者是用万能钥匙，或者是翻越阳台进来的。",
        "note": "1. 结构拆解：本句结构清晰地展示了“平行行动 -> 逻辑推断”的过程。while 连接两个同时发生的调查动作，thereby proving... (由此证明...) 则引出基于这两个动作得出的结论。【关联点】while 的用法和我们之前遇到的 `...she sat down..., while he telephoned the police` 完全一致，都表示“与此同时”。\n\n2. 关键线索：had not been forced (未被强行破坏) 是本句的核心信息，它直接推翻了老妇人之前“窃贼强行进入”(burglars had forced an entry) 的假设，让案情变得更加扑朔迷离。\n\n3. 动作呼应：look for fingerprints (寻找指纹) 是警察的专业行动。【关联点】这正是之前老妇人和门房 `careful to touch nothing` (小心不碰任何东西) 以免 `hinder the police` (妨碍警察) 的原因，前后情节紧密相连。"
    },
    {
        "english": "There was no trace of fingerprints, but the inspector found a dirty red bundle that contained jewellery which the old lady said was not hers.",
        "chinese": "巡官没有发现指纹，却发现了一个装有珠宝的、肮脏的红包袱。老妇人说那不是她的。",
        "note": "1. 句子由 but 连接，呈现了案情的转折：虽然没有指纹 (no trace of fingerprints)，却发现了新线索 (a dirty red bundle)。【关联点】“没有指纹”这个发现，与之前他们“小心不碰任何东西”以免妨碍警察“寻找指纹”的行为，以及之后巡官“开始寻找指纹”的努力形成了鲜明对比。\n\n2. 核心结构是“双重标签”：用 that contained... 给 bundle (包袱) 贴标签，再用 which... 给 jewellery (珠宝) 贴标签，层层递进地提供信息。\n\n3. 【关联点】注意区分“标签”词：这里用 that/which 修饰物，这和我们之前遇到的用 where 修饰地点 (flats where she lived) 和用 who 修饰人 (intruders who...) 的用法不同，需要区分使用。"
    },
    {
        "english": "So their entry into this flat was apparently not the burglars' first job that day and they must have been disturbed.",
        "chinese": "很明显，闯进这套公寓的窃贼那天并不是首次作案，而且他一定受了惊吓。",
        "note": "1. 核心结构：must have been disturbed (一定已经被惊扰了)。must have + 过去分词表示对过去的肯定推测。【关联点】注意区分：这表示“推测”，而文中反复出现的过去完成时如 had shut (已经关了) 则表示“事实”。\n\n2. 语态分析：been disturbed 是被动语态，强调窃贼“被”惊扰。【关联点】这和我们遇到的 both were forgotten (被忘记) 和 had been tossed out (被翻出) 类似，都用被动语态描述发生在某人或某物身上的事。\n\n3. 核心词汇：entry (进入)；burglar (窃贼)。【关联点】这里的 their entry 呼应了之前提到的 force an entry (强行进入)。同时，burglar 和我们遇到的 thieves, intruders 都是“窃贼”的同义词，可以替换使用。"
    },
    {
        "english": "The inspector then asked the old lady to try to check what was missing by the next day and advised her not to stay alone in the flat for a few nights.",
        "chinese": "巡官请老妇人在次日之前设法查清丢了些什么，并劝她几夜之内不要独自一人在公寓过夜。",
        "note": "1. 核心句型：本句由 and 连接两个结构相同的指令：ask sb to do (请某人做) 和 advise sb to do (建议某人做)。它们都属于“动词+宾语+to do”句型，用于表达请求或建议。注意否定时 not 放在 to 的前面。\n\n2. 【关联点】巡官请老妇人 check what was missing (查清少了什么)，这个“检查”动作与故事中其他“搜寻”行为一脉相承。比如警察 look for fingerprints (寻找指纹)，老妇人自己也准备 search for intruders (搜寻入侵者)。\n\n3. 【关联点】巡官给出 not to stay alone (不要独处) 的建议，是因为窃贼 must have been disturbed (一定被惊扰了)，情况尚不安全。这直接回应了之前发现 ransacked flat (被洗劫的公寓) 后的紧张气氛。"
    },
    {
        "english": "The old lady though the was a fussy creature, but since the porter agreed with him, she rang up her daughter and asked for her help in what she described as a little spot of bother.",
        "chinese": "老妇人觉得巡官大惊小怪，但既然看门人也同意他的意见，她只得打电话向女儿求援，说她碰到了一点儿小麻烦。",
        "note": "1. 核心短语: ring up (打电话) 和 a little spot of bother (一点小麻烦)。ring up 是口语化的打电话。【关联点】这和我们之前遇到的 telephone the police 意思相同，都是打电话的表达。a little spot of bother 则是老妇人对严重情况的轻描淡写。\n\n2. 句子结构展现了老妇人从“不情愿”到“行动”的心理转变。but since... (但既然...) 是关键的转折点，表明看门人的认同促使她改变了主意。【关联点】这和我们遇到的 Her first impulse was..., but then she decided... 结构类似，都清晰地展示了一个“初始想法 -> 转折 -> 最终行动”的完整思维链条。\n\n3. 核心词汇: fussy (大惊小怪的)。老妇人用 a fussy creature 来形容巡官，表达了她最初的不以为然。【关联点】注意文中对人物的生动描绘：这里用 fussy 形容巡官，而之前用 a veritable magpie at hoarding (名副其实的囤物喜鹊) 来形容老妇人自己，都是非常形象的表达。"
    }
]