[
    {
        "english": "The great ship, Titanic, sailed for New York from Southampton on April 10th, 1912.",
        "chinese": "巨轮“泰坦尼克”号1912年4月10日从南安普敦起锚驶向纽约。",
        "note": "1. 核心搭配 sail from A for B，意为“从A地起航驶向B地”，是描述行程的经典句型。【关联点】这和我们之后遇到的 set out (出发) 意思相近，都表示“启程”。\n\n2. 时间介词 on 用于具体某一天。【关联点】这和我们之后遇到的 on her first voyage (在她的首航中) 用法一致，都指特定的时间点。\n\n3. 句型解析：核心是“主语+谓语”(The ship sailed)，后面补充了目的地(for...)、出发地(from...)和时间(on...)等状语信息，使句子内容完整。\n\n4. 【关联点】注意，英语中常用女性代词 she 来指代船只。在本课后续句子中，泰坦尼克号就会被称作 she。"
    },
    {
        "english": "She was carrying 1,316 passengers and crew of 891.",
        "chinese": "船上载有1,316名乘客与891名船员。",
        "note": "1. She: 用女性代词指代船只。【关联点】这印证了第一句笔记中提到的用法，前后呼应，加深记忆。\n\n2. was carrying: 动词 carry 意为“运载”。过去进行时“was carrying”生动描述了船当时持续的“装载”状态。【关联点】这和后面遇到的 was sailing (正在航行) 和 was sinking (正在下沉) 用法一致。\n\n3. crew: 集合名词，指“全体船员”。【关联点】注意与 passengers (乘客) 区分，前者是工作人员，后者是顾客。\n\n4. 句型解析: 这是一个简单的主谓宾句型 (She carried people)，清晰地说明了船运载了谁。数字的读法是 one thousand, three hundred and sixteen。"
    },
    {
        "english": "Even by modern standards, the 46,000 ton Titanic was a colossal ship.",
        "chinese": "却使用现代标准来衡量，45,000 吨的“泰坦尼克”号与算得上一艘巨轮了。",
        "note": "1. colossal: 巨大的。这是一个强调体积庞大的高级词汇。【关联点】这和我们遇到的 great, largest, huge, immense 类似，都是形容“大”的词，可以归类记忆。\n\n2. Even by modern standards: 意为“即使按现代标准”，用于引入一个评判的背景，以凸显事物的非凡。【关联点】这和后面遇到的 \"Even if...\" (即使) 用法相似，都用 Even 来加强语气。\n\n3. 句型解析：核心是 \"The Titanic was a ship\"，一个简单的主谓表结构，清晰说明了主语的特征。句首的 \"Even by...\" 是状语，为这个判断提供了背景。"
    },
    {
        "english": "At the time, however, she was not only the largest ship that had ever been built, but was regarded as unsinkable, for she had sixteen watertight compartments. Even if two of these were flooded, she would still be able to float.",
        "chinese": "当时，这艘轮船不仅是造船史上建造的最大的一艘船，而且也被认为是不会沉没的。因为船由16个密封舱组成，即使有两个舱进水，仍可漂浮的水面上。",
        "note": "1. not only... but (also)... 是一个强调并列关系的黄金句型，连接两个同等重要的信息点：船既是“最大的”，也是“被认为不会沉的”。\n\n2. was regarded as (被认为是) 是被动语态。【关联点】本课大量使用被动语态来强调事件本身，如之后的 was spotted (被发现), had been given (被发出), were lost (丧生) 等，可以一并记忆。\n\n3. unsinkable (不会沉的) 由 un-(不) + sink(沉) + -able(能...的)构成。【关联点】注意与后面出现的动词 sinking (正在下沉) 和名词 sinking (沉没) 对比，词根相同，词性不同。\n\n4. for 在此意为“因为”，用于解释原因。Even if (即使) 引导一个假设条件。【关联点】这呼应了之前遇到的 \"Even by modern standards\" 的用法，都用 Even 来加强语气。"
    },
    {
        "english": "The tragic sinking of this great liner will always be remembered, for she went down on her first voyage with heavy loss of life.",
        "chinese": "然而，这艘巨轮首航就下沉，造成大批人员死亡。人们将永远记着这艘巨轮的沉没惨剧。",
        "note": "1. sinking (n. 沉没) 和 went down (沉没) 意思相近。【关联点】这与之前提到的形容词 unsinkable (不会沉的) 和动词 was sinking (正在下沉) 形成鲜明对比，它们都源于词根 sink。\n\n2. for: 连词，意为“因为”。【关联点】这和我们之前遇到的 '...was regarded as unsinkable, for she had sixteen...' 用法完全相同，都是在句末补充说明原因。\n\n3. will be remembered (将被记住) 是被动语态。【关联点】这延续了本课的叙事风格，与 was regarded as, was spotted, had been given, were lost 等用法一致，都强调事件本身。\n\n4. heavy loss of life: 固定搭配，意为“惨重的人员伤亡”。【关联点】注意，这与课文结尾的 1,500 lives were lost (1500人丧生) 表达的是同一个悲剧性后果。"
    },
    {
        "english": "Four days after setting out, while the Titanic was sailing across the icy water of the North Atlantic, huge iceberg was suddenly spotted by a lookout.",
        "chinese": "“泰坦尼克”起航后的第4天，它正行驶在北大西洋冰冷的海面上。突然，了望员发现一座冰山。",
        "note": "1. set out: 动词短语，意为“出发，启程”。【关联点】这和我们第一句遇到的 sail for (驶向) 意思相近，都表示旅行的开始。\n\n2. while... was sailing: “当...正在航行时”。用过去进行时来描绘故事背景，营造一种平静的氛围，为后面的突发事件作铺垫。【关联点】这和我们之前遇到的 was carrying (当时正运载着) 用法一致。\n\n3. was suddenly spotted by: “被...突然发现”。这是句子的核心事件，用被动语态强调“冰山”这个主角的登场，而非谁发现它。【关联点】这延续了本课的叙事风格，与 was regarded as, will be remembered 等用法一致。\n\n4. huge: 巨大的。【关联点】这和我们遇到的 colossal, great, largest, immense 类似，都是形容“大”的词，可以归类记忆，体会它们在语气上的细微差别。"
    },
    {
        "english": "After the alarm had been given, the great ship turned sharply to avoid a direct collision.",
        "chinese": "警报响过不久，巨轮急转弯，以避免与冰山正面相撞。",
        "note": "1. had been given: 过去完成时的被动语态，清晰地交代了时间顺序：警报“被发出”在先，轮船“转弯”在后。【关联点】这延续了本课强调事件本身的被动语态叙事风格，与 was spotted, was regarded as 等用法一致。\n\n2. turned sharply: 急转弯。副词 sharply 生动地描绘了动作的剧烈和紧急。【关联点】这和我们遇到的 suddenly (突然地) 和 rapidly (迅速地) 类似，都是用来增强动词表现力的副词，共同营造了紧张气氛。\n\n3. to avoid a direct collision: 为了避免正面碰撞。不定式短语在此作目的状语，解释转弯的原因。【关联点】这和之后船长下去 to see what had happened (为了看看发生了什么) 的用法完全相同，都是“为了做某事”。\n\n4. 核心词汇：alarm (警报) 和 collision (碰撞)。这两个词是故事中的关键转折点，前者是预警，后者是试图避免的灾难后果。【关联点】注意 collision 和之前提到的 sinking, loss of life 都属于描述灾难的词汇。"
    },
    {
        "english": "The Titanic turned just in time, narrowly missing the immense walk of ice which rose over 100 feet out of the water beside her.",
        "chinese": "“泰坦尼克”这个弯拐得及时，紧贴着高出海面100英尺的巨大的冰墙擦过去 。",
        "note": "1. narrowly: 副词，意为“勉强地，险些”。【关联点】这和我们遇到的 sharply (急剧地), suddenly (突然地) 和 rapidly (迅速地) 类似，都是用来增强动词表现力、营造紧张气氛的副词。\n\n2. ...missing the immense walk of ice: 现在分词短语作伴随状语，生动描绘了主句动作“turned”带来的直接结果，让画面更连贯、更有动感。\n\n3. immense: 巨大的。【关联点】这和我们遇到的 colossal, great, largest, huge 类似，都是形容“大”的词，可以归类记忆，体会它们在语气上的细微差别。\n\n4. ...which rose...: 定语从句，用来修饰前面的“冰墙”(walk of ice)，补充说明其具体样貌。【关联点】这和之前遇到的 'the largest ship that had ever been built' 用法类似，都是用从句给名词添加具体描述。"
    },
    {
        "english": "Suddenly, there was a slight trembling sound from below, and the captain went down to see what had happened.",
        "chinese": "突然，从船舱下部传来一声微颤音，船长走下船舱去查看究竟。",
        "note": "1. Suddenly (突然地) 是营造紧张气氛的副词。【关联点】这和我们遇到的 sharply, rapidly, narrowly 类似。注意区分这里的 went down (走下去) 和之前遇到的 went down (沉没)，同一个短语，意思完全不同。\n\n2. there was a... sound: “there be”句型，用于引出新信息“有...声音”。【关联点】这和我们之后遇到的 As there were not enough lifeboats... (因为没有足够的救生艇) 用法一致，都是表示“存在”。\n\n3. to see what had happened: “为了看看发生了什么”。to see 是目的状语。【关联点】这和我们之前遇到的 to avoid a direct collision (为了避免碰撞) 用法完全相同。what had happened 是 see 的宾语从句。\n\n4. had happened: 过去完成时，表示“发生”这个动作在船长“下去看”之前已经完成了，强调了时间的先后顺序。【关联点】这和之前的 had been given (警报已发出) 用法一致，都是为了理清事件的时间线。"
    },
    {
        "english": "The noise had been so faint that no one though that the ship had been damaged.",
        "chinese": "由于这个声音非常轻，没人会想到船身已遭损坏。",
        "note": "1. 核心句型 so...that...，意为“如此……以至于……”，用于连接原因（声音微弱）和结果（没人想到）。这是一个非常实用的因果关系句型。\n\n2. 时态解析：had been faint 和 had been damaged 使用过去完成时，表示这两个状态都发生在“没人想到”(thought)之前。【关联点】这和我们遇到的 had been given 和 had happened 用法一致，都是为了理清时间线。\n\n3. had been damaged (已被损坏) 是被动语态，强调船是“被”损坏的这一事实。【关联点】这延续了本课强调事件本身的叙事风格，与 was spotted (被发现), was regarded as (被认为) 等用法一致。\n\n4. faint: 形容词，意为“微弱的，不清楚的”。【关联点】这和我们之前遇到的 slight (轻微的) 意思相近，都用来描述不易察觉的感官信息，共同铺垫了灾难的突然性。"
    },
    {
        "english": "Below, the captain realized to his horror that the Titanic was sinking rapidly, for five of her sixteen watertight compartments had already been flooded!",
        "chinese": "在下面，船长惊恐的地发现“泰坦尼克”号正在急速下沉 ，16个密封舱已有5个进水。",
        "note": "1. to his horror (让他惊恐的是) 是一个生动的情感短语。副词 rapidly (迅速地) 描绘了下沉的速度。【关联点】这和我们遇到的 sharply, suddenly, narrowly 类似，都是营造紧张气氛的关键副词。\n\n2. was sinking (正在下沉) 使用过去进行时，生动描绘了灾难正在发生的动态过程。【关联点】这和之前描述背景的 was carrying (正运载着) 和 was sailing (正航行着) 用法一致，但气氛截然不同。\n\n3. for: 连词，意为“因为”，用来解释船长惊恐的原因。【关联点】这已是本课第三次出现该用法，与 '...was regarded as unsinkable, for...' 和 '...will be remembered, for...' 用法完全相同。\n\n4. had been flooded (已被水淹) 使用过去完成时被动语态，表明“进水”发生在船长“意识到”之前。【关联点】这延续了本课用过去完成时理清时间线 (如 had been given) 和用被动语态强调事件 (如 was spotted) 的叙事风格。"
    },
    {
        "english": "The order to abandon ship was given and hundreds of people plunged into the icy water.",
        "chinese": "于是，他发出弃船的命令 ，几百人跳进了冰冷刺骨的海水里 。",
        "note": "1. was given (被发出) 是被动语态。【关联点】这延续了本课强调事件本身的叙事风格，与 was spotted (被发现), had been given (警报被发出) 等用法完全一致，共同构建了灾难的客观记录视角。\n\n2. 核心动词：abandon ship (弃船) 是一个正式命令，而 plunge into (跳入) 则描绘了人们绝望而迅速的行动，两个动词对比强烈，凸显了现场的混乱与悲剧性。\n\n3. 句型解析：这是一个由 and 连接的并列句，清晰地展示了事件的因果顺序：命令下达 (原因/前提)，众人跳海 (结果/后续)。结构简单，但叙事节奏紧凑。\n\n4. icy water (冰冷的海水)。【关联点】这呼应了之前提到的航行环境 'the icy water of the North Atlantic'，再次强调了乘客们面临的绝境，为后面的 'heavy loss of life' 埋下伏笔。"
    },
    {
        "english": "As there were not enough lifeboats for everybody, 1,500 lives were lost.",
        "chinese": "由于没有足够的救生艇运载所有乘客，结果，1,500 人丧生。",
        "note": "1. As: 连词，意为“因为”，引导原因状语从句并置于句首。【关联点】这和我们之前多次遇到的 for (因为) 作用类似，但 for 通常连接两个分句，而 As 常用于句首。\n\n2. there were not enough...: “没有足够的...”。这是 there be 句型的否定形式。【关联点】这和我们之前遇到的 'there was a slight trembling sound' (有...声音) 用法一致，都是表示“存在”的经典句型。\n\n3. were lost: “丧生”。被动语态，客观陈述“生命被夺走”的悲剧结果。【关联点】这延续了本课用被动语态叙事的风格，与 was spotted, was given 等用法一致。\n\n4. 1,500 lives were lost: 1500人丧生。【关联点】这个具体数字是对之前提到的 'heavy loss of life' (惨重的人员伤亡) 的精确说明，前后呼应，揭示了悲剧的严重性。"
    }
]