[
    {
        "english": "Pumas are large, cat-like animals which are found in America.",
        "chinese": "美洲狮是一种体形似猫的大动物，产于美洲。",
        "note": "1. cat-like: 由名词cat加后缀-like构成，意为“像猫一样的”。这是一种常见的构词法，可以快速创造形容词，如child-like（孩子气的）。\n\n2. are found: 被动语态，字面意思是“被发现”，在此处更自然地理解为“产于”或“栖息于”。【关联点】这和我们之后遇到的 a wild puma had been spotted (美洲狮被发现) 和 paw prints were seen (爪印被看到) 类似，都是被动语态，强调主语“被”怎么样了。\n\n3. 句型解析: 句子核心是 Pumas are animals。后面的 which are found in America 是一个定语从句，像一个补充说明的标签，用来修饰前面的 animals，告诉我们这些动物产于何处。【关联点】注意这里的 which 用来指代物 (animals)，这和我们之后遇到的用 who 指代人 (people who claimed...) 的用法形成了对比。"
    },
    {
        "english": "When reports came into London Zoo that a wild puma had been spotted forty-five miles south of London, they were not taken seriously.",
        "chinese": "当伦敦动物园接到报告说，在伦敦以南45英里处发现一只美洲狮时，这些报告并没有受到重视。",
        "note": "1. 本句包含两个被动语态：had been spotted (被发现) 和 were not taken seriously (未被认真对待)。被动语态强调动作的承受者（美洲狮和报告），而非执行者。【关联点】这和我们之前遇到的 are found (产于) 以及之后会看到的 were seen (被看到) 等用法一致，都是本课的核心语法点。\n\n2. 时态注意：had been spotted (过去完成时) 表示“被发现”这个动作发生在 came into (报告传来) 之前，清晰地交代了事件的先后顺序。\n\n3. 句型解析：that a wild puma had been spotted... 是一个同位语从句，用来具体解释名词 reports 的内容，即“报告了什么”。【关联点】这和我们之后遇到的 experts confirmed that... 类似，that 都引导一个从句来阐明前面名词或动词的具体内容。\n\n4. 核心短语：take sth seriously 意为“认真对待某事”，是一个非常地道的表达。"
    },
    {
        "english": "However, as the evidence began to accumulate, experts from the Zoo felt obliged to investigate, for the descriptions given by people who claimed to have seen the puma were extraordinarily similar.",
        "chinese": "可是，随着证据越来越多，动物园的专家们感到有必要进行一番调查，因为凡是声称见到过美洲狮的人们所描述的情况竟是出奇地相似。",
        "note": "1. 核心表达：feel obliged to do sth. 意为“感到有必要/有义务做某事”，是比 have to 更正式的说法。extraordinarily similar (出奇地相似) 则生动地强调了相似程度之高，远超 very。\n\n2. 句型解析：本句主干是 experts ... felt obliged to investigate。句首的 as... 交代了“随着证据积累”的背景，而句末的 for... 则解释了专家们不得不调查的原因。\n\n3. 关联与辨析：\n【关联点】这里的 for 引导原因状语从句，与之后 The search proved difficult, for... 的用法完全相同。\n【关联点】who claimed to have seen the puma 是一个定语从句，用来修饰 people。这和我们第一句遇到的 which are found in America 类似，但请注意区分：who 指代人，而 which 指代物。"
    },
    {
        "english": "The hunt for the puma began in a small village where a woman picking blackberries saw 'a large cat' only five yards away from her. It immediately ran away when she saw it,",
        "chinese": "搜寻美洲狮的工作是从一座小村庄开始的。那里的一位妇女在采摘黑莓时的看见“一只大猫”，离她仅5码远，她刚看见它，它就立刻逃走了。",
        "note": "1. 句型解析：本句由两个通过时间顺序连接的简单句构成。核心结构是 The hunt began in a village 和 It ran away。where a woman...saw... 是一个定语从句，用来修饰 a small village，生动地描绘了村庄里发生的具体事件。【关联点】注意区分这里的 where（特指某地）和之后遇到的 Wherever it went...（无论何地）。\n\n2. 核心用法：a woman picking blackberries 中的 picking blackberries 是现在分词作后置定语，让表达更简洁，相当于 a woman who was picking blackberries。【关联点】这和我们之后遇到的 puma fur was found clinging to bushes 类似，clinging 描述了毛发被发现时的状态。\n\n3. 关键短语：run away 意为“逃跑”，是一个非常生动的动词短语。when she saw it 是时间状语从句，强调了两个动作的紧密连续性：“她一看，它就跑”。"
    },
    {
        "english": "and experts confirmed that a puma will not attack a human being unless it is cornered.",
        "chinese": "专家证实，美洲狮非被逼得走投无路，是决不会伤人的。",
        "note": "1. 核心逻辑：will not ... unless ... 意为“除非…否则不会…”，用来强调主句动作（不攻击）在一般情况下的确定性，并引出唯一的例外条件。\n\n2. 关键短语：be cornered 意为“被逼入绝境”，生动地描绘了动物走投无路的状态。【关联点】这里的被动语态 is cornered 与我们之前遇到的 are found (产于), had been spotted (被发现) 等用法一脉相承，是本课反复出现的重点。\n\n3. 句型解析：本句主干是 experts confirmed that...，由 that 引导一个宾语从句，说明“证实”的具体内容。【关联点】这和我们之前遇到的 reports that... 类似，that 都引导一个从句来阐明前面名词或动词的具体信息。"
    },
    {
        "english": "The search proved difficult, for the puma was often observed at one place in the morning and at another place twenty miles away in the evening.",
        "chinese": "事实上搜寻工作很困难，因为常常是早晨在甲地发现那只美洲狮，晚上却在20英里外的乙地发现它的踪迹。",
        "note": "1. prove 在此作系动词，意为“结果是，显得”，用法类似 is。主句 The search proved difficult 是“主谓表”结构，直接点明了搜寻工作的结果。\n\n2. for 在此是连词，引导原因状语从句，解释搜寻困难的原因。【关联点】这和我们之前遇到的 experts...felt obliged to investigate, for... 的用法完全相同，都是“结果 + for + 原因”的结构。\n\n3. was often observed (常常被发现) 是被动语态。【关联点】这与本课反复出现的 are found (产于), had been spotted (被发现), were seen (被看到) 等用法一脉相承，强调美洲狮是“被”观察的对象。\n\n4. at one place... and at another place... 是一个对比结构，生动地说明了美洲狮活动范围之广，进一步印证了搜寻的困难。"
    },
    {
        "english": "Wherever it went, it left behind it a trail of dead deer and small animals like rabbits. Paw prints were seen in a number of places and puma fur was found clinging to bushes.",
        "chinese": "无论它走哪儿， 一路上总会留下一串死鹿及死兔子之类的小动物， 在许多地方看见爪",
        "note": "1. Wherever 引导地点状语从句，意为“无论何地”。【关联点】注意区分我们之前遇到的 in a small village where...，where 指代一个确定的地点，而 wherever 强调地点的不确定性，即“所到之处”。\n\n2. 句中连用两个被动语态：Paw prints were seen (爪印被看到) 和 puma fur was found (毛被发现)。【关联点】这与本课反复出现的 are found (产于), had been spotted (被发现), was observed (被观察到) 等用法一脉相承，共同构成了“搜寻证据”这条线索。\n\n3. ...was found clinging to bushes 中，clinging 是现在分词，描述 puma fur 被发现时的状态，即“正粘在”灌木上。【关联点】这和我们之前遇到的 a woman picking blackberries 类似，都是用现在分词作定语或补语，使描述更生动简洁。\n\n4. 核心短语：leave behind 意为“留下，遗留”，生动地描绘了美洲狮经过后留下的痕迹 (a trail of...)，是积累证据的关键一环。"
    }
]