[
    {
        "english": "Customs Officers are quite tolerant these days, but they can still stop you when you are going through the Green Channel and have nothing to declare.",
        "chinese": "现在的海关官员往往相当宽容。但是，当你通过绿色通道， 没有任何东西需要申报时，他们仍可以拦住你。",
        "note": "1. tolerant: adj. 宽容的。句子前半句用它来铺垫，与后半句的 but they can still stop you 形成转折对比。\n\n2. declare: v. 申报。这是在海关场景下的高频词汇。【关联点】这个词是本课的核心，在官员提问 'Have you anything to declare?' 和批评 'You should have declared that.' 中反复出现，请务必掌握。\n\n3. go through: 通过。when... 从句描述了“即使在一切合规的情况下”。【关联点】这里的 go through 意为“通过”，之后我们还会遇到它表示“仔细检查”(went through the case)，注意语境区别。\n\n4. 句子的核心逻辑是 but 连接的转折：虽然海关官员通常很宽容 (tolerant)，但他们仍然有权在任何情况下拦下你检查。"
    },
    {
        "english": "Even really honest people are often made to feel guilty.",
        "chinese": "甚至是最诚实的人也常弄得觉得有罪似的，",
        "note": "1. be made to feel guilty: 意为“被弄得感觉内疚”。这是 make sb do sth (让某人做某事) 的被动形式，注意被动语态中 to 不能省略。\n\n2. 【关联点】这句话描述了诚实人的内疚感，与后文 “老练的走私犯...is never troubled by such feelings” (从不被这种感觉困扰) 形成鲜明对比。一个内心不安，一个毫无感觉。\n\n3. honest: 诚实的。guilty: 内疚的，有罪的。这两个词描绘了普通人在海关检查下的心理状态，即使清白也可能感到压力。"
    },
    {
        "english": "The hardened professional smuggler, on the other hand, is never troubled by such feelings, even if he has five hundred gold watches hidden in his suitcase.",
        "chinese": "而老练的职业走私犯却即使手提箱里藏着500只金表，却也处之泰然。",
        "note": "1. on the other hand: 意为“另一方面”，引出与前文的对比。【关联点】这和我们之前遇到的 “Even really honest people are often made to feel guilty” 形成鲜明对比。一个内心有愧，一个处之泰然。\n\n2. hardened: adj. 老练的，经验丰富的。be troubled by: 被...困扰。短语 is never troubled by such feelings (从不被这种感觉困扰) 刻画了走私犯的冷酷心理。\n\n3. even if: 连词，意为“即使”，引导让步状语从句，强调主句情况不受从句条件影响。此处生动描绘了走私犯的镇定自若，即使风险极高。\n\n4. hidden in his suitcase: 过去分词短语作后置定语，修饰 watches，表示“被藏在手提箱里的”金表。它描述了物品的状态。"
    },
    {
        "english": "When I returned form abroad recently, a particularly officious young Customs Officer clearly regarded me as a smuggler.",
        "chinese": "最近一次，我也出国归来，碰上一位特别好管闲事的年轻海关官员， 他显然把我当成走私犯。",
        "note": "1. officious: adj. 好管闲事的，爱指手画脚的。用这个词生动地描绘了这位官员多事的性格。smuggler: n. 走私犯。【关联点】注意，这里“我”被官员看作 (regarded as) 走私犯，这与我们之前遇到的那个内心毫无波澜的“老练的职业走私犯”(hardened professional smuggler) 形成了戏剧性的对比。\n\n2. regard...as...: 核心句型，意为“把……看作……”，用于表达一种主观看法或判断。这里指官员主观上认定“我”是走私犯，这个误判是整个故事冲突的开端。\n\n3. 句子结构: “When..., 主句” 是一个经典的叙事句型。前面的 When 从句交代了故事发生的背景（时间、地点），后面的主句则引出了核心事件。这种结构让叙事清晰，有条理。"
    },
    {
        "english": "'Have you anything to declare?' he asked, looking me in the eye.",
        "chinese": "“您有什么需要申报的吗？”他直盯着我的眼睛问。",
        "note": "1. declare: v. 申报。这是海关官员提出的核心问题，也是整个故事冲突的起点。【关联点】这和我们开篇遇到的 have nothing to declare 以及后文官员的指责 You should have declared that. 形成了呼应，是贯穿全文的关键词。\n\n2. looking me in the eye: 现在分词短语作状语，生动描绘出官员提问时的神态——严肃、直接，带有审视的意味。【关联点】这个短语为官员“好管闲事”(officious)的性格做了铺垫，也与他之后“讥讽地”(sarcastically)提问的态度一脉相承。\n\n3. 句子结构: “直接引语” + he asked + 补充说明。这是描述对话的常见方式。其中 looking me in the eye 是现在分词短语作伴随状语，说明“问”这个动作发生时伴随的状态，让画面感更强。"
    },
    {
        "english": "'No', I answered confidently.",
        "chinese": "“没有。”我自信地回答说。",
        "note": "1. confidently: 副词，意为“自信地”。它修饰动词 answered，生动描绘出“我”回答时的镇定心态和十足底气。这种“引语 + 主谓 + 副词”的结构非常常见。\n\n2. 【关联点】注意本文中一系列描绘语气的副词。这里的 confidently (自信地) 与之后官员的 sarcastically (讥讽地) 和“我”的 encouragingly (鼓励地) 形成情绪对抗，展现了一场心理博弈。"
    },
    {
        "english": "'Would you mind unlocking this suitcase please?'",
        "chinese": "“请打开这只手提箱好吗？”",
        "note": "1. 核心句型 Would you mind + V-ing? 是一种非常礼貌的请求，意为“请你做...好吗？”。动词 mind 后面必须跟动词的-ing形式。\n\n2. unlock: v. 开锁。前缀 un- 表示“相反的动作”。【关联点】这和我们之后遇到的 unpleasant (不愉快的) 中的 un- 类似，都表示“不”或“相反”，unpleasant 是 pleasant (愉快的) 的反义词。掌握这个前缀有助于你猜测词义。"
    },
    {
        "english": "'Not at all,' I answered.",
        "chinese": "“好的。”我回答说。",
        "note": "1. Not at all: 这是一个礼貌短语。在此处回应开箱请求，意为“当然，没问题”，表示乐于合作。它比简单的“Yes”或“OK”更显礼貌和客气。\n\n2. 句子结构是“直接引语 + 主谓”。【关联点】这和我们之前遇到的 \"'No', I answered confidently.\" 结构完全一样，都是描述“我”如何回答。注意区分：那一句用副词 confidently 强调了自信的态度，而本句则没有修饰，显得简单直接。"
    },
    {
        "english": "The Officer went through the case with great care.",
        "chinese": "那位官员十分仔细地把箱子检查了一遍。",
        "note": "1. go through: 动词短语，意为“仔细检查”。【关联点】这和我们开篇遇到的 go through the Green Channel (通过绿色通道) 意思不同。一个是“检查”，一个是“通过”，请注意语境区分。\n\n2. with great care: 介词短语作状语，生动地描述了检查的方式，相当于副词 carefully。这种 “with + 名词” 的结构常用来表示动作的方式。"
    },
    {
        "english": "All the thing I had packed so carefully were soon in a dreadful mess.",
        "chinese": "所有细心包装好的东西一会儿工夫就乱成一团。",
        "note": "1. in a dreadful mess: 乱成一团糟。dreadful 是一个强调词，表示“极度的，糟糕的”，用来加重 mess (混乱) 的程度。\n\n2. 时态对比：had packed (过去完成时) 表示“打包”这个动作，发生在 were in a mess (一般过去时) 之前，清晰地交代了动作的先后顺序。【关联点】这和我们之后遇到的 He had spotted... and he pounced... 类似，都是用过去完成时表示一个更早发生的动作。\n\n3. 句子主语是 All the thing I had packed...，其中 I had packed... 是一个定语从句，像一个长长的形容词，用来修饰 thing。【关联点】这和我们之后遇到的 a strange mixture I make myself 结构完全一样，都是用一个句子来修饰前面的名词。"
    },
    {
        "english": "I felt sure I would never be able to close the case again.",
        "chinese": "我相信那箱子再也关不上了。",
        "note": "1. 核心句型 I felt sure + (that)从句，表示“我当时确信…”。主句 felt (过去时) 与从句 would (过去将来时) 结合，表达了在过去那一刻对未来的绝望预测。\n\n2. 【关联点】注意 be able to 的用法。这里的 would never be able to close (将永远无法关上) 表达了当时的无助感，这和我们最后遇到的 I was able to hurry away (我得以匆匆离去) 形成鲜明对比，从绝望到解脱，突显了故事的戏剧性转折。"
    },
    {
        "english": "Suddenly, I saw the Officer's face light up.",
        "chinese": "突然，我看到官员脸上露出了得意的神色。",
        "note": "1. light up: 动词短语，意为“（脸上）露出喜色”，生动描绘了官员的得意神情。\n2. 核心句型 `see sb do sth`，感官动词后跟不带 `to` 的动词原形作宾补。\n3. 【关联点】此刻的得意，与之后 `pounced on it with delight` (高兴地扑过去) 遥相呼应。"
    },
    {
        "english": "He had spotted a tiny bottle at the bottom of my case and he pounced on it with delight.",
        "chinese": "他在我的箱底发现了一只小瓶，高兴地一把抓了起来。",
        "note": "1. pounce on: 动词短语，意为“猛扑向”，生动地描绘了官员急切的动作。with delight 意为“高兴地”。【关联点】这和我们之前遇到的 the Officer's face light up (脸上露出喜色) 情绪一致，都描绘了他自以为抓到把柄时的得意。\n\n2. 时态分析：had spotted (过去完成时) 表示“发现”这个动作，发生在 pounced (一般过去时) 之前，清晰地交代了事件的先后顺序。【关联点】这和我们之前遇到的 All the thing I had packed... were in a mess 类似，都是用过去完成时来表示一个更早发生的动作，让叙事更有层次感。"
    },
    {
        "english": "'Perfume, eh?' he asked sarcastically.",
        "chinese": "“香水，嗯？”他讥讽地说道，",
        "note": "1. sarcastically: adv. 讥讽地，挖苦地。这个词是理解本句情绪的关键，它生动描绘了官员此刻不相信且带有嘲讽的语气，认为自己抓住了“我”的把柄。\n\n2. 【关联点】注意本文中一系列描绘语气的副词。这里的 sarcastically (讥讽地) 与我们之前遇到的 confidently (自信地) 和之后会遇到的 encouragingly (鼓励地) 形成情绪对抗，展现了一场心理博弈。"
    },
    {
        "english": "'You should have declared that.",
        "chinese": "“你刚才应该申报，",
        "note": "1. 核心句型 should have + 动词过去分词，表示“本应该做某事，但实际没做”，常带有责备或遗憾的语气。这是官员对“我”的直接指责，是故事冲突的高潮。\n\n2. 【关联点】这句话直接呼应了官员之前的提问 'Have you anything to declare?'。至此，贯穿全文的核心词 declare 的三种关键用法（否定、疑问、虚拟指责）全部出现，构成了一个完整的语言情境。"
    },
    {
        "english": "Perfume is not exempt from import duty.'",
        "chinese": "香水要上进口税的。”",
        "note": "1. 核心短语 be exempt from... 意为“被免除…”，后接名词。import duty 意为“进口税”。整个句子用否定形式 is not exempt from... 表达肯定的含义：需要缴税。\n\n2. 【关联点】这句话是理解故事冲突的关键。它解释了为什么官员会指责 'You should have declared that'。因为香水需要缴纳进口税，所以它属于必须申报 (declare) 的物品。这正是整个误会的根源。"
    },
    {
        "english": "'But it isn't perfume,' I said.",
        "chinese": "“不，这不是香水，”我说，",
        "note": "1. But 在句首，表明这是一个强烈的反驳。这句话直接否定了官员的猜测 ('Perfume, eh?')，点明了整个故事的核心误会。\n\n2. 【关联点】句型 It isn't... (它不是...) 与紧随其后的 'It's hair gel.' (它是...) 构成一组完美的“否定-肯定”回答。这种先否定错误猜测，再给出正确答案的模式，是澄清误会的经典方式，逻辑清晰有力。"
    },
    {
        "english": "'It's hair gel.'",
        "chinese": "“是发胶。”",
        "note": "1. 句型 It's... (它是...) 是最基础的“主谓表”结构，用于揭示事物的真实身份，是整个故事的转折点。\n\n2. 【关联点】这和我们之前遇到的 'But it isn't perfume.' (它不是...) 构成一组完美的“否定-肯定”回答。先否定错误猜测，再给出正确答案，是澄清误会的有力方式。"
    },
    {
        "english": "Then I added with a smile, 'It's a strange mixture I make myself.'",
        "chinese": "接着我脸带微笑补充说：“这是一种我自己配制的奇特的混合物。”",
        "note": "1. 核心句型 a strange mixture I make myself (我自己配制的混合物)。这是一个省略了关系代词that/which的定语从句，用来修饰前面的名词。\n【关联点】这个“名词 + 主语 + 动词”的修饰结构，和我们之前遇到的 All the thing I had packed... (我打包的东西) 完全一样，是一种非常地道的表达方式。\n\n2. with a smile: 介词短语，意为“带着微笑”，生动地描述了补充说明时的神态。\n【关联点】这和我们之前遇到的 with great care (非常仔细地) 和 with delight (高兴地) 类似，都是用“with+名词”来描绘动作的方式。\n\n3. myself: 反身代词，此处用于强调，突出这是“我”亲手制作的，而非他人之手。"
    },
    {
        "english": "'Try it!' I said encouragingly.",
        "chinese": "“你就闻一闻吧！”我催促说。",
        "note": "1. encouragingly: 副词，意为“鼓励地”，生动描绘出“我”引导官员去闻发胶时的神态。此时“我”已胸有成竹，甚至带着一丝戏谑，鼓励对方亲自验证。\n【关联点】注意本文中一系列描绘语气的副词。从我的 confidently (自信地) 到官员的 sarcastically (讥讽地)，再到这里的 encouragingly，构成了一场心理博弈，而这个词标志着“我”已稳操胜券。\n\n2. 'Try it!': 祈使句，意为“试一试”。结合上文官员把瓶子放到鼻孔的动作，这里的意思就是“闻闻看吧！”。这种“直接引语 + 主谓 + 副词”的结构是描述对话的常用方式，清晰地交代了说话内容、说话人以及说话的语气。"
    },
    {
        "english": "The officer unscrewed the cap and put the bottle to his nostrils.",
        "chinese": "海关官员拧开瓶盖，把瓶子放到鼻子底下。",
        "note": "1. unscrew: v. 拧开。核心在于前缀 un-，表示“相反的动作”。【关联点】这和我们之前遇到的 unlock (开锁) 和之后会遇到的 unpleasant (不愉快的) 中的 un- 类似，都表示“相反”或“不”，是构词的重要前缀。\n\n2. 句子结构是“主语 + 动词1 + and + 动词2”，生动地描绘了官员一连串的动作。主语 The officer 在 and 之后被省略，使叙事紧凑流畅。【关联点】这和我们之前遇到的 He had spotted... and he pounced... (他发现...然后扑了上去) 结构完全一样，都是描述连续动作的经典方式。\n\n3. put the bottle to his nostrils: 把瓶子放到鼻子下。这个动作直接展现了官员的怀疑，他要亲自验证瓶中之物，为下文“我”说出 'Try it!' (闻闻看！) 和他闻到怪味的情节做了铺垫。"
    },
    {
        "english": "He was greeted by an unpleasant smell which convinced him that I was telling the truth.",
        "chinese": "一股怪味袭来，使他相信了我说的真话。",
        "note": "1. unpleasant: adj. 难闻的，不愉快的。前缀 un- 表示“不”。【关联点】这和我们之前遇到的 unlock (开锁) 和 unscrew (拧开) 类似，前缀 un- 都表示“相反的动作”或“不”，是构词的关键。\n\n2. which convinced him...: 这是一个定语从句，which 指代前面的 smell，解释了是这股味道让他相信了。【关联点】这和我们之前遇到的 a strange mixture I make myself (我自己配制的混合物) 结构类似，都是用一个句子来修饰前面的名词，只不过这里明确使用了 which。\n\n3. convince sb that...: 使某人相信...。这个短语标志着故事的转折点：官员的怀疑被彻底打消，误会得以澄清。"
    },
    {
        "english": "A few minutes later, I was able to hurry away with precious chalk marks on my baggage.",
        "chinese": "几分钟后，我终于被放行，手提划着宝贵的粉笔记号的行李，匆匆离去。",
        "note": "1. was able to hurry away: 意为“得以匆匆离去”。be able to 强调经过努力或克服困难后“能够”做到某事，生动地表达了“我”终于摆脱麻烦后的解脱感。\n【关联点】这和我们之前遇到的 would never be able to close (将永远无法关上) 形成鲜明对比，从绝望到解脱，突显了故事的戏剧性转折。\n\n2. precious: adj. 宝贵的。粉笔记号本身不值钱，但它意味着检查通过、麻烦结束，因此对“我”来说无比“宝贵”。这个词巧妙地传达了作者如释重负的心情。\n\n3. 句型 with...: 介词短语作伴随状语，描述离开时的状态。\n【关联点】这和我们之前遇到的 with great care (非常仔细地), with delight (高兴地) 和 with a smile (带着微笑) 类似，都是用“with+名词”来生动描绘动作的方式。"
    }
]