[
    {
        "english": "It has been said that everyone lives by selling something.",
        "chinese": "据说每个人都靠出售某种东西来维持生活。",
        "note": "1. 句型“It has been said that...”意为“据说”，是引述普遍观点的常用句式。这里的It是形式主语，真正的主语是that引导的从句。\n\n2. 短语“live by doing sth.”指“以某种方式为生”。【关联点】这和我们下一句遇到的“teachers live by selling knowledge”完全一致，都是对本句核心观点的具体阐述。\n\n3. 句子的核心观点是“每个人都靠出售某种东西为生”。【关联点】注意这与后面提到的流浪汉(tramps)形成对比，他们“have nothing to sell”(没什么可卖的)。"
    },
    {
        "english": "In the light of this statement, teachers live by selling knowledge, philosophers by selling wisdom and priests by selling spiritual comfort.",
        "chinese": "根据这种说法，教师靠卖知识为生，哲学家靠卖智慧为生，牧师靠卖精神安慰为生。",
        "note": "1. 本句是典型的排比结构，列举了三种职业。为避免重复，后两句省略了动词live，这是英语中常见的简洁写法，使表达极为精炼。\n\n2. 短语 live by selling... 意为“靠出售...为生”。【关联点】这正是对开篇句“everyone lives by selling something”的具体举例说明，将抽象观点落实到具体职业上。\n\n3. 注意，这里出售的“知识”、“智慧”和“精神安慰”都是无形的服务。【关联点】这和我们之后遇到的“services which people perform for us”类似，其“true value”(真实价值)都很难用金钱(money)来衡量(measure)。"
    },
    {
        "english": "Though it may be possible to measure the value of material good in terms of money, it is extremely difficult to estimate the true value of the services which people perform for us.",
        "chinese": "虽然物质产品的价值可以用金钱来衡量，但要估算别人为我们为所提供的服务的价值却是极其困难的。",
        "note": "1. 核心句型是“Though..., it...”，用于引出对比。句中两次使用“it is + 形容词 + to do”结构，it是形式主语，真正的主语是后面的不定式短语，表示“做某事是...的”。\n\n2. 核心词汇对比：measure指精确“衡量”，而estimate指“估算”。【关联点】这直接回应了我们之前遇到的观点：教师出售的知识、哲学家出售的智慧等无形“服务”(services)，其真实价值(true value)是极难用金钱衡量的。\n\n3. 短语“the services which people perform for us”是关键概念。【关联点】这不仅包括之前提到的教师、哲学家的服务，也包括后面外科医生(surgeon)提供的救命服务，它们的共同点是价值难以估量。"
    },
    {
        "english": "There are times when we would willingly give everything we possess to save our lives, yet we might grudge paying a surgeon a high fee for offering us precisely this service.",
        "chinese": "有时，我们为了挽救生命，愿意付出我们所占有的一切。但就在外科大夫给我们提供了这种服务后，我们却可能为所支付的昂贵的费用而抱怨。",
        "note": "1. 本句用转折词yet连接了两个强烈对比：一边是愿意为生命付出一切(give everything we possess)，另一边却可能不情愿(grudge)为恰好是救命的服务支付高昂费用。\n\n2. 句型“There are times when...”意为“有的时候”，用于引出一种普遍存在的矛盾情况。\n\n3. 核心用法：grudge doing sth. 意为“不情愿做某事”或“吝惜做某事”。这里的grudge paying a fee生动描绘了事后反悔、心疼钱的心理。\n\n4. 【关联点】外科医生的救命服务，正是前文提到的“其真实价值极难估算(estimate the true value)”的“服务(services)”的绝佳例子。这种矛盾心理深刻揭示了为无形服务定价的困境。"
    },
    {
        "english": "The conditions of society are such that skills have to be paid for in the same way that goods are paid for at a shop.",
        "chinese": "社会上的情况就是如此，技术是必须付钱去买的，就像在商店里要花钱买商品一样。",
        "note": "1. 句型 such that... 意为“如此...以至于...”，用来引出一种必然的结果，强调社会规则与技能付费之间的因果关系。\n\n2. 核心是类比：skills have to be paid for ... in the same way that goods are paid for。通过被动语态和类比，强调“技能”和“商品”一样，都具有必须被购买的商品属性。\n\n3. 【关联点】这句话是对开篇“人人靠出售为生”观点的延伸：既然万物皆可“出售”(sell)，那么技能(skills)自然也需要被“购买”(be paid for)。\n\n4. 【关联点】但请注意，本句强调技能和商品在“需要付费”上相同，而我们之前遇到的句子则指出了它们在“价值估算”上的巨大差异：有形商品(goods)易衡量，无形服务(services)却极难估算。"
    },
    {
        "english": "Everyone has something to sell.",
        "chinese": "人人都有东西可以出售。",
        "note": "1. 核心结构是“名词 + to do”，不定式作后置定语，说明名词用途。something to sell 意为“可供出售的东西”。\n\n2. 注意Everyone虽指众人，但作单数看待，因此动词用has。\n\n3. 【关联点】本句是全文核心观点，与后文的流浪汉(tramps)形成对比，他们是唯一的例外：“have nothing to sell”。"
    },
    {
        "english": "Tramps seem to be the only exception to this general rule.",
        "chinese": "在这条普遍的规律前面，好像只有流浪汉是个例外，",
        "note": "1. 核心结构是主谓表句型。短语 seem to be 意为“似乎是”，表达一种不完全确定的判断。固定搭配 an exception to sth. 意为“是...的一个例外”，点明其特殊性。\n\n2. 【关联点】这里的 this general rule (这条普遍规律) 正是指开篇的核心观点：“Everyone has something to sell.”。本句直接点明，流浪汉(tramps)是这一规律的唯一例外，这与之前遇到的“They have nothing to sell”的描述完全吻合。"
    },
    {
        "english": "Beggars almost sell themselves as human being to arouse the pity of passers-by.",
        "chinese": "乞丐出售的几乎是他本人，以引起过路人的怜悯。",
        "note": "1. 核心短语 sell themselves 是一个生动的比喻，指乞丐通过牺牲尊严来换取怜悯(pity)。不定式短语 to arouse... 表明了其行为目的。\n\n2. 注意特殊名词复数 passers-by (过路人)，其复数形式是在核心词 passer 后加s，而非词尾。\n\n3. 【关联点】这和我们之前遇到的“人人靠出售为生”形成呼应，但乞丐“出售”的是自身的尊严。注意区分：乞丐的行为是为了激起怜悯(arouse pity)，而后面将提到的流浪汉(tramps)则截然相反，他们“绝不会要求你可怜他(never ask you to feel sorry for him)”。"
    },
    {
        "english": "But real tramps are not beggars.",
        "chinese": "但真正的流浪并不是乞丐。",
        "note": "1. 本句用转折词But划清了流浪汉(tramps)与乞丐(beggars)的界限，是全文区分这两个概念的关键句。它通过否定其中一方来定义另一方，强调了二者的本质不同。\n\n2. 【关联点】注意区分：我们之前遇到，乞丐(beggars)会“出卖自己以博取同情(sell themselves to arouse pity)”。而本句强调流浪汉并非如此，这为后文描述他们“绝不牺牲自由”的特质埋下伏笔。"
    },
    {
        "english": "They have nothing to sell and require nothing from others.",
        "chinese": "他们既不出售任何东西，也不需要从别人那儿得到任何东西，",
        "note": "1. 本句由and连接两个并列部分，强调了流浪汉在物质上的“双重否定”：既不售卖(sell)，也不索取(require)，体现了其独立性。\n\n2. 【关联点】“have nothing to sell”与开篇“Everyone has something to sell”的核心观点直接对立，印证了流浪汉是那条“普遍规律”(general rule)的“唯一例外”(the only exception)。\n\n3. 【关联点】“require nothing from others”则与乞丐(beggars)“arouse the pity”(激起怜悯)的行为形成对比，突显了流浪汉对尊严的坚守。"
    },
    {
        "english": "In seeking independence, they do not sacrifice their human dignity.",
        "chinese": "在追求独立自由的同时，他们并不牺牲为人的尊严。",
        "note": "1. 句首“In seeking...”结构表示“在做...的过程中”，为整个句子设定了背景。它强调了在追求某个目标的同时，伴随发生的行为。\n\n2. 核心词 sacrifice (牺牲) 是理解流浪汉精神的关键。【关联点】这和我们之后遇到的“he will never sacrifice his freedom”遥相呼应，说明尊严(dignity)和自由(freedom)都是他们不可动摇的底线。"
    },
    {
        "english": "A tramp may ask you for money, but he will never ask you to feel sorry for him.",
        "chinese": "游浪汉可能会向你讨钱，但他从来不要你可怜他。",
        "note": "1. 本句用but连接两个对比鲜明的行为：可以讨钱(ask for money)，但绝不要怜悯(never ask you to feel sorry for him)，突显了流浪汉的尊严。\n\n2. 句中展示了动词ask的两种核心用法：ask for sth. (请求某物) 和 ask sb. to do sth. (请求某人做某事)。\n\n3. 【关联点】这与我们之前遇到的乞丐(beggars)形成鲜明对比，乞丐的行为是为了激起怜悯(arouse the pity)，而流浪汉恰恰相反，这正是二者的本质区别。"
    },
    {
        "english": "He has deliberately chosen to lead the life he leads and is fully aware of the consequences.",
        "chinese": "他是故意在选择过那种生活的，并完全清楚以这种方式生活的后果。",
        "note": "1. 本句由and连接两个并列部分，强调“他”的行为是主动选择 (has deliberately chosen) 且有清醒认知 (is fully aware of) 的。\n\n2. 短语 lead the life he leads 意为“过他所过的这种生活”，用重复的动词来加强语气，指一种特定且持续的生活方式。\n\n3. 【关联点】“故意选择”和“清楚后果”正是流浪汉精神的核心。这为后文他“绝不牺牲自由”的行为提供了动机：自由是他明知后果也要追求的价值。"
    },
    {
        "english": "He may never be sure where the next meal is coming from, but his is free from the thousands of anxieties which afflict other people.",
        "chinese": "他可能从不知道下顿饭有无着落，但他不像有人那样被千万桩愁事所折磨。",
        "note": "1. 本句用but连接，形成鲜明对比：一边是对物质(下顿饭)的不确定，另一边是精神上免于千万桩烦恼(free from anxieties)。\n\n2. 核心短语：afflict意为“折磨”，比suffer更正式，强调痛苦的施加。free from意为“免于”，强调摆脱了负面事物。\n\n3. 注意后半句主语his是一个名词性物主代词，指代“his life”或“his situation”，使表达更简洁。\n\n4. 【关联点】“免于焦虑”(free from anxieties)正是流浪汉生活方式的核心优势，这与我们最后遇到的“无忧无虑”(freedom from care)和他们“绝不牺牲自由”的主题完全一致。"
    },
    {
        "english": "His few material possessions make it possible for him to move from place to place with ease.",
        "chinese": "他几乎没有什么财产，这使他能够轻松自如地在各地奔波。",
        "note": "1. 核心句型是 make it + 形容词 + for sb. to do sth.，意为“使某人做某事成为可能”。这里的it是形式宾语，代替后面的不定式短语。\n\n2. 【关联点】这和我们之前遇到的“it is extremely difficult to estimate...”句型类似，都是用it作形式主语或宾语，指代后面的不定式短语，这是英语中避免头重脚轻的常用技巧。\n\n3. 词汇 material possessions (物质财产) 与 possess (拥有) 动词形式相关。【关联点】这与我们之前讨论的“有形商品(material good)”相对，更与为挽救生命时愿意付出的“我们所占有的一切(everything we possess)”形成鲜明对比，突显了他物质上的贫乏。"
    },
    {
        "english": "By having to sleep in the open, he gets far closer to the world of nature than most of us ever do.",
        "chinese": "由于被迫在露天睡觉，他比我们中许多人都离大自然近得多。",
        "note": "1. 核心是比较句型。far用来加强比较级，意为“...得多”。句尾的do是助动词，代替前面的get closer to the world of nature，避免重复，使句子更简洁。\n\n2. 句首的“By having to...”结构表示原因或方式，即“由于被迫...”。【关联点】这和我们之前遇到的“everyone lives by selling something”中的“by selling”用法类似，都是通过“by+动名词”的形式来说明方式或原因。\n\n3. “离自然更近”是流浪汉生活方式的一个侧面。【关联点】这与我们之前遇到的他“免于千万桩愁事(free from anxieties)”和之后会遇到的“无忧无虑(freedom from care)”相呼应，共同构成了那种可能令我们羡慕的简朴生活。"
    },
    {
        "english": "He may hunt, beg, or stead occasionally to keep himself alive; he may even, in times of real need, do a little work; but he will never sacrifice his freedom.",
        "chinese": "为了生存，他可能会去打猎、乞讨，偶尔偷上一两回；确实需要的时候，他甚至可能干一点儿活，但他决不会牺牲自由。",
        "note": "1. 本句由分号和but连接，构成“可以做A，可以做B，但绝不做C”的递进转折结构。它通过列举一系列生存手段，最终强调“自由”是不可逾越的底线，极为有力。\n\n2. 核心词sacrifice(牺牲)。【关联点】这和我们之前遇到的“do not sacrifice their human dignity”遥相呼应。尊严(dignity)和自由(freedom)是流浪汉绝不放弃的两大核心价值。\n\n3. 短语keep himself alive意为“维持生命”。【关联点】这与我们为救命(to save our lives)愿意“付出一切(give everything)”形成对比，突显流浪汉即使为生存，也有不可牺牲的原则。"
    },
    {
        "english": "We often speak of tramps with contempt and put them in the same class as beggars, but how many of us can honestly say that we have not felt a little envious of their simple way of life and their freedom from care?",
        "chinese": "说起流浪汉，我们常常带有轻蔑并把他们与乞丐归为一类。但是，我们中有多少人能够坦率地说我们对流浪汉的简朴生活与无忧无虑的境况不感到有些羡慕呢？",
        "note": "1. 本句用but连接，形成强烈对比：我们公开表示轻蔑(contempt)，却又私下对流浪汉的生活感到羡慕(envious)。这是一种引人深思的矛盾心理。\n\n2. 短语 put...in the same class as... 意为“把...归为一类”。【关联点】这正是对全文试图纠正的普遍误解的总结。我们之前已明确区分：But real tramps are not beggars。\n\n3. 核心短语 freedom from care 意为“无忧无虑”。【关联点】这与我们之前遇到的他“免于千万桩愁事(free from the thousands of anxieties)”的主题完美呼应，点明了这种生活方式最吸引人的一面。\n\n4. 句末的反问句是一种有力的修辞手法，它不期待回答，而是引导读者反思自己内心的真实感受，为全文画上一个发人深省的句号。"
    }
]