[
    {
        "english": "Editors of newspapers and magazines often go to extremes to provide their reader with unimportant facts and statistics.",
        "chinese": "报刊杂志的编辑常常为了向读者提供一些关紧要的事实和统计数字而走极端 。",
        "note": "1. 掌握核心搭配：go to extremes (走极端) 和 provide sb with sth (为某人提供某物)。前者指行为过火，后者是“提供”的经典用法。\n2. 【关联点】这和我们之前遇到的 send the journalist a fax 句型类似。注意区分：send sb sth (直接跟双宾语)，而 provide sb WITH sth (需要介词with)。\n3. 【关联点】这句话是对整个故事的总结。文中的编辑正是为了得到台阶数量这种看似“unimportant facts”而“go to extremes”的典型。"
    },
    {
        "english": "Last year a journalist had been instructed by a well-known magazine to write an article on the president's palace in a new African republic.",
        "chinese": "去年，一位记者受一家有名的杂志的委托写一篇关于非洲某个新成立共和国总统府的文章。",
        "note": "1. 核心句型是 A be instructed by B to do C (A被B委托去做C)。这里的 had been instructed 是过去完成时的被动语态，表示“委托”这个动作发生在故事主要时间点（过去）之前。\n\n2. 【关联点】这和我们后面遇到的 a fax instructing him... (一份指示他...的传真) 类似。注意动词 instruct 的两种形式：这里是被动的谓语动词，后面是主动的现在分词作定语。\n\n3. 【关联点】这是本课首次出现被动语态，请留意。后面记者“被逮捕”(be arrested)、“被送进监狱”(be sent to prison) 等都使用了这个语态，强调主语是动作的承受者。\n\n4. 句中的 on a new...republic 意为“关于一个新的...共和国”，介词 on 在此表示文章的主题是“关于...”。"
    },
    {
        "english": "When the article arrived, the editor read the first sentence and then refuse to publish it.",
        "chinese": "稿子寄来后，编辑看第一句话就拒绝予以发表。",
        "note": "1. 核心结构是“When..., ... and then ...”，描述一连串的过去动作：稿子到了 -> 编辑读了 -> 拒绝发表。注意所有动词都使用过去式 (arrived, read, refused)。\n\n2. 掌握核心搭配 refuse to do sth (拒绝做某事)，表示拒绝某个行为。句中编辑拒绝的行为是 to publish it (发表它)。\n\n3. 【关联点】注意这里的 refuse to publish (拒绝发表) 与故事结尾的 reluctantly published (不情愿地发表) 形成鲜明对比，展现了编辑态度的转变。"
    },
    {
        "english": "The article began: 'Hundreds of steps lead to the high wall which surrounds the president's palace'.",
        "chinese": "文章的开头是这样的：“几百级台阶通向环绕总统的高墙。”",
        "note": "1. 核心结构是“The article began: + 引文”。冒号引出文章的具体开篇内容。引文的主干是 Hundreds of steps lead to the high wall (几百级台阶通向高墙)。\n\n2. 句中的 which surrounds the president's palace 是一个定语从句，像形容词一样修饰前面的 the high wall，说明是“环绕着总统宫殿的”那堵墙。\n\n3. 【关联点】注意本句中的 lead to 和 which surrounds...。这和我们最后遇到的长难句中 ...steps leading to the...wall which surrounded... 的结构高度相似，都是描述台阶通向围墙，围墙环绕宫殿。通过对比，可以加深对现在分词作定语和定语从句的理解。\n\n4. 注意时态：主句用过去时 began，表示文章“开始”这个动作已发生；引文内用现在时 lead 和 surrounds，因为描述的是一个客观存在的事实。"
    },
    {
        "english": "The editor at once sent the journalist a fax instructing him to find out the exact number of steps and the height of the wall.",
        "chinese": "编辑立即给那位记者发去传真，要求他核实一下台阶的确切数字和围墙的高度。",
        "note": "1. 核心句型是 send sb sth (给某人发送某物)，即“主谓双宾”结构。这里的 the journalist 是间接宾语，a fax 是直接宾语。\n\n2. instructing him to find out... 是现在分词短语作后置定语，修饰 a fax，说明传真的内容是“指示他去查明...”。\n\n3. 【关联点】注意区分这里的 instructing 和之前遇到的 had been instructed。前者是主动分词作定语，修饰名词；后者是被动语态作谓语，表示主语“被委托”。"
    },
    {
        "english": "The journalist immediately set out to obtain these important facts, but the took a long time to send them",
        "chinese": "记者立即出发去核实这些重要的事实，但过了好长时间不见他把数字寄来，",
        "note": "1. 掌握两个核心搭配：set out to do sth (出发去做某事) 和 take a long time to do sth (花很长时间做某事)。句子用 but 连接，对比了“立即出发”和“漫长等待”的结果。\n\n2. 【关联点】这里的 obtain (获得) 强调“得到”结果。这和我们之前遇到的 find out (查明) 类似，但 find out 更侧重于“弄清楚”的过程。\n\n3. 【关联点】句中的 these important facts (这些重要事实) 正是回应了第一句中编辑们追求的 unimportant facts (不重要的事实)，体现了故事的核心矛盾。"
    },
    {
        "english": "Meanwhile, the editor was getting impatient, for the magazine would soon go to press.",
        "chinese": "在此期间，编辑等得不耐烦了，因为杂志马上要付印。",
        "note": "1. 核心在于两个表达：get impatient (变得不耐烦)，用“get+形容词”表示状态变化；for 在此是连词，意为“因为”，引出原因。\n2. 固定搭配 go to press 意为“(报刊)付印”。【关联点】这和我们之前遇到的 refuse to publish (拒绝发表) 及后面的 reluctantly published (不情愿地发表) 紧密相关，都围绕着“出版”这一核心事件。\n3. 句中的 would go to press 表示过去将来时，即在当时看来的“将要”。【关联点】这和后面威胁记者时说的 he would be fired (他就会被解雇) 中的 would 用法类似，都是基于过去时间点的预测。"
    },
    {
        "english": "He sent the journalist two more faxes, but received no reply.",
        "chinese": "他给记者先后发去两份传真，但对方毫无反应。",
        "note": "1. 核心句型是 send sb sth (给某人发送某物)。【关联点】这和 The editor...sent the journalist a fax 句型相同。注意区分需介词的 provide sb WITH sth。\n\n2. 句中 but received no reply 形成强烈转折。“no+名词”是简洁有力的否定形式。【关联点】这和后面遇到的 failed to reply 意思相近，但表达方式不同。\n\n3. 词汇点：two more faxes 意为“又两份传真”，暗示之前已经发过。sent (发送) 和 received (收到) 是一对核心反义词，体现了动作的来回。"
    },
    {
        "english": "He sent yet another fax informing the journalist that if he did not reply soon he would be fired.",
        "chinese": "于是他又发了一份传真， 通知那位记者说，若再不迅速答复，将被解雇。",
        "note": "1. 核心结构是 He sent a fax informing sb that... (他发传真通知某人某事)。informing... 是现在分词作定语，说明传真内容，而that从句则是inform的具体内容。\n\n2. 【关联点】informing... 的用法和我们之前遇到的 a fax instructing him... 完全一样，都是现在分词短语作后置定语，修饰名词fax。\n\n3. 【关联点】if...he would be fired 是基于过去的推测。这和之前 a magazine would soon go to press 中的 would 用法一致，都表示“过去将来”。\n\n4. 【关联点】be fired (被解雇) 是被动语态。这和记者后来 had been arrested (被逮捕) 的用法相同，都强调主语是动作的承受者。"
    },
    {
        "english": "When the journalist again failed to reply, the editor reluctantly published the article as it had originally been written.",
        "chinese": "但记者还是没有回复。编辑无奈，勉强按原样发稿了。",
        "note": "1. 核心搭配 fail to do sth (没能做某事)，指尝试但未成功。【关联点】这和我们之前遇到的 received no reply 意思相近，但前者强调“没能做到”，后者强调“没收到”的结果。\n\n2. reluctantly (不情愿地) + published (发表) 揭示了编辑无奈的心情。【关联点】这与之前的 refuse to publish (拒绝发表) 形成鲜明对比，展现了编辑从坚决拒绝到被迫接受的态度转变。\n\n3. 句式 as it had originally been written 意为“按原样”。【关联点】had been written 是过去完成时被动语态，表示“写”发生在“发表”之前。这和记者 had been arrested (被捕) 的时态用法一致，都表示发生在过去更早的被动动作。"
    },
    {
        "english": "A week later, the editor at last received a fax from the journalist.",
        "chinese": "一周之后，编辑终于接到记者的传真。",
        "note": "1. 核心短语 at last 意为“终于”，强调了编辑经过漫长等待后才收到传真，凸显其不耐烦的心情。\n\n2. 【关联点】这是故事的关键转折。此前编辑一直在 send (发送) 传真，此处他终于 received (收到) 回复。注意这对核心反义动词的运用。\n\n3. 【关联点】at last 的使用直接呼应了前文的 the editor was getting impatient (编辑变得不耐烦了)，表明他的耐心几乎耗尽。"
    },
    {
        "english": "Not only had the poor man been arrested, but he had been sent to prison as well.",
        "chinese": "那个可怜的记者不仅被捕了，而且还被送进了监狱。",
        "note": "1. 核心句型是 Not only... but... as well (不仅...而且...)，用于强调两件事都发生了。当 Not only 置于句首时，其后的分句需要倒装，即将助动词(had)提前到主语(the poor man)前，形成类似问句的语序。\n\n2. 【关联点】句中两个动作 had been arrested 和 had been sent 均为过去完成时被动语态。这和我们之前遇到的 had been instructed (被委托) 和 had been written (被写好) 的用法完全一致，都表示在过去某个时间点之前，主语被动地承受了某个动作。"
    },
    {
        "english": "However, he had at last been allowed to send a fax in which he informed the editor that the he had been arrested while counting the 1,084 steps leading to the fifteen-foot wall which surrounded the president's palace.",
        "chinese": "不过，他终于获准发回了一份传真。在传真中他告诉编辑，就在他数通向15英尺高的总统府围墙的1，084级台阶时，被抓了起来。",
        "note": "1. 这是一个典型的长难句，核心是“他获准发了传真”。后面的 in which, that, while, leading to, which 像一层层包装纸，不断添加传真内容、被捕时间、地点等细节。\n\n2. 【关联点】句中的 had been allowed 和 had been arrested 都是过去完成时被动语态。这和我们之前遇到的 had been instructed (被委托) 和 Not only had...been arrested (不仅被捕) 的用法完全一致，都表示在过去某个时间点之前完成的被动动作。\n\n3. 【关联点】注意...steps leading to the...wall which surrounded...的结构。这和我们之前遇到的 The article began: '...steps lead to the...wall which surrounds...' 几乎完全一样。对比学习现在分词作定语(leading)和定语从句(which...)的用法。\n\n4. 【关联点】句式 inform the editor that... (通知编辑某事)的用法。这和我们之前遇到的 a fax informing the journalist that... (通知记者的传真) 结构相同，都是“通知某人某事”的经典表达。"
    }
]