[
    {
        "english": "One of the most famous sailing ships of the nineteenth century, the Cutty Sark, can still be seen at Greewich.",
        "chinese": "人们在格林威治仍可看到19世纪最有名的帆船之一“卡蒂萨克”号。",
        "note": "1. 句子的主语很长，核心是“One of the...”（...之一）。后面用逗号隔开的“the Cutty Sark”是同位语，即对前面名词的补充说明，两者指同一事物。\n\n2. 【关联点】这个“One of the + 最高级 + 复数名词”的结构，和我们后面遇到的“The Cutty Sark was one of the fastest sailing ships...”完全一样，都是强调“最...之一”。\n\n3. “can still be seen”意为“仍然能被看见”，是被动语态，强调主语是动作的承受者。【关联点】这和我们遇到的“is visited”(被参观)，“were replaced”(被取代)等用法类似，都是强调“被”怎么样。"
    },
    {
        "english": "She stands on dry land and is visited by thousands of people each year.",
        "chinese": "它停在陆地上，每年接待成千上万的参观者。",
        "note": "1. 动词stand在此处不是指人“站立”，而是形象地表示船、建筑等大型物体“坐落，矗立”于某地。\n\n2. 本句由and连接两个描述主语“She”的并列分句。第一部分是主动语态，描述其位置；第二部分是被动语态“is visited”，描述其经历。\n\n3. 【关联点】被动语态是本课重点。这里的“is visited”（被参观）和我们遇到的“can be seen”（被看见）、“were replaced”（被取代）、“was struck by”（被袭击）等用法一致，都强调主语是动作的承受者，而非发出者。\n\n4. thousands of 意为“成千上万的”，用来强调数量之多，后面直接跟复数名词。"
    },
    {
        "english": "She serves as an impressive reminder of the great ships of past.",
        "chinese": "它给人们留下深刻的印象，使人们回忆起历史上的巨型帆船。",
        "note": "1. serve as 意为“充当，用作”，生动地表达某物起到了...的作用。例如，一块大石头可以 serve as a chair（充当椅子）。\n\n2. an impressive reminder of... 意为“一个...的深刻提醒物”，用来引出其象征意义或让人联想到的事物。\n\n3. 【关联点】本句中，“serves as”起到了类似系动词的作用，连接主语和表语。这和我们遇到的“The Cutty Sark was one of the fastest ships”或“This race was the last of its kind”等“主谓表”结构类似，都是在解释主语的身份或性质。"
    },
    {
        "english": "Before they were replaced by steamships, sailing vessels like the Cutty Sark were used to carry tea from China and wool from Australia.",
        "chinese": "在蒸汽船取代帆船之前，“卡蒂萨克”号之类的帆船被用来从中国运回茶叶，从澳大利亚运回羊毛。",
        "note": "1. 本句由“Before...”引导的时间状语从句开场，为后面的主句设定历史背景，结构清晰。\n\n2. 核心短语是“be used to do sth.”，意为“被用来做某事”，强调工具或物品的用途。\n\n3. 【关联点】被动语态是本课重点。句中的“were replaced”(被取代)和“were used”(被使用)与我们遇到的“can be seen”(被看见)、“is visited”(被参观)等用法一致，都强调主语是动作的承受者。\n\n4. 【关联点】注意区分“be used to do”(被用来做)和“be used to doing”(习惯于做)。前者描述物的用途，后者描述人的习惯。"
    },
    {
        "english": "The Cutty Sark was one the fastest sailing ships that has ever been built.",
        "chinese": "“卡蒂萨克”号是帆船制造史上建造的最快的一艘帆船。",
        "note": "1. 核心结构是“one of the + 最高级 + 复数名词”，意为“最...之一”。【关联点】这和我们开篇遇到的“One of the most famous...”完全一样，用于强调。\n\n2. “that has ever been built”是定语从句，修饰前面的ships。“ever”与现在完成时连用，生动地强调了“有史以来”的含义。\n\n3. 【关联点】被动语态是本课重点。“has been built”（被建造）与我们遇到的“can be seen”、“is visited”等用法一致，都强调主语“被”怎么样。"
    },
    {
        "english": "The only other ship to match her was the Thermopylae.",
        "chinese": "唯一可以与之一比高低的是“塞姆皮雷”号帆船。",
        "note": "1. 核心词汇 match (v.) 意为“与...匹敌，相配”，指两者在能力或水平上不相上下。\n\n2. 本句是“主谓表”结构，但主语较长。核心在于不定式短语“to match her”作后置定语，修饰名词ship，解释是“哪一种船”。\n\n3. 【关联点】不定式作定语的用法，和我们后面遇到的“The first... to reach Java...”完全一样。注意区分它和表目的的用法，如“...were used to carry tea”（被用来运茶）。"
    },
    {
        "english": "Both these ships set out from Shanghai on June 18th, 1872 on an exciting race to England.",
        "chinese": "两船于1872年6月18日同时从上海启航驶往英国，途中展开了一场激烈的比赛。",
        "note": "1. 动词短语 set out 意为“出发，启程”。动词 set 的过去式与原形相同，此处为过去式。\n\n2. 句子结构为“主语+谓语”，后面紧跟地点(from...)、时间(on...)和目的(on...)三个状语，清晰交代了事件的要素。\n\n3. 【关联点】本句的 set out on a race (出发比赛) 是整个故事的开端，与后面的 took lead (领先), lost her lead (落后) 以及 arrive (到达) 等情节环环相扣，构成了一条完整的故事线。"
    },
    {
        "english": "This race, which went on for exactly four exactly four months, was the last of its kind.",
        "chinese": "这场比赛持续了整整4个月，是这类比赛中的最后一次。",
        "note": "1. 本句主干是 \"This race was the last of its kind\"，中间由逗号隔开的 \"which...\" 是非限制性定语从句，作为补充信息，说明比赛持续的时间。\n\n2. 【关联点】这和我们遇到的 \"ships that has ever been built\" 不同。此处的 \"which\" 从句用逗号隔开，是额外信息；而 \"that\" 从句没有逗号，是修饰ships的核心信息。\n\n3. 【关联点】短语 \"the last of its kind\" (此类中的最后一次) 极具终结感，与前文 \"It marked the end of the great tradition...\" 遥相呼应，共同为帆船竞赛的时代画上句号。"
    },
    {
        "english": "It marked the end of the great tradition of ships with sails and the beginning of a new era.",
        "chinese": "它标志着帆船伟大传统的结束与一个新纪元的开始。",
        "note": "1. 动词mark意为“标志着”，引出一个由and连接的对称结构：the end of... and the beginning of...，清晰地表达了新旧交替的转折点。\n\n2. 【关联点】本句宏观上标志着一个时代的结束。这和我们后面遇到的“This race... was the last of its kind”（此类中的最后一次）在主题上遥相呼应，共同为帆船时代画上句号。"
    },
    {
        "english": "The first of the two ships to reach Java after the race had begun was the Thermopylae, but on the Indian Ocean, the Cutty Sark took lead.",
        "chinese": "比赛开始后，“赛姆皮雷”号率先抵达爪哇岛。但在印度洋上，“卡萨萨克”号驶到了前面。",
        "note": "1. 本句由but连接，呈现了比赛的首次反转。前半句主语很长，核心是“The first... was...”，即“第一艘船是...”。\n\n2. 【关联点】主语中的不定式短语“to reach Java”作后置定语，修饰ship。这和我们之前遇到的“The only other ship to match her”的用法完全一样。\n\n3. 动词时态“had begun”（过去完成时）表示“比赛开始”这个动作，发生在“抵达爪哇”这个过去动作之前。\n\n4. 核心短语take lead意为“取得领先”。【关联点】这个情节与之前的set out(出发)和后来的lost her lead(失去领先)环环相扣，生动地描绘了比赛的跌宕起伏。"
    },
    {
        "english": "It seemed certain that she would be the first ship home, but during the race she had a lot of bad luck.",
        "chinese": "看来，它首先返抵英国是确信无疑的了，但它却在比赛中连遭厄运。",
        "note": "1. 本句由but连接，呈现了比赛的第二次反转：从看似必胜到厄运连连。前半句的“It seemed certain that...”句型中，it是形式主语，真正的主语是后面的that从句。\n\n2. 【关联点】这个“it”作形式主语的用法，和我们后面遇到的“it became impossible to steer her”以及“it was impossible... to win”完全一样，都是用it作占位符，使句子更平衡。\n\n3. would be用来表示“从过去看将来”的预测。在当时“看来(seemed)”，船“将会(would be)”是第一名，这是一种过去将来时。\n\n4. 【关联点】短语bad luck(厄运)是故事的关键转折点，直接引出了后面“was struck by a storm”(被风暴袭击)和rudder“was torn away”(舵被毁)等具体的不幸遭遇。"
    },
    {
        "english": "In August, she was struck by a very heavy storm during which her rudder was torn away.",
        "chinese": "8月份“卡蒂萨克”号遭到一场特大风暴的袭击，失去了一只舵。",
        "note": "1. 核心动词短语是 was struck by (被...袭击) 和 was torn away (被撕毁)。两者都是被动语态，生动描绘了船在风暴中的无助。\n\n2. 【关联点】被动语态是本课重点。这里的用法与我们遇到的 can be seen (被看见), is visited (被参观), were replaced (被取代) 等完全一致，都强调主语是动作的承受者。\n\n3. 句子的后半部分 “during which...” 是一个定语从句，修饰前面的 storm。“during which” 相当于 “and during the storm”，巧妙地将两个事件（遭风暴，毁舵）连接在同一时间背景下。\n\n4. 【关联点】这句话具体解释了前文提到的 bad luck (厄运)。正是这场风暴(storm)导致了船舵(rudder)被毁，是故事的关键转折点，直接引出了后续的一系列困难。"
    },
    {
        "english": "The Cutty Sark rolled from side to side and it became impossible to steer her.",
        "chinese": "船身左右摇晃，无法操纵。",
        "note": "1. 动词roll from side to side生动描绘了船只剧烈“左右摇晃”的动态。动词steer意为“操纵，驾驶方向”，指控制船的航向。\n\n2. 后半句的核心句型是“it became impossible to do sth.”，意为“做某事变得不可能了”。这里的it是形式主语，真正的主语是后面的不定式短语“to steer her”。\n\n3. 【关联点】这个“it”作形式主语的用法，和我们之前遇到的“It seemed certain that...”以及后面将遇到的“it was impossible...to win”完全一样，都是用it作占位符，使句子结构更平衡。\n\n4. 【关联点】船只“左右摇晃(rolled)”以至于“无法操纵(impossible to steer)”，这是前文提到的bad luck(厄运)和storm(风暴)造成的直接后果，推动了故事情节的发展。"
    },
    {
        "english": "A temporary rudder was made on board from spare planks and it was fitted with great difficulty.",
        "chinese": "船员用备用的木板在船上赶制了一只应急用的舵，并克服重重困难将舵安装就位。",
        "note": "1. 本句由and连接两个并列的被动语态分句，清晰描述了应急舵(temporary rudder)的两个步骤：was made (被制造) 和 was fitted (被安装)。\n\n2. 短语 with great difficulty 意为“克服重重困难”，生动地描绘了安装过程的艰辛。\n\n3. 【关联点】被动语态是本课重点。这里的 was made 和 was fitted 与我们遇到的 can be seen, is visited, was struck by 等用法完全一致，都强调主语是动作的承受者。\n\n4. 【关联点】这个 temporary rudder (应急舵) 正是为了解决前文提到的 rudder was torn away (舵被毁) 的问题而制作的，体现了故事情节的因果关系。"
    },
    {
        "english": "This greatly reduced the speed of the ship, for there was a danger that if she traveled too quickly, this rudder would be torn away as well.",
        "chinese": "这样一来，大大降低了船的航速。因为船不能开得太快，否则就有危险，应急舵也会被刮走。",
        "note": "1. 主句说明结果(减速)，for引导原因从句。连词for在此意为“因为”，比because更正式。【关联点】注意区分后面遇到的Because of this，后者是介词短语，后面只能跟名词。\n\n2. there was a danger that...是固定句型，that从句解释danger的内容。从句中的if...would...是虚拟语气，表示对当时看来未来可能发生危险的推测。【关联点】注意这与课文结尾对过去事实相反的假设if...had not..., would have...不同。\n\n3. 动词短语be torn away(被刮走)是被动语态。【关联点】这和我们遇到的was struck by, was made, was fitted等用法完全一致，都是本课重点，强调主语是动作的承受者。"
    },
    {
        "english": "Because of this, the Cutty Sark lost her lead.",
        "chinese": "因为这个缘故，“卡蒂萨克”号落到了后面。",
        "note": "1. 核心短语 lose one's lead 意为“失去领先地位”。这里的 her 指代船只，是英语中将船、国家等拟人化为女性的常见用法。\n\n2. 【关联点】Because of 是介词短语，后接名词或代词(this)。注意区分我们之前遇到的连词 for (因为)，for 后面必须跟一个完整的句子来解释原因。\n\n3. 【关联点】情节上，lost her lead (失去领先) 与之前的 took lead (取得领先) 形成强烈反转，生动描绘了比赛的戏剧性，是故事的关键转折点。"
    },
    {
        "english": "After crossing the Equator, the captain called in at a port to have a new rudder fitted, but by now the Thermopylae was over five hundred miles ahead.",
        "chinese": "跨越赤道后，船长将船停靠在一个港口，在那儿换了一只舵。但此时，“赛姆皮雷”号早已在500多英里之遥了。",
        "note": "1. 核心短语 call in at 意为“（船只）停靠（港口）”。动词短语 have sth. done (此处为 have a rudder fitted) 意为“让某物被做”，强调由他人完成某事。\n\n2. 【关联点】have sth. fitted (让舵被安装) 与我们之前遇到的 was fitted (被安装) 形式不同，但都描述了“安装”这个动作。前者强调“安排别人做”，后者仅陈述“被做了”这个事实。\n\n3. 【关联点】本句是故事的又一转折。船长停靠港口换舵，直接导致对手遥遥领先(ahead)，这与之前 Cutty Sark 号的 took lead (领先) 和 lost her lead (失去领先) 形成了鲜明对比。\n\n4. by now 意为“到此时”，点明了时间点，强调在换舵的这个时间点上，差距已经拉得非常大了。"
    },
    {
        "english": "Though the new rudder was fitted at tremendous speed, it was impossible for the Cutty Sark to win.",
        "chinese": "尽管换装新舵时分秒必争，但“卡蒂萨克”号已经不可能取胜了。",
        "note": "1. 本句由Though引导，呈现强烈转折：尽管换舵时分秒必争(at tremendous speed)，但结果已无法挽回。\n\n2. 动词fit(安装)以被动语态was fitted出现。【关联点】这和我们遇到的was made, was struck by等用法一致，都是本课重点。注意它和have a rudder fitted(安排人安装)的区别。\n\n3. 核心句型是“it was impossible for sb. to do sth.”。【关联点】这是本课第三次出现it作形式主语，和It seemed certain...及it became impossible...的用法完全一样。\n\n4. 最终“不可能取胜(impossible to win)”的结局，为全文结尾的虚拟语气“本可以轻松获胜(would have won)”埋下伏笔，形成强烈对比，突显遗憾。"
    },
    {
        "english": "She arrived in England a week after the Thermopylae.",
        "chinese": "它抵达英国时比“塞姆皮雷”号晚了1个星期。",
        "note": "1. 核心动词arrive意为“到达”。注意介词搭配：arrive in + 大地方 (国家、城市)，arrive at + 小地方 (车站、机场)。\n\n2. 【关联点】本句结构与我们遇到的“set out from Shanghai on June 18th”类似，都是“主语+谓语”后接地点状语(in England)和时间状语(a week after...)，清晰交代事件要素。\n\n3. 【关联点】动词arrive(到达)标志着比赛的终点，与之前的set out(出发)、took lead(领先)和lost her lead(失去领先)等情节环环相扣，构成了完整的故事线。"
    },
    {
        "english": "Even this was remarkable, considering that she had had so many delays.",
        "chinese": "但考虑到路上的多次耽搁，这个成绩也已很不容易了。",
        "note": "1. 核心短语 considering that 意为“考虑到”，为前半句的评价“remarkable”(了不起)提供背景。\n\n2. 动词时态 had had 是过去完成时，强调“多次耽搁”发生在“成绩了不起”这个过去时间点之前。\n\n3. 【关联点】这个“过去的过去”用法，和我们遇到的“after the race had begun”完全一样，都表示一个更早的过去动作。\n\n4. 【关联点】注意区分表示原因的词：considering that和for后接完整句子，而Because of后只能接名词或代词。"
    },
    {
        "english": "These is no doubt that if she had not lost her rudder she would have won the race easily.",
        "chinese": "毫无疑问，如果中途没有失去舵， “卡帝萨克”号肯定能在比赛中轻易夺冠。",
        "note": "1. 本句是全文的点睛之笔，用“There is no doubt that...”(毫无疑问)引出对过去事实相反的假设，表达强烈的惋惜之情。\n\n2. 核心句型是与过去事实相反的虚拟语气：if从句用过去完成时(had not lost)，主句用would have + 过去分词(would have won)，表示“如果当时(没)...，本会...”。\n\n3. 【关联点】注意区分本句与之前“if she traveled too quickly, this rudder would be torn away”的用法。前者是对已发生的过去做相反假设，后者是推测当时看来未来可能发生的危险。\n\n4. 【关联点】这句话与前文“it was impossible... to win”（不可能取胜）形成强烈对比。一个是残酷的现实，一个是惋惜的假设，为整个故事画上了一个充满遗憾又令人回味的句号。"
    }
]