[
    {
        "english": "We have all experienced days when everything goes wrong.",
        "chinese": "我们大家都有过事事不顺心的日子。",
        "note": "1. 核心词组：go wrong 意为“出错，不顺利”。experienced 是动词，指“经历过”。\n\n2. 句型解析：主句是 We have...days (我们经历过一些日子)。关键在于 when 引导的从句，它像一个形容词，用来具体描述是“什么样的”日子。这里的 have experienced 是现在完成时，强调“已经有过的经历”。\n\n3. 【关联点】短语 go wrong 是本课的核心。之后遇到的 What...things choose to go wrong 和 Things can go wrong on a big scale 都是它的应用，共同描绘“事情变糟”的场景，需重点掌握。"
    },
    {
        "english": "A day may begin well enough, but suddenly everything seems to get out of control.",
        "chinese": "一天开始时，可能还不错，但突然间似乎一切都失去了控制。",
        "note": "1. 核心短语：well enough 意为“相当好”；get out of control 意为“失去控制，失控”，生动描绘了局面急转直下的状态。\n\n2. 句型解析：这是一个由 but 连接的经典转折句，描绘了“开局不错，急转直下”的情景。后半句的 seems to... 句型表示“似乎，看起来”，用来表达一种主观感受或不确定的推测。\n\n3. 【关联点】suddenly (突然地) 强调了事态的突发性，这和我们之后遇到的 She suddenly got into a panic (她突然陷入恐慌) 用法一致。\n\n4. 【关联点】get out of control 是本课核心短语 go wrong (出错) 的一种更具体、更强烈的表达，两者共同构建了“诸事不顺”的主题。"
    },
    {
        "english": "What invariably happens is that a great number of things choose to go wrong at precisely the same moment. It is as if a single unimportant event set up a chain of reactions.",
        "chinese": "情况经常是这样的，许许多多的事情都偏偏赶在同一时刻出问题，好像是一件无关紧要的小事引起了一连串的连锁反应。",
        "note": "1. 核心词汇：invariably (总是) 和 precisely (恰好) 都用于加强语气。set up a chain of reactions 意为“引起一连串连锁反应”。\n\n2. 句型 What... is that... 用来强调“情况总是...”，将重点放在 that 之后的内容上，是一种常见的书面语强调结构。\n\n3. 【关联点】短语 go wrong 再次出现。这里的 choose to go wrong 是一种拟人化说法，生动地表达了事情“偏偏”出错的感觉。\n\n4. 句型 It is as if... 用来打比方或推测，“就好像是...”。【关联点】这和我们之后遇到的 As if this were not enough... 类似，都用于引出假设或想象的情景。\n\n5. 【关联点】a chain of reactions (连锁反应) 这个概念，和之前遇到的 a series of catastrophes (一连串灾难) 意思相近，都描述了由小事引发的一系列坏结果。"
    },
    {
        "english": "Let us suppose that you are preparing a meal and keeping an eye on the baby at the same time.",
        "chinese": "假设你在做饭，同时又在照看孩子。",
        "note": "1. 核心用法：Let us suppose that... 是引出假设的固定句型。keep an eye on 意为“照看，留意”。整个句子用 and 连接了两个并列动作，表示“一边...一边...”。\n\n2. 【关联点】表达“同时”的方式很多。这里的 at the same time 和我们之后遇到的 Meanwhile... (与此同时) 以及 What... at precisely the same moment (恰好在同一时刻) 意思相近。\n\n3. 【关联点】Let us suppose that... (让我们假设) 和我们之前遇到的 It is as if... (就好像是) 都是用来引出假设或想象情景的常用句型。"
    },
    {
        "english": "The telephone rings",
        "chinese": "这时电话铃响了。",
        "note": "1. 核心句型：这是一个极简的“主谓”句型 (S+V)。rings 是动词 ring (发出铃声) 的第三人称单数形式。动词 ring 本身就能完成动作，无需宾语，生动地描绘了一个独立的事件。\n\n2. 【关联点】这个句型用来描述一个简单、独立的动作。这和我们之后遇到的 your husband arrives (你丈夫来了) 和 two cars collided (两车相撞) 类似，都是故事中推动情节的关键小事件。"
    },
    {
        "english": "and this marks the prelude to an unforeseen series of catastrophes.",
        "chinese": "它预示着一连串意想不到的灾难的来临。",
        "note": "1. 核心词汇：marks 意为“标志着，预示着”。prelude 指“序幕，前奏”。unforeseen 由 un-(不) + fore-(预先) + seen(看见) 构成，指“未被预见的”。\n\n2. 【关联点】短语 a series of catastrophes (一连串灾难) 描绘了多米诺骨牌式的后果。这和我们之前遇到的 a chain of reactions (连锁反应) 意思和结构都非常相似，都用来形容由小事引发的一系列坏结果。\n\n3. 【关联点】形容词 unforeseen (意料之外的) 和我们之后会遇到的副词 unexpectedly (意想不到地) 词根相近，都强调了事件的突然和不可预测性。"
    },
    {
        "english": "While you are on the phone, the baby pulls the tablecloth off the table, smashing half your best crockery and cutting himself in the process.",
        "chinese": "就在你接电话时，孩子把桌布从桌子上扯下来，将家中最好的陶瓷餐具半数摔碎，同时也弄伤了他自己。",
        "note": "1. 核心动作：pull...off (扯下) 和 smashing (打碎) 描绘了混乱的场面。crockery 是一个集合名词，指陶瓷餐具。\n\n2. 句型解析：While... 从句设定了时间背景。关键在于 smashing... 和 cutting... 这两个现在分词短语，生动描绘了“扯桌布”的直接后果。【关联点】这种用法和我们之后遇到的 unexpectedly bringing... (意外带来...) 和 holding a large cake (拿着蛋糕) 结构完全相同，都用于补充说明主语的伴随动作或结果。\n\n3. 【关联点】这里的 While (当...时) 用法和之后遇到的 As she was thrown forward... (当她被甩出去时) 中的 As 类似，都用来引出同时发生的事情。"
    },
    {
        "english": "You hang up hurriedly and attend to baby, crockery, etc.",
        "chinese": "你急急忙忙挂上电话，赶去照看孩子和餐具。",
        "note": "1. 核心短语：hang up (挂断电话) 和 attend to (照看，处理)。hurriedly 是副词，意为“匆忙地”，生动描绘了慌乱的状态。\n\n2. 【关联点】这里的 crockery (陶瓷餐具) 正是之前被孩子打碎 (smashing...crockery) 的那些，通过词汇复现将故事情节联系起来。\n\n3. 【关联点】动词短语 attend to (照看) 和我们之前遇到的 keeping an eye on (留意) 意思非常相近，都表示“照料”。\n\n4. 【关联点】副词 hurriedly (匆忙地) 描绘了动作的仓促。这和我们之前遇到的 suddenly (突然地) 作用类似，都用来强调事情发生得很快。"
    },
    {
        "english": "Meanwhile, the meal gets burnt.",
        "chinese": "这时，饭又烧糊了。",
        "note": "1. 核心用法：get burnt 意为“烧糊了”。这里的 get 相当于 become，表示状态的变化，即“变得...”。burnt 是 burn 的过去分词，作形容词用，描述“烧糊的”状态。【关联点】这个用法和我们遇到的 get out of control (失控) 以及 got into a panic (陷入恐慌) 中的 get 完全一致，都是表示状态的转变。\n\n2. 【关联点】Meanwhile (与此同时) 用来连接同时发生的事。这和我们之前遇到的 at the same time 以及 at precisely the same moment 意思相近，都是表达“同时”的常用方式。"
    },
    {
        "english": "As if this were not enough to reduce you to tears, your husband arrives, unexpectedly bringing three guests to dinner.",
        "chinese": "好像这一切还不足以使你急得掉泪，你的丈夫接着回来了，事先没打招呼就带来3个客人吃饭。",
        "note": "1. 核心用法：As if... 意为“好像”，常引导虚拟语气，故用 were。短语 reduce...to tears 意为“使……落泪”，生动描绘了绝望情绪。\n\n2. 【关联点】句型 As if... 和我们之前遇到的 It is as if... 作用相同，都用来引出假设或想象的情景，是表达“就好像”的高级方式。\n\n3. 语法焦点：unexpectedly bringing... 是现在分词短语，补充说明主语“丈夫”回来时伴随的动作。【关联点】这个结构和 smashing... (打碎...) 以及 holding... (拿着...) 的用法完全一致。\n\n4. 【关联点】副词 unexpectedly (意想不到地) 和形容词 unforeseen (未预见的) 词根相近，都强调了“倒霉事”的突发性。"
    },
    {
        "english": "Things can go wrong on a big scale, as a number of people recently discovered in Parramatta, a suburb of Sydney.",
        "chinese": "就像许多人最近在悉尼郊区帕拉马塔发现的那样，有时乱子会闹得很大。",
        "note": "1. 核心用法：go wrong on a big scale 意为“大规模出错”。as 从句引出真实案例佐证主句，意为“正如...”。\n\n2. 【关联点】a number of (许多) 与之前的 a great number of (大量) 用法相似。注意区分：这里的 as 引导事实，而 as if 引导想象。"
    },
    {
        "english": "During the rush hour one evening two cars collided and both drivers began to argue.",
        "chinese": "一天傍晚交通最拥挤时，一辆汽车撞上前面一辆汽车，两个司机争吵起来。",
        "note": "1. 核心词汇：rush hour 指“交通高峰期”。collide 意为“碰撞”，argue 意为“争吵”。\n\n2. 句型解析：这是一个由 and 连接的复合句，描述了两个连续发生的独立事件：“两车相撞”和“司机争吵”。\n\n3. 【关联点】这里的 two cars collided 是一个简洁的“主谓”句型，用来描述一个独立的突发事件。这和我们之前遇到的 The telephone rings (电话响了) 结构和作用都非常相似，都是推动故事情节的关键动作。\n\n4. 【关联点】动词 argue (争吵) 和我们之后遇到的名词 argument (争吵) 是一组词。注意区分：这里是动作本身，而 This led to yet another angry argument. 中则是指争吵这件事。"
    },
    {
        "english": "The woman immediately behind the two cars happened to be a learner.",
        "chinese": "紧跟其后的一辆车上的司机碰巧是个初学者",
        "note": "1. 核心短语：happen to be 意为“碰巧是”，表示偶然发生，非计划之中。learner 指“初学者”。immediately behind 强调“紧紧跟在...后面”。\n\n2. 句型解析：主干是 The woman...happened to be a learner。关键在于主语很长，其中介词短语 immediately behind... 用来修饰 woman，清楚地指明是“哪一个”女人。\n\n3. 【关联点】用短语后置修饰名词的结构很常见。这和我们之后遇到的 the driver following her (跟在她后面的司机) 类似，都是通过在名词后添加描述，来具体说明是“哪一个”人。"
    },
    {
        "english": "She suddenly got into a panic and stopped her car.",
        "chinese": "她一惊之下突然把车停了下来。",
        "note": "1. 核心短语：get into a panic 意为“陷入恐慌”。句子用 and 连接了两个连续的过去式动作 (got... and stopped...)，清晰地描述了因果关系。\n\n2. 【关联点】这里的 got into a panic (陷入恐慌) 延续了 get 表示“状态转变”的用法。这和我们之前遇到的 get out of control (失控) 和 gets burnt (烧糊了) 完全一致。\n\n3. 【关联点】副词 suddenly (突然地) 再次出现，强调事态的突发性。这和我们之前遇到的 suddenly everything seems to get out of control 用法一致。\n\n4. 【关联点】注意区分：这里的 stop her car (停车) 和之后卡车司机 pulled up (刹车) 意思相近，都指让车辆停止，是同义表达。"
    },
    {
        "english": "This made the driver following her brake hard.",
        "chinese": "她这一停使得跟在后头的司机也来个急刹车。",
        "note": "1. 核心句型：This made sb. do sth. 意为“这使得某人做某事”。关键在于使役动词 make 后面直接跟动词原形 brake，不能加 to。短语 brake hard 意为“猛刹车”。\n\n2. 语法焦点：following her 是现在分词作后置定语，用来修饰 driver，说明是“哪一个”司机。【关联点】这和我们之前遇到的 The woman immediately behind the two cars... 类似，都是在名词后补充信息以明确所指。\n\n3. 【关联点】注意区分：这里的 following her 修饰名词，而 smashing... 或 holding... 等分词短语则是补充说明主语的伴随动作或结果。"
    },
    {
        "english": "His wife was sitting beside him holding a large cake.",
        "chinese": "司机妻子正坐在他身边，手里托着块大蛋糕。",
        "note": "1. 句型解析：主句是 His wife was sitting... (他妻子正坐着)。关键在于 holding a large cake 这个现在分词短语，它像一个生动的“补充镜头”，描绘了主语“妻子”在坐着的同时，手里还“拿着”蛋糕的伴随状态。\n\n2. 【关联点】这个“主句 + V-ing”的结构是本课重点。它和我们遇到的 smashing...crockery (打碎餐具) 以及 unexpectedly bringing...guests (意外带来客人) 用法完全相同，都用来描绘伴随的动作或结果。\n\n3. 【关联点】注意区分：这里的 holding... 描述主语的伴随动作，而 the driver following her (跟在她后面的司机) 中的 following... 则像形容词，用来修饰名词 driver，说明是“哪一个”司机。"
    },
    {
        "english": "As she was thrown forward, the cake went right through the windscreen and landed on the road.",
        "chinese": "她往前一冲，蛋糕从挡风玻璃飞了出去掉到马路上。",
        "note": "1. 核心动作：was thrown forward (被向前甩) 使用被动语态，强调动作是发生在她身上，而非她主动发出。蛋糕的动作由两个动词 and 连接：went... and landed...，清晰地描绘了其运动轨迹。\n\n2. 【关联点】句首的 As... (当...时) 用来设定时间背景。这和我们之前遇到的 While you are on the phone... (当你打电话时) 功能完全相同，都用于引出同时发生的另一件事。\n\n3. 【关联点】蛋糕的两个连续动作 went... and landed... 由 and 连接。这和 She... got into a panic and stopped her car (她陷入恐慌并停了车) 的结构一致，都是用 and 连接同一主语的连续动作。"
    },
    {
        "english": "Seeing a cake flying through the air, a lorry driver who was drawing up alongside the car, pulled up all of a sudden.",
        "chinese": "此时，一辆卡车正好从后边开到那辆汽车边上，司机看见一块蛋糕从天而降，紧急刹车。",
        "note": "1. 核心短语：draw up (靠近停下) vs. pull up (紧急刹车)。all of a sudden 意为“突然”。\n\n2. 句型解析：主干是 a lorry driver pulled up。句首的 Seeing... (看见...) 是现在分词短语，作为“触发事件”，生动地解释了司机紧急刹车的原因。\n\n3. 【关联点】pulled up 和我们之前遇到的 stopped her car 意思相近。短语 all of a sudden 和副词 suddenly 意思完全相同。\n\n4. 【关联点】注意区分：句首的 Seeing... 作原因状语，解释“为什么”；而之前句末的 smashing... 或 holding... 则作伴随状语，补充“怎么样”。"
    },
    {
        "english": "The lorry was loaded with empty beer bottles",
        "chinese": "卡车上装着空啤酒瓶。",
        "note": "1. 核心短语：be loaded with 意为“装满了...”，用来描绘某个容器或车辆被装满的状态。\n\n2. 句型解析：这是一个被动语态 (was loaded)，表示卡车“被”装载。介词 with 引出装载的具体内容。【关联点】这和我们之后遇到的 As she was thrown forward (她被向前甩) 结构类似，都用“be + 过去分词”表示主语承受了某个动作。\n\n3. 【关联点】这里的 lorry (卡车) 和 empty beer bottles (空啤酒瓶) 在后面的故事中会再次出现：卡车司机会刹车 (a lorry driver... pulled up)，而这些瓶子会从车上滑落并摔碎 (hundreds of broken bottles)。"
    },
    {
        "english": "and hundreds of them slid off the back of the vehicle and on to the road.",
        "chinese": "成百只瓶子顺势从卡车后面滑出车外落在马路上。",
        "note": "1. 核心短语：slid off... and on to... (从...滑落到...)，展示了物体“从A到B”的完整运动轨迹。them 指代前文的 empty beer bottles。\n\n2. 【关联点】这个用 and 连接连续动作来描绘运动轨迹的句式，和我们之前遇到的 the cake went... and landed... 结构完全相同。"
    },
    {
        "english": "This led to yet another angry argument.",
        "chinese": "这又引起一场唇枪舌剑的争吵。",
        "note": "1. 核心短语：led to 意为“导致”，是 lead to 的过去式。yet another 意为“又一个”，强调事情再三发生，常带不耐烦语气。argument 是名词，指“争吵”这件事。\n\n2. 【关联点】注意区分名词 argument (争吵) 和我们之前遇到的动词 argue (争吵)。前者指争吵这件事，后者指争吵这个动作。\n\n3. 【关联点】这里的 led to (导致) 是表达因果关系的核心。这和我们遇到的 set up a chain of reactions (引起连锁反应) 和 This made the driver... (这使得司机...) 功能类似，都是连接原因与结果。"
    },
    {
        "english": "Meanwhile, the traffic piled up behind.",
        "chinese": "与此同时，后面的车辆排成了长龙",
        "note": "1. 核心短语：pile up 意为“堆积”，在此特指车辆因堵塞而“排起长龙”。注意 traffic (交通) 是不可数名词，没有复数形式。\n\n2. 【关联点】Meanwhile (与此同时) 用来连接同时发生的事。这和我们之后遇到的 In the meantime 意思和用法几乎完全相同，都是引出另一条故事线的常用词。\n\n3. 【关联点】这个句子 The traffic piled up 是一个简洁的“主谓”句型。这和我们之前遇到的 two cars collided (两车相撞) 类似，都是用来描述一个独立的事件。"
    },
    {
        "english": "It took the police nearly an hour to get the traffic on the move again.",
        "chinese": "警察花了将近一个小时才使车辆又开起来。",
        "note": "1. 核心句型：It takes sb. time to do sth. 意为“做某事花了某人多长时间”。It 是形式主语，真正指代的是后面的 to get... 这件事。\n2. 核心短语：get... on the move 意为“使...移动起来”。【关联点】这里的 get 意为“使...”，功能上和 This made the driver... (这使得司机...) 中的 make 类似。\n3. 【关联点】注意区分 get 的用法：这里是“使...”，而在 get out of control (失控) 中是“变得...”。同时，traffic 正是前面 piled up (排起长龙) 的车辆，情节紧密相连。"
    },
    {
        "english": "In the meantime, the lorry driver had to sweep up hundreds of broken bottles.",
        "chinese": "在这段时间里，卡车司机不得不清扫那几百只破瓶子。",
        "note": "1. 核心短语：had to (不得不)，sweep up (扫干净)。broken 是动词 break 的过去分词，作形容词用。\n\n2. 【关联点】In the meantime 与我们遇到的 Meanwhile 意思相同。这些 broken bottles 正是之前从卡车滑落的空瓶，情节紧密相连。"
    },
    {
        "english": "Only two stray dogs benefited from all this confusion, for they greedily devoured what was left of the cake.",
        "chinese": "只有两只野狗从这一片混乱中得到好处，它们贪婪地吃掉了剩下的蛋糕。",
        "note": "1. 核心词汇：benefit from (从中受益)。devour 意为“狼吞虎咽”，是 eat 的生动升级版。greedily (贪婪地) 描绘了吃相。\n\n2. 句型解析：这是一个由 for 连接的复合句，for 在此意为“因为”，后半句解释前半句的原因。what was left of the cake 是一个名词性从句，作 devour 的宾语。\n\n3. 【关联点】这和我们之前遇到的 What invariably happens is... 类似，都是由 what 引导的名词性从句，但前者作宾语，后者作主语。\n\n4. 【关联点】情节上，狗吃掉的正是之前从车里飞出的蛋糕 (the cake went right through the windscreen)，在一连串的混乱 (a series of catastrophes) 中，它们是唯一的受益者。"
    },
    {
        "english": "It was just one of those days!",
        "chinese": "这就是事事不顺心的那么一天！",
        "note": "1. 核心短语：one of those days 是一个固定口语表达，指“诸事不顺的一天”。just 在此加强语气，表达一种“偏偏就是这种倒霉日子”的无奈感。\n\n2. 【关联点】这句话是本课主题“a day when everything goes wrong”最地道的口头总结。它与开篇的客观描述不同，是亲历了一连串倒霉事（a series of catastrophes）后，发出的个人感叹。"
    }
]