[
    {
        "english": "We often read in novels how a seemingly respectable person or family has some terrible secret which has been concealed from strangers for years.",
        "chinese": "在小说中， 我们经常读到一个表面上受人尊重的人物或家庭， 却有着某种多年不为人所知的骇人听闻的秘密。",
        "note": "1. 核心词汇：seemingly (adv.) 表面上地；respectable (adj.) 体面的；conceal (v.) 隐藏，常与from连用，表示“向...隐瞒”。\n\n2. 句型解析：这是一个复合句，结构为“主句 + how引导的宾语从句 + which引导的定语从句”。\n\n3. 主句是 We read in novels，how从句解释“读到什么内容”，which从句则用来修饰前面的名词secret。\n\n4. 【关联点】which引导的定语从句修饰secret。这和我们之后遇到的“weekend which I shall never forget”及“secrets which we do not want...to learn”用法完全相同。\n\n5. 【关联点】这里的secret has been concealed (秘密被隐藏)，与之后“the terrible secret becomes known (秘密被揭露)”形成鲜明对比。"
    },
    {
        "english": "The English language possesses a vivid saying to describe this sort of situation.",
        "chinese": "英语中有一个生动的说法来形容这种情况。",
        "note": "1. 核心词汇：possesses 是比 have 更正式的“拥有”；vivid saying 指“生动的说法”；describe 意为“描述”。\n\n2. 【关联点】possesses 是 have 的高级用法。这和我们之前遇到的 a family has a secret, we all have secrets 等句中的 have 意思相同，但语气更正式。\n\n3. 句型解析：主干是“主谓宾”结构，即 language possesses a saying。“to describe...”是不定式短语，作后置定语，用来修饰前面的名词 saying，说明这个“说法”的用途是什么。\n\n4. 【关联点】本句引出了全文的核心——那个“生动的说法”就是我们后面反复提到的 a skeleton in the cupboard。"
    },
    {
        "english": "The terrible secret is called 'a skeleton in the cupboard'.",
        "chinese": "惊人的秘密称作“柜中骷髅”。",
        "note": "1. 核心短语: is called 意为“被称作”，是一个被动语态结构，用来给主语下定义或命名。\n\n2. 句型解析: 这是一个主谓表 (S+V+P) 结构。主语 The terrible secret，表语 a skeleton in the cupboard，通过系动词 is 连接，清楚地解释了“秘密是什么”。\n\n3. 【关联点】这句话直接揭晓了上一句中提到的 a vivid saying (生动的说法) 的具体内容，将抽象概念与实际短语联系起来。\n\n4. 【关联点】注意 is called 这种被动用法。这和我们遇到的 has been concealed (被隐藏) 和 a reputation is ruined (声誉被毁) 类似，都使用了“be + 动词过去分词”的形式。"
    },
    {
        "english": "At some dramatic moment in the story, the terrible secret becomes known and a reputation is ruined.",
        "chinese": "在小说的某个戏剧性时刻， 可怕的秘密泄漏出来， 接着便是某人的声誉扫地。",
        "note": "1. 核心短语：becomes known 意为“变得为人所知”，强调状态变化；is ruined 意为“被毁掉”，是被动语态，强调声誉是“被”外力摧毁的。\n\n2. 句型解析：句子由 and 连接两个接连发生的事件。前句用“主语+become+表语”结构，后句用被动语态，生动地描绘出秘密泄露后的连锁反应。\n\n3. 【关联点】这里的 the secret becomes known (秘密被揭露) 与我们开篇遇到的 secret which has been concealed (秘密被隐藏) 形成强烈的戏剧性对比。\n\n4. 【关联点】注意 is ruined 这个被动用法。这和我们遇到的 has been concealed (被隐藏) 和 is called (被称作) 结构类似，都是“be + 动词过去分词”的形式。\n\n5. 【关联点】becomes known 中的 become 表示“变得”。这和之后 he became a successful writer (他成为了一名作家) 的用法一致，都表示一种转变。"
    },
    {
        "english": "The reader's hair stands on end when he reads in the final pages of the novel that the heroine a dear old lady who had always been so kind to everybody, had, in her youth, poisoned every one of her five husbands.",
        "chinese": "当读者到小说最后几页了解到书中女主人公，那位一向待大家很好的可爱的老妇人年轻时一连毒死了她的5个丈夫时，不禁会毛骨悚然。",
        "note": "1. 核心短语：stands on end 意为“（头发）竖起来”，生动地表达了极度恐惧，即“毛骨悚然”。heroine 指“女主人公”，poisoned 意为“毒死”。\n\n2. 句型解析：这是一个典型的长句，主干是 The reader's hair stands on end。when从句解释了“何时”毛骨悚然，that从句则揭示了“读到的”惊人内容。中间对女主人公的善良描述，与她毒死丈夫的行为形成巨大反差，增强了戏剧性。\n\n3. 【关联点】本句是全文核心概念 a terrible secret 或 a skeleton in the cupboard 的一个绝佳范例，将抽象概念具体化。\n\n4. 【关联点】注意 in her youth (在她年轻时) 这个表达。这和我们之前遇到的 George studied medicine in his youth (乔治年轻时学医) 用法完全相同。\n\n5. 【关联点】动词 had poisoned 使用了过去完成时，表示“毒死”这个动作发生在读者“读到”之前。这和我们之前遇到的 After I had stacked my shirts... (在我放好衬衫后...) 的时态用法逻辑一致。"
    },
    {
        "english": "It is all very well for such things to occur in fiction.",
        "chinese": "这种事发生在小说中是无可非议的。",
        "note": "1. 核心短语：all very well 意为“无可厚非”，但常暗示后面有转折，表示“虽然可以，但是...”。occur 是 happen 更正式的说法。\n\n2. 句型解析：这是一个经典的“It is + 形容词 + for sb. to do sth.”句型。这里的 It 是个“占位符”，真正想说的事情是后面的 for...to... 部分。\n\n3. 【关联点】本句是对开篇第一句 “We often read in novels...” 的评论。它指出，小说(fiction/novels)里发生离奇之事是可以接受的，将虚构与现实区分开来。\n\n4. 【关联点】注意 for...to occur 这个不定式结构。这和我们之后遇到的 tell someone to unpack, decide to hang, dash to tell 等用法类似，都是“to do”不定式的不同应用，贯穿全文。"
    },
    {
        "english": "To varying degrees, we all have secrets which we do not want even our closest friends to learn, but few of us have skeletons in the cupboard.",
        "chinese": "尽管我们人人都有各种大小秘密。 连最亲密的朋友都不愿让他们知道， 但我们当中极少有人有柜中骷髅。",
        "note": "1. 核心短语：To varying degrees 意为“不同程度地”；few of us 指“我们中很少有人”，表否定；skeletons in the cupboard 指“家丑，重大秘密”。\n\n2. 句型解析：句子用 but 连接，对比了人人都有的普通 secrets 和极少数人才有的 skeletons in the cupboard (家丑)，点明了秘密的程度差异。\n\n3. 【关联点】本句是全文核心概念的深化。它明确区分了普通的 secret 和前文提到的 a skeleton in the cupboard，前者普遍，后者严重且罕见。\n\n4. 【关联点】secrets which...to learn 是定语从句。这和我们开篇遇到的 secret which has been concealed... 用法完全相同，都是用来修饰名词 secret。\n\n5. 【关联点】句中的 have secrets 与之前 a family has a secret 用法一致。注意与 The English language possesses a saying 区分，possess 是 have 更正式的说法。"
    },
    {
        "english": "The only person I know who has a skeleton in the cupboard is George Carlton, and he is very pound of the fact.",
        "chinese": "我所认识的唯一的在柜中藏骷嵝的人便是乔治.卡尔顿， 他甚至引以为自豪。",
        "note": "1. 核心短语：skeleton in the cupboard 指“家丑，不可告人的秘密”；be proud of 意为“以此为荣”。\n\n2. 【关联点】这正是对之前“few of us have skeletons in the cupboard”的具体呼应，点明了乔治就是那“少数人”之一。\n\n3. 【关联点】注意乔治对秘密的态度是 proud of (引以为荣)，这与常人想 conceal (隐藏) 秘密的态度，以及作者看到骷髅时 petrified (惊呆) 的反应形成强烈反差。\n\n4. 句型解析：主语 The only person 被 I know 和 who has... 两个定语从句修饰，导致主语很长。这和我们遇到的 secret which... 和 weekend which... 的修饰方法类似。\n\n5. 句末的 the fact 指代的就是“乔治有不可告人的秘密”这件事，避免了重复。"
    },
    {
        "english": "George studied medicine in his youth.",
        "chinese": "乔治年轻时学过医，",
        "note": "1. 句型解析：这是一个简单的主谓宾句型，描述了乔治过去的一段经历。核心短语是 studied medicine (学医) 和 in his youth (在他年轻时)。\n\n2. 【关联点】注意 in his youth 这个时间短语。这和我们之前遇到的女主人公 in her youth 毒死丈夫的用法完全相同，都表示“在...年轻时”。\n\n3. 【关联点】本句是理解全文的关键线索。乔治学过医 (studied medicine)，这直接解释了为什么他后来会有一个真正的骷髅，并说出“我曾是个医学生”这样的话。\n\n4. 【关联点】这句话也为后文的转折埋下伏笔。他年轻时学医，但后来却“Instead of becoming a doctor... became a writer”（没有成为医生，反而成了作家），形成对比。"
    },
    {
        "english": "Instead of becoming a doctor, however, he became a successful writer of detective stories.",
        "chinese": "然而，他后来没当上医生， 却成了一位成功的侦探小说作家。",
        "note": "1. 核心短语：Instead of... 意为“而不是...”，引出未被选择的选项。become 意为“成为”，表示身份或状态的转变。\n\n2. 句型解析：主干是主谓表结构 he became a writer。“Instead of...”部分作为状语，与主句形成对比，强调了职业选择的转折。\n\n3. 【关联点】本句直接呼应了前文“George studied medicine in his youth”。“学医”与“没当医生”形成鲜明对比，揭示了乔治人生的转折。\n\n4. 【关联点】这里的 became (成为) 与我们之前遇到的 the secret becomes known (秘密变得为人所知) 用法一致，都表示一种状态的转变。\n\n5. 【关联点】注意 however (然而) 的转折作用。这和我们遇到的 but (但是) 类似，都用来引出与前文相反或不同的情况。"
    },
    {
        "english": "I once spend an uncomfortable weekend which I shall never forget at his house.",
        "chinese": "有一次，我在他家里度周末， 过得很不愉快。这事我永远不会忘记。",
        "note": "1. 句型解析：主句是 I spent an uncomfortable weekend...，后面的 which I shall never forget 是一个定语从句，像一个“标签”，用来修饰和补充说明前面的 weekend。注意动词 spend 的过去式是 spent。\n\n2. 【关联点】这里的 which 用法，和我们开篇遇到的 secret which has been concealed 以及 secrets which we do not want...to learn 完全相同，都是用来修饰前面的名词。\n\n3. 【关联点】注意词缀 un- 表示“不”。这里的 uncomfortable (不舒服的) 与之后 George was unsympathetic (无动于衷的) 类似，un- 都起到了否定作用。\n\n4. 句中的 shall never forget 比 will never forget 语气更强，带有“绝不会忘”的决心。"
    },
    {
        "english": "George showed me to the guestroom which, he said, was rarely used.",
        "chinese": "乔治把我领进客房，说这间很少使用。",
        "note": "1. 句型解析：主句是 George showed me to the guestroom (乔治领我到客房)。which, he said, was rarely used 是一个定语从句，用来修饰 guestroom。\n\n2. 核心结构：注意 he said 是一个插入语，插在关系代词 which 和其谓语 was 中间，用来表明“很少使用”是乔治说的话，而非作者的陈述。\n\n3. 【关联点】which引导的定语从句。这和我们遇到的 secret which..., weekend which... 等用法完全相同，都是用来修饰前面的名词。\n\n4. 【关联点】注意被动语态 was rarely used (很少被使用)。这和我们遇到的 has been concealed (被隐藏), is ruined (被毁掉) 等结构类似，都是“be+动词过去分词”的形式。"
    },
    {
        "english": "He told me to unpack my things and then come down to dinner.",
        "chinese": "他让我打开行装后下楼吃饭。",
        "note": "1. 核心句型: tell sb. to do sth. (让某人做某事)。这是一个“主谓宾补”(S+V+O+C)结构，to unpack... and come down... 是宾语补足语，说明了“我”被要求做的两件事。\n\n2. 词汇技巧: unpack (打开行李) 是 pack (打包) 的反义词。前缀 un- 表示“反向”或“不”。【关联点】这和我们之前遇到的 uncomfortable (不舒服的) 和 unsympathetic (无动于衷的) 中的 un- 用法一致。\n\n3. 结构解析: and then 连接了 unpack 和 come down 两个连续的动作，注意第二个动词 come 前省略了 to，使句子更简洁。\n\n4. 【关联点】tell me to unpack 这个“主语+动词+宾语+宾补”的结构，和我们遇到的 want friends to learn (想让朋友知道) 以及 made it sway (使它摇晃) 类似，都表达“让/使某人/某物做某事”。"
    },
    {
        "english": "After I had stacked my shirts and underclothes in two empty drawers, I decided to hang one of the tow suits I had brought with me in the cupboard.",
        "chinese": "我将衬衫、内衣放进两个空抽屉里， 然后我想把随身带来的两套西服中的一套挂到大衣柜里去。",
        "note": "1. 句型解析：句子通过时间状语从句 After I had stacked... 交代背景，主句 I decided to hang... 叙述主要动作。\n\n2. 【关联点】过去完成时 had stacked 表示“堆放”发生在“决定”之前。这和我们遇到的女主人公 had poisoned her husbands (在读者读到之前就已毒死) 的时态逻辑完全一致。\n\n3. 【关联点】cupboard (衣柜) 是本文的关键场景词。这和我们反复遇到的习语 a skeleton in the cupboard (柜中骷髅) 以及之后作者 I opened the cupboard door 的场景直接关联。\n\n4. 【关联点】decide to hang (决定去挂) 是不定式作宾语。这和我们遇到的 tell sb. to unpack (宾补), dash to tell (目的状语) 等用法类似，都是“to do”不定式的不同应用。\n\n5. 【关联点】注意 a suit I had brought... 是省略了关系代词 which/that 的定语从句。这和我们遇到的 secret which..., weekend which... 等用法作用相同，但形式更简洁。"
    },
    {
        "english": "I opened the cupboard door and then stood in front of it petrified.",
        "chinese": "我打开柜门，站在柜门前一下惊呆了。",
        "note": "1. 核心词汇：petrified (adj.) 惊呆的，吓得像石头一样动不了。这个词生动地描绘了极度恐惧或震惊的状态。\n\n2. 句型解析：and then 连接了“打开”和“站立”两个连续动作。关键在于 stood... petrified，形容词 petrified 用来补充说明主语 I 当时的状态，生动描绘了惊恐的瞬间。\n\n3. 【关联点】cupboard (衣柜) 是故事高潮的关键场景。这和我们之前遇到的 decide to hang... in the cupboard 以及全文核心 a skeleton in the cupboard 紧密相连。\n\n4. 【关联点】作者的反应 petrified (惊呆了)，与乔治的 unsympathetic (无动于衷) 和 proud of (引以为荣) 形成强烈对比，凸显了戏剧冲突。\n\n5. 【关联点】and then 连接连续动作的用法，和我们之前遇到的 unpack my things and then come down to dinner 结构类似。"
    },
    {
        "english": "A skeleton was dangling before my eyes. The sudden movement of the door made it sway slightly and it gave me the impression that it was about to leap out at me.",
        "chinese": "一具骷髅悬挂在眼前，由于柜门突然打开，它也随之轻微摇晃起来， 让我觉得它好像马上要跳出柜门朝我扑过来似的。",
        "note": "1. 核心词汇: dangle (悬挂), sway (摇摆), leap out at (扑向)。这三个动词生动地描绘了骷髅从静止到摇晃，再到仿佛要扑出的动态过程，极具画面感。\n\n2. 句型解析1: The movement made it sway (移动使它摇晃) 是“make + 宾语 + 动词原形”结构，表示“使...做...”。【关联点】这和我们之前遇到的 tell me to unpack (让某人做某事) 结构类似，都表达“使/让某人做某事”。\n\n3. 句型解析2: gave me the impression that... (给我...的印象) 是“give + 间接宾语 + 直接宾语”结构。that从句具体解释了 impression (印象) 的内容。\n\n4. 【关联点】这是故事的高潮。作者以为的 a skeleton in the cupboard (家丑) 竟然是 a real skeleton (真骷髅)，这种反差造成了极大的惊吓，直接导致他后面 petrified (惊呆了)。"
    },
    {
        "english": "Dropping my suit, I dashed downstairs to tell George.",
        "chinese": "我扔下西服冲下楼去告诉乔治。",
        "note": "1. 核心词汇：drop (扔下)，dash (猛冲)。两个动词生动描绘出人物急切、连贯的动作，画面感十足。\n\n2. 句型解析：这是一个由三部分构成的生动画面。“Dropping my suit”是伴随动作，“I dashed downstairs”是主干，“to tell George”则说明了猛冲的目的。\n\n3. 【关联点】这里的 to tell George (为了告诉乔治) 是不定式作目的状语。这和我们之前遇到的 a vivid saying to describe... (用来描述...的说法) 用法类似，都解释了“为了什么”。\n\n4. 【关联点】动词 dash (猛冲) 表现了极度的慌张。这正是对我之前看到骷髅后 petrified (惊呆了) 的反应的延续。注意区分 dash downstairs (冲下楼) 和 come down to dinner (下楼吃饭) 在语气上的强烈差异。"
    },
    {
        "english": "This was worse than \"a terrible secret'; this was a read skeleton!",
        "chinese": "这是比“骇人听闻的秘密”更加惊人的东西， 这是一具真正的骷髅啊！",
        "note": "1. 核心解析：这句话是故事的点睛之笔。它用worse than (比...更糟)这个比较结构，强调了现实远比想象更惊悚，将抽象的“秘密”升级为具体的“骷髅”。\n\n2. 【关联点】这直接呼应了全文的核心概念 a skeleton in the cupboard (家丑)。作者本以为这是个比喻，结果发现是字面意思上的 a real skeleton，戏剧冲突达到顶峰。\n\n3. 【关联点】注意 a terrible secret 这个短语。它在文中多次出现，而本句通过对比，最终揭示了这个秘密的惊人真相，与之前的铺垫形成强烈反差。\n\n4. 句型解析：句子由分号 (;) 连接两个主谓表结构。后半句 “this was a real skeleton!” 是对前半句的解释和升级，极大地增强了句子的冲击力。"
    },
    {
        "english": "But George was unsympathetic.",
        "chinese": "但乔治却无动于衷。",
        "note": "1. 句型解析：这是一个主谓表 (S+V+P) 结构，用形容词 unsympathetic (无动于衷的) 来描述主语 George 的状态。句首的 But 表示与作者的惊恐反应形成转折。\n\n2. 【关联点】词缀 un- 表示“不”。这和我们之前遇到的 uncomfortable (不舒服的) 和 unpack (打开行李，pack的反向动作) 中的 un- 用法一致。\n\n3. 【关联点】乔治的态度 unsympathetic (无动于衷)，与作者的反应 petrified (惊呆了) 形成强烈对比，也呼应了他对这个秘密 proud of (引以为荣) 的反常态度。"
    },
    {
        "english": "'Oh, that,' he said with a smile as if he were talking about an old friend.",
        "chinese": "“噢，是它呀！他笑着说道，俨然在谈论一位老朋友。",
        "note": "1. 核心短语: as if 意为“仿佛”，用来引出一个虚拟或不真实的情景，生动地描绘了说话者的神态。\n\n2. 语法要点: as if 从句中常用 were 代替 was (即使主语是单数he)，来表示虚拟语气，强调“好像是，但其实不是”。\n\n3. 【关联点】注意他谈论骷髅时 with a smile (带着微笑) 的态度。这与他之前的 unsympathetic (无动于衷) 一致，并与作者的 petrified (惊呆了) 形成强烈对比。"
    },
    {
        "english": "'That's Sebastian.",
        "chinese": "“那是塞巴斯蒂安。",
        "note": "1. 句型解析：这是一个主谓表 (S+V+P) 结构。That's 是 That is 的缩写，用来直接介绍“那是谁”。主语是 That，表语是人名 Sebastian。\n\n2. 【关联点】这个“主语+系动词+表语”的结构非常常见。这和我们之后遇到的 The terrible secret is called... 以及 George was unsympathetic 等句子类似，都是用来描述主语的身份或状态。"
    },
    {
        "english": "You forget that I was a medical student once upon a time.'",
        "chinese": "你忘了我以前是学医的了。”",
        "note": "1. 核心短语: once upon a time 意为“很久以前”，常用于讲故事的开头，这里用来轻松地指代“过去的一段时光”。\n\n2. 句型解析: 这是一个“主句 + that引导的宾语从句”结构。主句用现在时(forget)，从句用过去时(was)，清晰地表达了“你现在忘了我过去曾是...”这个意思。\n\n3. 【关联点】这句话是全文的“谜底”。它直接解释了为什么乔治家里有骷髅(skeleton)，也回应了他之前“studied medicine”(学过医)的背景。\n\n4. 【关联点】这里的 once upon a time (很久以前) 与我们之前遇到的 in his youth (在他年轻时) 意思相近，但语气更口语化，带点讲故事的感觉。"
    }
]