[
    {
        "english": "The salvage operation had been a complete failure.",
        "chinese": "打捞工作彻底失败了。",
        "note": "1. 核心短语: salvage operation (打捞作业) 和 a complete failure (一次彻底的失败)。salvage 在这里是名词。\n\n2. 【关联点】这里的 salvage 是名词。注意，后面我们会遇到它的动词用法: ...ordered his men to salvage... (命令船员去打捞)。同一个词，词性不同。\n\n3. 句型为“主谓表”，关键在于时态 had been (过去完成时)，表示在故事的过去时间点之前，失败“已经”发生了。这和我们遇到的 had been searching, had been received 等类似，都表示“过去的过去”，是本课重点。"
    },
    {
        "english": "The small ship, Elkor, which had been searching the Barents Sea for weeks, was on its way home.",
        "chinese": "小船“埃尔科”号在巴伦支海搜寻了几个星期之后， 正在返航途中。",
        "note": "1. 核心结构: 主句 The ship... was on its way home 被一个定语从句 which... 分隔开，用来补充说明这艘船之前在做什么。\n\n2. 时态是关键。从句用 had been searching (过去完成进行时)，表示“搜寻”发生在主句“返航”(was) 之前并持续了一段时间。【关联点】这和我们遇到的 had been a failure, had been received 等用法一致，都是本课重点，表示“过去的过去”。\n\n3.【关联点】这里的 searching 是动词。注意区分后面遇到的 ...give up the search，其中 search 是名词。同一个词，词性不同。"
    },
    {
        "english": "A radio message from the mainland had been received by the ship's captain instructing him to give up the search.",
        "chinese": "返航前，该船船长收到了大陆发来的电报，指示他们放弃这次搜寻。",
        "note": "1. 核心结构为“一封电报被收到”，主语 message 是动作的承受者，故用被动语态。句尾的 instructing... 是现在分词短语，作后置定语，补充说明电报的内容，比 which instructed... 更简洁。\n\n2. 【关联点】时态 had been received 是过去完成时。这和我们之前遇到的 had been a failure, had been searching 一样，是本课反复出现的重点，表示“过去的过去”。\n\n3. 【关联点】注意区分词性。这里的 the search 是名词“搜寻”，而之前遇到的 had been searching 中，searching 是动词。"
    },
    {
        "english": "The captain knew that another attempt would be made later, for the sunken ship he was trying to find had been carrying a precious cargo of gold bullion.",
        "chinese": "船长知道日后还会再作尝试，因为他试图寻找的沉船上载有一批珍贵的金条。",
        "note": "1. 核心结构: 主句 The captain knew... 后接 that 宾语从句。for 在此引导原因状语从句，相当于 because。其中 he was trying to find 是修饰 ship 的定语从句，省略了 which。\n\n2. 【关联点】时态 had been carrying 是过去完成进行时。这和我们遇到的 had been searching 类似，都表示在过去某个时间点之前持续发生的动作，是本课重点。\n\n3. 【关联点】sunken 是形容词“沉没的”。注意区分后面遇到的 a ship which had been sunk...，其中 sunk 是动词 sink 的过去分词，用法不同但意思相近。\n\n4. 【关联点】名词 attempt (尝试) 和我们之前遇到的动词 try (...decided to try once more) 意思相关，可以一起记忆。"
    },
    {
        "english": "Despite the message, the captain of the Elkor decided to try once more.",
        "chinese": "尽管船长接了电报， 他还是决定再试一试。",
        "note": "1. 核心词 Despite (尽管) 是介词，后接名词，表达与前文信息的转折。这里的 the message 指的就是那封让他放弃搜寻的电报。\n\n2. 【关联点】这里的动词 try (尝试) 和我们之前遇到的名词 attempt 意思相近，可以一起记忆。"
    },
    {
        "english": "The sea bed was scoured with powerful nets and there was tremendous excitement on board went a chest was raised from the bottom.",
        "chinese": "他们用结实的网把海床搜索了一遍。 当一只箱子从海底被打捞上来时， 甲板上人们激动不已。",
        "note": "1. 本句由 and 连接两个分句，描述了“搜索海床”和“打捞上箱子后人们很激动”两个场景。注意原句中的 went 为 when 的笔误。\n\n2. 核心语法是被动语态。was scoured (被搜索) 和 was raised (被打捞上来) 都强调主语是动作的承受者，而非发出者。\n\n3. 【关联点】被动语态是本课核心。这和我们遇到的 had been received (被收到)、was torpedoed (被攻击) 等类似，都强调主语“被”怎么样，只是时态不同。\n\n4. 【关联点】there was... 句型表示“有……”。这和我们后面遇到的 ...there was an unfinished letter... (有一封未完成的信) 用法完全相同，都用于引出新事物。"
    },
    {
        "english": "Though the crew were at first under the impression that the lost ship had been found, the contents of the chest proved them wrong.",
        "chinese": "船员们开始认为沉船找着了， 但海底沉箱内的物品证明他们弄错了。",
        "note": "1. 核心结构: Though... (虽然) 引导一个转折，与主句形成对比。关键短语 under the impression that... (原以为...) 和 proved them wrong (证明他们错了) 恰好体现了这种期望与现实的反差。\n\n2. 【关联点】时态 had been found (过去完成时被动语态) 是本课重点。这和我们遇到的 had been received, had been carrying 等用法一致，都表示动作发生在过去某个时间点之前(过去的过去)。\n\n3. 【关联点】动词 prove 的用法值得注意。这里的 prove them wrong (证明某人是错的) 和后面遇到的 proved to be of great interest (证明是很有趣的) 结构不同，但都是“证明”之意，可以一起记忆。"
    },
    {
        "english": "What they had in fact found was a ship which had been sunk many years before.",
        "chinese": "事实上， 他们发现的是另一艘沉没多年的船 。",
        "note": "1. 核心结构: What... 引导的主语从句 + was + 表语。它清晰地说明了“他们发现的东西是什么”。整个句子的主语是 What they had in fact found 这个从句。\n\n2. 【关联点】时态是本课重点: had been sunk (过去完成时被动语态)。这和我们遇到的 had been received, had been found 等用法一致，都表示动作发生在“发现”(found)这个动作之前，即“过去的过去”。\n\n3. 【关联点】注意区分 sunk 和 sunken。这里的 sunk 是动词 sink 的过去分词，用于被动语态。而我们之前遇到的 sunken ship 中，sunken 是一个纯粹的形容词，意为“沉没的”。"
    },
    {
        "english": "The chest contained the personal belongings of a seaman, Alan Fielding.",
        "chinese": "木箱内装有水手艾伦.菲尔丁的私人财物，",
        "note": "1. 核心动词 contained (装有) 点明了箱内物品 personal belongings (私人财物)。句尾的 Alan Fielding 是 a seaman 的同位语，用来补充说明水手的名字。\n\n2. 【关联点】注意区分 contained 和我们之前遇到的 had been carrying。contain 强调静态的“包含”，而 carry 强调动态的“运载”。\n\n3. 【关联点】personal belongings 这个词组很重要，我们很快会在...belongings of a ship's officer...中再次遇到它，可以加深记忆。"
    },
    {
        "english": "There were books, clothing and photographs, together with letters which the seaman had once received from his wife.",
        "chinese": "其中有书箱、衣服、照片以及水手收到的妻子的来信。",
        "note": "1. 核心结构: There were... 用于引出存在的物品，列举了书、衣服和照片。together with 的作用类似 and，引出清单的最后一项“信件”。【关联点】这和我们遇到的 there was tremendous excitement... 和 there was an unfinished letter... 用法完全相同。\n\n2. 核心语法: which... 引导定语从句，用来修饰前面的 letters，说明是“水手曾收到的”信件。【关联点】这种“名词+which从句”的修饰结构是本课重点，和 a ship which had been sunk... 等用法一致。\n\n3. 时态是关键: had once received 是过去完成时，表示“收到信”发生在故事主要时间（发现物品）之前。【关联点】这是本课反复出现的重点时态，和 had been received, had been found 等用法一致，都表示“过去的过去”。\n\n4. 【关联点】动词 receive (收到) 在 A radio message...had been received 中以被动形式出现。名词 seaman (水手) 在 ...belongings of a seaman... 中再次出现，加深记忆。"
    },
    {
        "english": "The captain of the Elkor ordered his men to salvage as much as possible from the wreck.",
        "chinese": "“埃尔科”号船长命令船员们尽量从沉船中打捞物品，",
        "note": "1. 核心句型是“order sb to do sth”(命令某人做某事)，即“主谓宾补”结构，说明了船长命令船员去做的具体内容。\n\n2. 【关联点】这里的 salvage 是动词“打捞”。这和我们开篇遇到的 The salvage operation... 中的名词 salvage (打捞作业) 形成对比，注意词性变化。\n\n3. 【关联点】这个句型和我们之前遇到的 ...instructing him to give up the search (指示他放弃搜寻) 类似，都是“动词+宾语+to do”结构，用于下达指令。\n\n4. 核心词汇 wreck 指“沉船残骸”。【关联点】这和我们之前遇到的 sunken ship (沉船) 意思相近，可以一起记忆。"
    },
    {
        "english": "Nothing of value was found, but the numerous items which were brought to the surface proved to be of great interest.",
        "chinese": "但没发现什么值钱的东西， 不过打捞出来的众多的物品还是引起了大家极大的兴趣。",
        "note": "1. 核心短语 of value (有价值的) 和 of great interest (很有趣的)。它们都使用“of + 名词”结构，表示“具有某种性质”，非常简洁地充当了形容词的作用。\n\n2. 【关联点】动词 prove 在此以 prove to be... (证明是...) 的形式出现。这和我们之前遇到的 prove them wrong (证明他们错了) 用法不同，但都表示“证明”，可以对比记忆。\n\n3. 本句用 but 连接前后转折。后半句的主语是 items，由 which were brought to the surface (被打捞上来的) 这个定语从句修饰。【关联点】这里的被动语态和 which 从句都是本课反复出现的重点，和 a ship which had been sunk... 等类似。"
    },
    {
        "english": "From a heavy gun that was raised, the captain realized that the ship must have been a cruiser.",
        "chinese": "从捞起的一门大炮来看， 船长认为那艘船一定是艘巡洋舰。",
        "note": "1. 核心短语 must have been 表示对过去的确定性推测，意为“当时一定是”。这是船长基于大炮这个线索得出的结论。\n\n2. 句首 From... 指明了判断的依据。其中 that was raised 是一个定语从句，修饰 gun。【关联点】这里的 was raised (被捞起) 是被动语态。这和我们遇到的 a chest was raised, the sea bed was scoured 等用法一致，都是本课反复出现的重点语法。\n\n3. 【关联点】realized that... 的用法，即动词后接 that 从句作宾语，这和我们之前遇到的 The captain knew that... 结构完全相同，都用来引出人物“意识到”或“知道”的具体内容。"
    },
    {
        "english": "In another chest, which contained the belongings of a ship's officer, there was an unfinished letter which had been written on March 14th, 1943.",
        "chinese": "另一只海底沉箱中装的是船上一位军官的财物， 其中有一封写于1943年3月14日的信， 但没有写完。",
        "note": "1. 核心结构为 there was...，引出新事物“一封信”。句子通过两个 which 定语从句，分别修饰 chest 和 letter，层层递进地提供信息。【关联点】这和我们遇到的 there was tremendous excitement... 用法完全相同。\n\n2. 【关联点】词汇 belongings (财物) 在此重复出现。这和我们之前遇到的 ...the personal belongings of a seaman... 相互呼应，加深记忆。\n\n3. 【关联点】时态 had been written (过去完成时被动语态) 是本课重点。这和我们之前遇到的 had been received, had been found, had been sunk 等用法一致，都表示动作发生在故事主要时间之前，即“过去的过去”。"
    },
    {
        "english": "The captain learnt from the letter that the name of the lost ship was the Karen.",
        "chinese": "从这封信中船长了解到沉船船名是“卡伦”号。",
        "note": "1. 核心结构是“动词 + that宾语从句”，用来引出人物“了解到”的具体内容。\n\n2. 【关联点】这和我们遇到的 The captain knew that... 及 realized that... 结构完全相同。词汇 lost ship (沉船) 也在后文重复出现。"
    },
    {
        "english": "The most valuable find of all was the ship's log book, parts of which it was still possible to read.",
        "chinese": "打捞到的东西中最有价值的是船上的航海日志， 其中有一部分仍然清晰可读。",
        "note": "1. 核心词汇: find 在此是名词“发现物”。【关联点】这和我们遇到的 ...was found (被发现) 中的动词 found 形成对比。形容词 valuable (有价值的) 和短语 of value 意思相同。\n\n2. 核心结构: 主句是简单的“主谓表”结构，清晰说明“最有价值的发现是什么”。逗号后的 parts of which... 是一个非限定性定语从句，用来补充说明 log book。\n\n3. 语法难点: parts of which 意为“它的某些部分”。【关联点】这和我们之前遇到的 a ship which... 类似，但增加了“介词+which”的结构，更为高级。从句中 it was possible to read 的 it 是形式主语，指代后面的 to read。"
    },
    {
        "english": "From this the captain was able to piece together all the information that had come to light.",
        "chinese": "据此， 船长可以将所有的那些已经搞清的材料拼凑起来。",
        "note": "1. 核心短语: piece together (拼凑零散信息) 和 come to light (真相大白，被发现)。From this (据此) 指的是前文发现的各种线索。\n\n2. 【关联点】时态 had come to light 是过去完成时，表示“信息被发现”发生在船长“拼凑”之前。这是本课反复出现的重点，和我们遇到的 had been received, had been found 等用法一致，都表示“过去的过去”。\n\n3. 【关联点】that had come to light 是定语从句，修饰 information。这种“名词+that/which从句”的结构是本课核心，和我们遇到的 a ship which had been sunk, items which were brought... 等用法完全相同。"
    },
    {
        "english": "The Karen had been sailing in a convoy to Russia when she was torpedoed by an enemy submarine.",
        "chinese": "“卡伦”号当年在为其他船只护航驶往俄国的途中突然遭到敌方潜水艇鱼雷的袭击。",
        "note": "1. 核心结构: when 连接一个持续的背景动作 (had been sailing) 和一个突然发生的事件 (was torpedoed)，生动地表达了“当时正在……突然……”。\n\n2. 时态是关键: had been sailing (过去完成进行时) 描述被攻击前的持续背景。【关联点】这和我们遇到的 had been searching, had been carrying 类似，都用来描述过去某个时间点之前一直在持续的背景动作。\n\n3. 动词 torpedoed (用鱼雷攻击) 在此以被动语态 was torpedoed 出现。【关联点】这和我们遇到的 was scoured (被搜索), was raised (被打捞), had been received (被收到) 等类似，都是本课重点，强调主语是动作的承受者。"
    },
    {
        "english": "This was later confirmed by naval official at the Ministry of Defiance after the Elkor had returned home.",
        "chinese": "这一说法在“埃尔科”号返航后得到的国防部一位海军官员的证实。",
        "note": "1. 核心结构: 主句 This was confirmed (此事被证实) 使用被动语态，强调“事情”本身。after 引导时间状语从句，说明“证实”发生在“返航”之后。\n\n2. 【关联点】时态清晰地交代了动作先后: 从句用 had returned (过去完成时)，表示“返航”先发生；主句用 was confirmed (一般过去时)，表示“证实”后发生。这个“过去的过去”用法是本课反复出现的重点。\n\n3. 【关联点】被动语态 was confirmed 和我们遇到的 was scoured, was raised, was torpedoed 等类似，都是本课重点，强调主语是动作的承受者。"
    },
    {
        "english": "All the items that were found were sent to the War Museum.",
        "chinese": "那次打捞到的所有物品均被送往军事博物馆。",
        "note": "1. 核心结构: 主语是 All the items (所有物品)，由 that were found (那些被找到的) 这个定语从句修饰。句子的主要动作是 were sent (被送往)，主语是动作的承受者。\n\n2. 【关联点】本句包含两个被动语态: were found 和 were sent。被动语态是本课核心，这和我们遇到的 was scoured (被搜索), had been received (被收到), was torpedoed (被鱼雷攻击) 等用法完全一致，都强调主语“被”怎么样。\n\n3. 【关联点】that were found 是定语从句。这种“名词+that/which从句”的修饰结构是本课重点，和我们遇到的 items which were brought..., a ship which had been sunk... 等用法完全相同。\n\n4. 【关联点】这里的 found 是动词 find 的过去分词。注意区分后面遇到的名词 find (发现物)，如 The most valuable find of all...。"
    }
]