[
    {
        "english": "Some plays are so successful that they run for years on end,",
        "chinese": "有些剧目十分成功，以致连续上演好几年。",
        "note": "1. 核心句型是“so... that...”，意为“如此…以至于…”，强调程度与结果。记住特殊用法：run (戏剧上演) 和 on end (连续不断)。\n2. 【关联点】本句的 successful 与后文 A highly successful play 用法一致。“for years on end”与演员“night after night”重复台词相呼应，都强调了时间的持续。"
    },
    {
        "english": "In many ways, this is unfortunate for the poor actors who are required to go on repeating the same lines night after night.",
        "chinese": "这样一来，可怜的演员们可倒霉了，因为他们需要一夜连着一夜地重复同样的台词。",
        "note": "1. 核心结构是“this is unfortunate for sb. who...”，即“这对某个做……的人来说是不幸的”。主句是主谓表结构，说明一种状态；who引导的定语从句则具体解释了是哪些演员以及他们不幸的原因。\n\n2. 掌握两个关键搭配：be required to do sth (被要求做某事)，表示一种客观规定；go on doing sth (继续做某事)，强调动作的持续。\n\n3. 【关联点】这里的被动结构 are required to (被要求) 和我们遇到的 the noble was expected to read (被期望去读) 非常相似，都表达了演员无法自主的处境，是被动接受任务。\n\n4. 【关联点】短语 night after night (夜复一夜) 形象地描绘了时间的重复。这和我们之前遇到的 for years on end (年复一年) 遥相呼应，共同营造了戏剧表演中那种漫长而单调的感觉。"
    },
    {
        "english": "One would expect them to know their parts by heart and never have cause to falter.",
        "chinese": "人们以为，这些演员一定会把台词背得烂熟，绝不会临场结巴的，",
        "note": "1. 核心句型是 expect sb to do sth (期待某人做某事)。One 泛指“人们”，would 表示一种普遍的推测或假设。\n\n2. 掌握两个关键短语：know sth by heart (凭记忆熟记) 和 have cause to falter (有理由结巴)。falter 指表演时忘词或卡壳。\n\n3. 【关联点】这里的 expect them to know 是主动语态，与后文的被动语态 was expected to read 类似，都表达了外界对演员的要求。\n\n4. 【关联点】短语 by heart 是全文的关键线索。狱卒后来的玩笑，就是想测试演员是否真的 learn the contents of the letter by heart，这个期望直接引发了故事冲突。"
    },
    {
        "english": "Yet this is not always the case.",
        "chinese": "但情况却并不总是这样。",
        "note": "1. 核心短语 not always the case，意为“情况并非总是如此”，用来引出与普遍看法相反的实例。Yet在句首加强转折。\n\n2. 重点掌握 not always 这一“部分否定”结构，它表达“并非总是”，与表示“从不”的 never 意思完全不同。\n\n3. 【关联点】注意区分本句的 not always (并非总是)，和后文 a gaoler would always come (过去总是会) 以及 he always insisted (他总是坚持) 的用法。前者是部分否定，表示有例外；后者是完全肯定，强调动作的规律性。"
    },
    {
        "english": "A famous actor in a highly successful play was once cast in the role of an aristocrat who had been imprisoned in the Bastille for twenty years.",
        "chinese": "有一位名演员曾在一出极为成功的剧目中扮演一个贵族角色，这个贵族已在巴士底狱被关押了20年。",
        "note": "1. 掌握核心短语 cast in the role of (被选定扮演)。注意句中两个被动语态：was cast 和 had been imprisoned，都强调主语是动作的承受者。\n\n2. 句子主干是“演员扮演贵族”，who从句修饰贵族。注意时态递进：had been imprisoned (过去完成时) 发生在 was cast (过去时) 之前。\n\n3. 【关联点】highly successful play 与我们之前遇到的 so successful plays 相互呼应，都指极为成功的剧目。\n\n4. 【关联点】被动语态 was cast 与后文演员 are required to (被要求) 及 was expected to (被期望) 类似，都突显了演员的被动处境。"
    },
    {
        "english": "In the last act, a gaoler would always come on to the stage with a letter which he would hand to the prisoner.",
        "chinese": "在最后一幕中，狱卒手持一封信上场，然后将信交给狱中那位贵族。",
        "note": "1. 核心是 would always come，这里的 would 表示过去反复发生的习惯性动作，意为“过去总是会”。它为故事设定了一个固定不变的背景。\n\n2. 句子由主句“狱卒上台”和 which 定语从句构成。which 指代 a letter，说明这封信的用途是“他会递给囚犯”。\n\n3. 【关联点】注意区分 would always (过去总是) 和我们之前遇到的 not always (并非总是)。前者强调过去动作的规律性，后者是部分否定，表示有例外。\n\n4. 【关联点】动词 hand (递给) 的用法是 hand sth to sb。这和后来贵族反将白纸 handed the sheet of paper to the gaoler 的结构完全一样，只是动作发出者和接受者互换了。"
    },
    {
        "english": "Even though the noble was expected to read the letter at each performance, he always insisted that it should be written out in full.",
        "chinese": "尽管那个贵族每场戏都得念一遍那封信，但他还是坚持要求将信的全文写在信纸上。",
        "note": "1. 核心结构是“Even though..., he insisted that...”，表达“尽管…仍坚持…”。insist后的从句用should表虚拟，是固定用法。关键短语：be expected to (被期望)，in full (全文地)。\n\n2. 【关联点】这里的被动语态 was expected to (被期望) 与之前的 are required to (被要求) 类似，都强调演员无法自主，是被动接受任务。\n\n3. 【关联点】he always insisted 强调个人固执。这和我们遇到的 would always come (过去习惯) 以及 not always (部分否定) 形成对比。\n\n4. 【关联点】noble 与 aristocrat 是同义词。短语 written out in full (全文写出) 与人们期待演员能 know their parts by heart (熟记台词) 形成对比，暗示了他的不自信。"
    },
    {
        "english": "One night, the gaoler decided to play a joke on his colleague to find out if, after so many performances, he had managed to learn the contents of the letter by heart.",
        "chinese": "一天晚上，狱卒决定与他的同事开一个玩笑，看看他反复演出这么多场之后，是否已将信的内容记熟了。",
        "note": "1. 核心结构是“decided to do sth to find out if...”，即“决定做某事以查明是否…”。关键短语：play a joke on (开玩笑) 和 find out (查明)。\n\n2. 【关联点】短语 learn... by heart (熟记) 直接呼应了前文人们的期望 know their parts by heart。狱卒的玩笑正是对这一期望的检验，是故事的核心冲突点。\n\n3. 【关联点】这里的 if 引导宾语从句，表示“是否”。这和我们之后遇到的狱卒 anxious to see if... (急于想看是否...) 的用法完全相同，都用来表达不确定的情况。\n\n4. 【关联点】时态 had managed to learn (过去完成时) 表示“记熟”发生在“决定开玩笑”之前。这和之前贵族 had been imprisoned (早已被监禁) 的用法一致。"
    },
    {
        "english": "The curtain went up on the final act of the play and revealed the aristocrat sitting alone behind bars in his dark cell.",
        "chinese": "大幕拉开，最后一幕戏开演，贵族独自一人坐在铁窗后阴暗的牢房里。",
        "note": "1. 句子由and连接主语The curtain的两个连续动作：went up (升起)，一个简洁的主谓结构；以及revealed the aristocrat sitting... (揭示了贵族坐着的状态)，这是一个主谓宾补(S+V+O+C)结构。\n\n2. 核心句型是reveal sb doing sth，这里的sitting...作宾语补足语，生动描绘了贵族被发现时的状态。短语behind bars意为“在坐牢”。\n\n3. 【关联点】The curtain went up的主谓结构，和我们遇到的the gaoler appeared (狱卒出现)完全一样。\n\n4. 【关联点】aristocrat (贵族)与后文的noble是同义词。短语behind bars (坐牢)则呼应了前文他had been imprisoned (已被监禁)的背景。"
    },
    {
        "english": "Just then, the gaoler appeared with the precious letter in his bands.",
        "chinese": "这时狱卒上场，手里拿着那封珍贵的信。",
        "note": "- 英文: \"Just then, the gaoler appeared with the precious letter in his bands.\"\n- 中文: \"这时狱卒上场，手里拿着那封珍贵的信。\"\n1. 核心结构是“the gaoler appeared”，一个简洁的主谓(S+V)句型。“Just then”意为“就在那时”，强调动作的突然发生。\n2. 介词短语“with...”生动描绘了狱卒登场时的伴随状态，即“手里拿着信”。precious一词暗示了这封信在剧情中的重要性。\n3. 【关联点】这个主谓结构和我们之前遇到的 The curtain went up (幕布升起) 完全一样，都是描述一个场景的开始。\n4. 【关联点】狱卒“带着信出现”的情景，正是对前文“a gaoler would always come... with a letter”这个固定情节的具体呈现。"
    },
    {
        "english": "He entered the cell and presented the letter to the aristocrat.",
        "chinese": "狱卒走进牢房，将信交给贵族。",
        "note": "- 英文: \"He entered the cell and presented the letter to the aristocrat.\"\n- 中文: \"狱卒走进牢房，将信交给贵族。\"\n1. 句子由and连接主语He的两个连续动作：entered the cell (进入牢房) 和 presented the letter... (递交信件)。这是描述一连串行为的常用方式。\n2. 核心动词present的用法是 present sth to sb (将某物呈递给某人)。\n3. 【关联点】present sth to sb的结构，和我们之前遇到的 he would hand to the prisoner 以及之后贵族 handed the sheet of paper to the gaoler 完全一样，都是“递给某人某物”的意思，只是present更正式。\n4. 【关联点】词汇cell (牢房) 与 aristocrat (贵族) 构成了故事的核心场景。注意aristocrat与noble是同义词，cell则与imprisoned, prisoner, behind bars等词共同营造了监禁的背景。"
    },
    {
        "english": "But the copy he gave him had not been written out in full as usual.",
        "chinese": "但这回狱卒给贵族的信没有像往常那样把全文写全，",
        "note": "- 英文: \"But the copy he gave him had not been written out in full as usual.\"\n- 中文: \"但这回狱卒给贵族的信没有像往常那样把全文写全，\"\n1. 核心时态是过去完成时被动语态 had not been written out，强调“没写完”这个动作发生在“给他”这个过去的动作之前。\n2. 【关联点】这个时态和我们之前遇到的贵族 had been imprisoned (早已被监禁) 用法一致，都是描述一个发生在故事主要动作之前的背景状态。\n3. 【关联点】短语 in full (完整地) 直接呼应了贵族之前 insisted that it should be written out in full 的固执要求，而 as usual (像往常一样) 则打破了 would always come 所建立的惯例，标志着玩笑的开始。\n4. 【关联点】注意 the copy he gave him 的结构，这是一个省略了关系代词that的定语从句。这和我们遇到的 a letter which... 和 an aristocrat who... 形成对比，展示了定语从句的灵活用法。"
    },
    {
        "english": "It was simply a blank sheet of paper.",
        "chinese": "而是一张白纸。",
        "note": "- 英文: \"It was simply a blank sheet of paper.\"\n- 中文: \"而是一张白纸。\"\n1. 核心是主谓表结构(S+V+P)，用was连接主语It和表语a blank sheet of paper。simply(仅仅)一词加强了语气，强调这就是玩笑的全部——一张白纸。\n2. 【关联点】这个主谓表结构是描述事物状态的基础。这和我们之后遇到的贵族和狱卒说的 'The light is dim' (光线很暗) 结构完全一样，都是用系动词is/was来描述主语的性质。\n3. 【关联点】blank (空白的) 与贵族之前 always insisted that it should be written out in full (总是坚持要全文写出) 形成强烈反差，正是这个反差制造了戏剧冲突和幽默感。"
    },
    {
        "english": "The gaoler looked on eagerly, anxious to see if his fellow actor had at last learnt his lines.",
        "chinese": "狱卒热切地观察着，急于想了解他的同事是否记熟了台词。",
        "note": "- 英文: \"The gaoler looked on eagerly, anxious to see if his fellow actor had at last learnt his lines.\"\n- 中文: \"狱卒热切地观察着，急于想了解他的同事是否记熟了台词。\"\n1. 核心结构是“looked on eagerly, anxious to see if...”，其中anxious to see...生动描绘了狱卒急切的心情和目的。if在此引导宾语从句，意为“是否”。\n2. 【关联点】if引导宾语从句的用法，和我们之前遇到的狱卒“to find out if...he had managed to learn”的结构完全相同，都用来引出不确定的情况。\n3. 【关联点】短语learnt his lines (记熟台词) 是全文线索的高潮。它直接回应了人们的期望know their parts by heart，也是狱卒开玩笑想验证的learn...by heart。\n4. 【关联点】过去完成时had learnt表示“记熟”发生在“观察”之前。这和贵族had been imprisoned(早已被监禁)的时态用法一致，都是为故事提供背景。"
    },
    {
        "english": "The noble stared at the blank sheet of paper for a few seconds.",
        "chinese": "贵族盯着纸看了几秒钟，",
        "note": "- 英文: \"The noble stared at the blank sheet of paper for a few seconds.\"\n- 中文: \"贵族盯着纸看了几秒钟，\"\n\n1. 核心动词是stare at (盯着看)，生动描绘了贵族看到白纸时的惊愕。for a few seconds则点明了这瞬间的凝滞。\n2. 【关联点】这里的noble与我们之前遇到的aristocrat是同义词，都指“贵族”，共同塑造了这位演员的角色身份。\n3. 【关联点】a blank sheet of paper (一张白纸) 与贵族之前固执要求的 written out in full (全文写出) 形成强烈反差，这是整个故事幽默感的来源。\n4. 【关联点】贵族的stared at (盯着看) 和狱卒的looked on eagerly (热切旁观) 形成鲜明对比，一个惊愕，一个期待，戏剧张力十足。"
    },
    {
        "english": "Then, squinting his eyes, he said: 'The light is dim.",
        "chinese": "然后，眼珠一转，说道：“光线太暗，",
        "note": "- 英文: \"Then, squinting his eyes, he said: 'The light is dim.\"\n- 中文: \"然后，眼珠一转，说道：“光线太暗，\"\n\n1. 核心结构是“squinting..., he said...”，其中squinting his eyes是伴随动作，生动描绘了“说”话时的状态。引号内“The light is dim”是简单的主谓表句型，用dim(昏暗的)说明原因。\n\n2. 【关联点】这个“动词ing..., 主句”的结构，和我们之后遇到的“Finding that he could not remember..., the gaoler replied”完全一样，都是用现在分词短语作状语，来说明主句动作发生时的背景或原因。\n\n3. 【关联点】贵族抱怨“The light is dim”是故事的关键转折。注意这句台词之后被狱卒巧妙地借用，当他自己也记不住台词时，他回答：“The light is indeed dim, sire.”，这正是故事的笑点所在。"
    },
    {
        "english": "Read the letter to me'.",
        "chinese": "请给我读一下这封信。”",
        "note": "1. 核心是祈使句结构，直接以动词Read开头，省略主语You，发出一个直接请求。\n\n2. 【关联点】这个“动词+宾语+to sb.”的结构非常重要。这和我们之后遇到的 he would hand to the prisoner 和 presented the letter to the aristocrat 结构完全一样，都是“把某物给某人”。\n\n3. 【关联点】“读信”这个动作是全文的核心。贵族被期望(was expected to read)，狱卒最后也真的(proceeded to read)读了信，这个简单的请求贯穿了整个故事。"
    },
    {
        "english": "And he promptly handed the sheet of paper to the gaoler.",
        "chinese": "说完，他一下子把信递给狱卒。",
        "note": "1. 核心动词是hand (递交)，副词promptly (立刻地) 生动描绘了贵族演员急中生智的快速反应。\n\n2. 【关联点】句型hand sth to sb (把某物递给某人) 与我们之前遇到的狱卒hand to the prisoner结构完全一样。但此处动作的发出者和接收者巧妙互换，贵族将难题抛回给了狱卒。\n\n3. 【关联点】这里的the sheet of paper正是上一句提到的a blank sheet of paper (一张白纸)，是贵族机智反击的关键道具。"
    },
    {
        "english": "Finding that he could not remember a word of the letter either, the gaoler replied: 'The light is indeed dim, sire, I must get my glasses.'",
        "chinese": "狱卒发现自己连一个字也记不住，于是便说：“陛下，这儿光线的确太暗了，我得去眼镜拿来。”",
        "note": "1. 核心结构是“Finding that..., 主句”，用现在分词短语作原因状语，解释狱卒为何如此回答。引号内“The light is indeed dim”是狱卒的回答，indeed(的确)一词加强了语气。\n\n2. 【关联点】这个“Finding that...”的结构，和我们之前遇到的贵族“squinting his eyes, he said...”完全一样，都是用现在分词短语作状语，生动描绘主句动作发生时的背景或原因。\n\n3. 【关联点】狱卒巧妙地借用了贵族之前的台词“The light is dim”。贵族用它来脱困，狱卒则用它来掩饰自己也忘了词，这是故事的笑点所在。"
    },
    {
        "english": "With this, he hurried off the stage.",
        "chinese": "他一边说着，一边匆匆下台。",
        "note": "1. 核心是动词短语hurried off (匆匆离开)。介词off清晰地表达了“离开”舞台的方向。句首With this是重要的过渡语，意为“说完这话后”，将语言和动作无缝衔接。\n2. 【关联点】注意动作方向的对比。这和我们之前遇到的狱卒 a gaoler would... come on to the stage (上台) 形成鲜明对比，一个是登场，一个是下台，生动描绘了舞台上的调度。"
    },
    {
        "english": "Much to the aristocrat's amusement, the gaoler returned a few moments later with a pair of glasses and the usual copy of the letter with he proceeded to read to the prisoner.",
        "chinese": "贵族感到非常好笑的是：一会儿工夫，狱卒重新登台，拿来一副眼镜以及平时使用的那封信，然后为那囚犯念了起来。",
        "note": "1. 核心短语是“Much to one's amusement”，意为“令某人感到非常好笑的是”。这呼应了之前狱卒开的玩笑(play a joke)失败，现在轮到贵族看笑话了。\n2. 核心动词是proceed to do sth，意为“接着做某事”。注意with which的用法，它指代letter，表示“用这封信，他接着读”，是“介词+关系代词”的正式用法。\n3. 【关联点】“the usual copy of the letter”与之前的“a blank sheet of paper”形成鲜明对比，标志着玩笑的结束和常规(as usual)的恢复。\n4. 【关联点】狱卒的动作proceeded to read是对贵族命令“Read the letter to me”的直接执行，显示了戏剧性的角色反转。"
    }
]