[
    {
        "english": "Modern sculpture rarely surprises us any more.",
        "chinese": "现代雕塑不再使我们感到惊讶了。",
        "note": "1. 核心短语是 rarely ... any more，表示“不再...”，它用一个带否定意味的副词 rarely 来表达一种与过去不同的状态。句型为主谓宾：Modern sculpture (主语) surprises (谓语) us (宾语)。\n\n2. 【关联点】注意区分本句的动词 surprise (使...惊讶) 和我们之后遇到的形容词 surprised (感到惊讶的)。前者指事物的主动影响 (A surprises B)，后者描述人的被动感受 (B is surprised by A)。"
    },
    {
        "english": "The idea that modern art can only be seen in museums is mistaken.",
        "chinese": "那种认为现代艺术只能在博物馆里才能看到的观点是错误的。",
        "note": "1. 句子的主干是 “The idea is mistaken”（这个观点是错误的）。中间由 that 引导的长句是同位语从句，它的唯一作用就是详细解释 “The idea” 的具体内容是什么。\n\n2. 【关联点】这个“名词 + that从句 + is + 形容词”的结构，和我们后面遇到的 “Forms that... are familiar” 结构完全一样，都是先用一个从句定义事物，再说明其性质。\n\n3. 【关联点】句中 “can be seen” (被看见) 使用了被动语态，强调“艺术”是动作的接受者。这和我们之后遇到的 “Sparks were emitted” (火花被迸发出来) 用法一致。"
    },
    {
        "english": "Even people who take no interest in art cannot have failed to notice examples of modern sculpture on display in public places.",
        "chinese": "即使是对艺术不感兴趣的人也不会注意到在公共场所展示的现代艺术品。",
        "note": "1. 核心是双重否定句型 “cannot have failed to do”，它表达强烈的肯定，等同于“肯定做过某事”。因此，句子的意思是“肯定已经注意到了”，而不是“没注意到”。\n\n2. 主语 “people” 后跟着由 “who” 引导的定语从句，作用是给 “people” 贴上一个描述性标签。短语 “take no interest in” 意为“对...不感兴趣”。\n\n3. 【关联点】这和我们之前遇到的 “Some so-called 'modern' pieces have been on display...” 类似，都使用了 “on display” 这个短语，表示“正在展出”。"
    },
    {
        "english": "Strange forms stand in gardens, and outside buildings and shops. We have got quite used to them.",
        "chinese": "公园里、大楼和商店外竖立着的奇形怪状的雕塑，对这些， 我们已经司空见惯了。",
        "note": "1. 核心短语是 have got used to，意为“已经习惯于”，强调一个完成的过程。其中 have got 是 have 的口语化表达，them 指代前文的 strange forms。\n\n2. 【关联点】注意区分本句的 get used to (习惯于) 和后文的 be familiar to (对...熟悉)。前者强调从不适到适应的动态过程，后者描述早已熟知的静态状态。\n\n3. 【关联点】这里的 forms (形态) 指代雕塑，与后文 Oddly shaped forms 的用法一致，是本文描述这些艺术品的核心词汇。"
    },
    {
        "english": "Some so-called 'modern' pieces have been on display for nearly eighty years.",
        "chinese": "有些所谓的“现代”艺术品在那里已经陈列了近80年了。",
        "note": "1. 核心句型是 have been on display for...，表示状态从过去持续至今。so-called (所谓的) 暗示作者的怀疑。\n\n2. 【关联点】on display (展出) 是本文高频词，之后会作为后置定语出现，如 The objects on display。"
    },
    {
        "english": "In spite of this, some people -- including myself -- were surprise by a recent exhibition of modern sculpture.",
        "chinese": "尽管如此， 最近举办的一次现代雕塑展览还是使一些人（包括我在内）大吃了一惊。",
        "note": "1. In spite of this 是固定短语，意为“尽管如此”，引出与前文预料相反的结果。\n\n2. 句子的核心是 some people were surprised by...，表达“人被某事惊到”的被动感受。中间的 -- including myself -- 是插入语，用于补充说明。\n\n3. 【关联点】这里的 surprised (感到惊讶的) 是形容词，描述人的被动感受。注意区分第一句中的动词 surprise (使...惊讶)，它描述事物的主动影响。\n\n4. 【关联点】In spite of this 用于句首表示转折，这和我们之后遇到的 however (然而) 功能类似，都是引出意料之外的情况。"
    },
    {
        "english": "The first thing I saw when I entered the art gallery was a notice which said: 'Do not touch the exhibits. Some of them are dangerous!'",
        "chinese": "走进展厅首先看到的是一张告示， 上面写着“切勿触摸展品，某些展品有危险！”",
        "note": "1. 句子的主干是 The first thing was a notice，一个主谓表结构。主语 The first thing 被 I saw 和 when... 从句修饰，变得很长。\n\n2. a notice which said... 意为“一个写着……的告示”。用 which 引导的从句来修饰前面的名词，说明其内容，这是非常地道的用法。\n\n3.【关联点】这和我们遇到的 people who... 和之后会遇到的 forms that... 结构类似，都是用一个从句给前面的名词加上详细描述。who 指人，which/that 常指物。"
    },
    {
        "english": "The objects on display were pieces of moving sculpture.",
        "chinese": "展品都是些活动的雕像。",
        "note": "1. 句子的主干是 The objects were pieces of sculpture。关键在于 on display 是一个后置定语，像标签一样跟在 objects 后面，说明是“正在展出的”物品。\n\n2. moving sculpture 指“活动的雕塑”，moving 是现在分词作形容词。pieces of 用于量化不可数名词 sculpture，指“几件作品”。\n\n3. 【关联点】这和我们之前遇到的 Some so-called 'modern' pieces have been on display 类似，都使用了高频短语 on display。注意这里它作为后置定语，用法更简洁。\n\n4. 【关联点】这种“名词 + 后置修饰”的结构，与我们遇到的 people who... 和 a notice which said... 功能相同，都是给名词添加描述，只是形式不同（介词短语 vs. 从句）。"
    },
    {
        "english": "Oddly shaped forms that are suspended form the ceiling and move in response to a gust of wind are quite familiar to everybody.",
        "chinese": "人们所熟悉的是悬挂在天花板上、造型奇特、随风飘荡的雕塑品。",
        "note": "1. 句子的主干是 “Forms ... are familiar to everybody”。中间由 that 引导的长句是定语从句，像一个长长的形容词，详细描述了 forms 的样子。\n\n2. 【关联点】这个“名词 + that从句 + is/are + 形容词”的结构，和我们之前遇到的 “The idea that... is mistaken” 完全一样，都是先用从句定义主语，再说明其性质。\n\n3. 【关联点】注意区分这里的 be familiar to (对...熟悉)，和我们之前遇到的 get used to (习惯于)。前者描述早已熟知的静态状态，后者强调从不适到适应的动态过程。\n\n4. 【关联点】从句中的 are suspended (被悬挂) 使用了被动语态。这和我们遇到的 can be seen (被看见)、were emitted (被迸发) 用法一致，都强调主语是动作的承受者。"
    },
    {
        "english": "These objects, however, were different.",
        "chinese": "这些展品却使人大开眼界。",
        "note": "1. however 是一个插入语，表示“然而”，用于引出与前文相反的情况。句子的主干是 These objects were different，一个简单的主谓表结构，说明这些展品是“与众不同的”。\n\n2. 【关联点】这和我们之前遇到的 In spite of this (尽管如此) 功能完全一样，都是放在句中表示转折，引出意料之外的情况。\n\n3. 【关联点】这里的 objects (展品) 和我们之前遇到的 The objects on display 中的用法一致，都是指代展览中的艺术品。\n\n4. 【关联点】这里的 different (不同) 与前文的 familiar (熟悉) 和 used to (习惯) 形成鲜明对比，强调了这次展览的独特性，呼应了作者的 surprised (惊讶)。"
    },
    {
        "english": "Lined up against the wall, there were long thin wires attached to metal spheres.",
        "chinese": "靠墙排列着许多细长的电线， 而电线又连着金属球。",
        "note": "1. 句子的核心是 there were ... wires，这是一个倒装结构。关键在于理解两个过去分词短语：Lined up against the wall 和 attached to metal spheres。它们都像形容词一样，从不同角度（排列方式与连接物）修饰核心名词 wires。\n\n2. 【关联点】这种“(地点状语), there were (物体)”的句型是描述场景的经典手法。这和我们之后遇到的 In the centre of the hall, there were a number of tall structures... 结构完全一样，都是先设定地点，再引出存在的物体。\n\n3. 【关联点】短语 attached to... 用过去分词来描述一种“被连接”的状态。这和我们遇到的 are suspended (被悬挂) 和 had been magnetized (被磁化) 用法类似，都是用过去分词来描述展品的状态。"
    },
    {
        "english": "The spheres had been magnetized and attracted or repelled each other all the time.",
        "chinese": "金属球经过磁化， 互相之间不停地相互吸引或相互排斥。",
        "note": "1. 核心时态是过去完成被动语态 had been magnetized，强调“被磁化”是发生在互相吸引或排斥之前的一个先决状态。\n\n2. 【关联点】用过去分词 magnetized 表示一种“被动”状态，这和我们之前遇到的 are suspended (被悬挂) 和 attached to (被连接) 的用法一致，都是描述展品的状态。\n\n3. 词汇 attract (吸引) 和 repel (排斥) 是一对反义词，描述了磁力的两种作用。each other 表示这种作用是相互的。\n\n4. 【关联点】短语 all the time (一直) 强调动作的持续性。这和我们之前遇到的 continuously (不停地) 作用类似，都用来生动地描述展品的动态。"
    },
    {
        "english": "In the centre of the hall, there were a number of tall structures which contained coloured lights. These lights flickered continuously like traffic lights which have gone mad.",
        "chinese": "展厅中央是装有彩色灯泡的许多高高的构件，灯泡一刻不停地闪烁着， 就像失去了控制的红绿灯。",
        "note": "1. 句子由两部分构成。第一部分用 there were structures 引入物体，第二部分用 These lights flickered continuously 描述其动态，生动地描绘了展厅的奇特景象。\n\n2. 【关联点】句首的“In the centre..., there were...”是描述场景的经典手法，这和我们之前遇到的 “Lined up against the wall, there were...” 结构完全一样。\n\n3. 【关联点】句中用 which contained... 和 which have gone mad 来修饰前面的名词。这和我们遇到的 a notice which said... 用法一致，都是给事物添加具体描述。\n\n4. 【关联点】动词 flicker (忽明忽暗地闪烁) 描绘了不稳定的光。这和我们之前遇到的 flashed (瞬间闪光) 意思相近但侧重不同。\n\n5. 【关联点】副词 continuously (不停地) 强调动作的持续，这和我们遇到的 all the time (一直) 作用类似，都用来生动地描述展品的动态。"
    },
    {
        "english": "Sparks were emitted from small black boxes and red lamps flashed on and off angrily.",
        "chinese": "小黑盒子里迸出火花，红色灯泡发怒似地忽明忽暗。",
        "note": "1. 这是一个由 and 连接的并列句。前半句的 were emitted (被迸发) 使用被动语态，强调火花是自己冒出来的，而非人为。\n\n2. 【关联点】被动语态的用法，和我们之前遇到的 can be seen (被看见)、are suspended (被悬挂) 一致，都用来生动描绘展品的奇特状态。\n\n3. 后半句用 flashed on and off (忽明忽暗) 描述灯光动态，副词 angrily (愤怒地) 更是拟人手法，让场景充满戏剧性。\n\n4. 【关联点】注意区分 flashed (瞬间闪光) 和之前遇到的 flicker (持续闪烁)。它们都描述光，但侧重点不同，前者突兀，后者摇曳。"
    },
    {
        "english": "It was rather like an exhibition of prehistoric electronic equipment.",
        "chinese": "这儿倒像是在展览古老的电子设备。",
        "note": "1. 句子的核心结构是 “It was like...”，一个用作比喻的主谓表句型。副词 rather (有点儿) 使这个比喻听起来更委婉、更具想象力。\n\n2. 词汇 prehistoric (史前的) 与 electronic equipment (电子设备) 形成奇特对比，生动描绘了展品的古怪感。注意 equipment 是不可数名词。\n\n3. 【关联点】使用 like 作比喻，这和我们之后遇到的 “...flickered continuously like traffic lights...” 手法完全一样，都是为了让描述更形象生动。\n\n4. 【关联点】这里的 exhibition (展览) 正是前文提到的那个让作者 surprised (惊讶) 的展览，本句是其中一个场景的具体描述。"
    },
    {
        "english": "These peculiar forms not only seemed designed to shock people emotionally, but to give them electric shocks as well!",
        "chinese": "好像设计这些奇形怪状的展品不仅是为了给人感情上的强烈刺激， 而且还想给人以电击似的！",
        "note": "1. 核心句型是 not only... but... as well，意为“不仅...而且...”，连接了两个平行的目的：to shock emotionally (情感上) 和 to give electric shocks (物理上)。动词 seemed (似乎) 表明这是一种主观推测，而非事实。\n\n2. 【关联点】这里的 designed (被设计的) 是过去分词作表语，描述展品的状态。这和我们之前遇到的 are suspended (被悬挂)、attached to (被连接) 和 had been magnetized (被磁化) 用法完全一样，都是用过去分词来描述物体的被动状态。\n\n3. 【关联点】这里的 peculiar forms (奇特的形态) 呼应了前文的 Strange forms 和 Oddly shaped forms。动词 shock (使震惊) 在情感冲击力上比 surprise (使惊讶) 更强烈，凸显了展品的怪异程度。"
    }
]