[
    {
        "english": "There was a time when the owners of shops and businesses in Chicago that to pay large sums of money to gangsters in return for 'protection.'",
        "chinese": "曾经有一个时期,芝加哥的店主和商行的老板们不得不拿出大笔的钱给歹徒以换取\"保护\"。",
        "note": "1. 核心词汇: gangster (歹徒) 指勒索 'protection' (保护费) 的人。注意protection带引号，暗示这不是真正的保护，而是勒索。这两个词是理解全文背景的关键。\n\n2. 核心短语: in return for (作为...的回报) 连接了行为和目的：支付 large sums of money (大笔的钱) 以换取虚假的“保护”。【关联点】large sums of money在后文反复出现，是贯穿全文的重要线索。\n\n3. 句型解析: “There was a time when...” 是一个引出过去故事的经典句型，意为“曾经有一个时期...”。when引导一个从句，具体描述是“一个怎样的时期”。【关联点】这和我们之后遇到的用who修饰princes(君主)的用法类似，都是跟在名词后面做补充说明。"
    },
    {
        "english": "If the money was not paid promptly, the gangsters would quickly put a man out of business by destroying his shop.",
        "chinese": "如果交款不及时,歹徒们就会很快捣毁他的商店,让他破产.",
        "note": "1. 核心短语: put... out of business (使...破产)。这是歹徒威胁的直接后果，通过 by destroying his shop (捣毁商店) 的方式实现。by + 动名词是说明“方法”的常用结构。\n\n2. 句型解析: 这是一个经典的“If..., would...”虚拟条件句，描述假设情况(交款不及时)及其可能结果(歹徒会让他破产)。If从句用过去时(was not paid)，主句用would + 动词原形(would put)。\n\n3. 【关联点】这里的 destroy (捣毁) 与前文“have their life work destroyed”中的用法一致，都指彻底的破坏，生动描绘了歹徒(gangsters)的手段。"
    },
    {
        "english": "Obtaining 'protection money' is not a modern crime.",
        "chinese": "榨取\"保护金\"并不是一种现代的罪恶行径.",
        "note": "1. 句型解析: Obtaining 'protection money' 是动名词短语作主语，指“榨取保护费”这件事。这种“动词+ing”作名词的用法很常见。【关联点】注意区分：这里Obtaining是主语，而我们之后会遇到的 by destroying (通过捣毁) 和 after burning (烧毁之后) 里的-ing形式则跟在介词后面。\n\n2. 核心词汇: protection money (保护费) 和 crime (罪行) 点明了这种行为的本质。【关联点】这句话是全文的转折点，它告诉我们，开头提到的芝加哥歹徒(gangsters)所做的勒索行为，并不是一种现代(modern)才有的罪行，从而引出下文的历史故事。"
    },
    {
        "english": "As long ago as the fourteenth century, an Englishman, Sir John Hawkwood, made the remarkable discovery that people would rather pay large sums of money than have their life work destroyed by gangsters.",
        "chinese": "早在14世纪,英国人约翰.霍克伍德就有过非凡的发现:\"人们情愿拿出大笔的钱,也不愿毕生的心血毁于歹徒之手.",
        "note": "1. 核心句型: would rather A than B (宁愿做A也不愿做B)，是本句的核心，揭示了人们在威胁面前的权衡。A是 pay large sums of money (付大笔钱)，B是 have their life work destroyed (让毕生心血被毁)。【关联点】这和我们开头遇到的歹徒勒索 \"large sums of money\" 形成呼应，点明了人们被迫付款的心理动因。\n\n2. 特殊用法: have something done (让某物被...)，表示主语经历或让某事发生，强调被动。这里的 have their life work destroyed 形象地描绘了心血被毁于一旦的惨状。【关联点】这和我们之后会遇到的 had a picture dedicated (让人为他画像以作纪念) 结构完全相同，都是“have+宾语+过去分词”，但一个表示不幸遭遇，一个表示主动安排，对比鲜明。\n\n3. 句子结构: 主干是 an Englishman... made the discovery (英国人有了发现)。that引导的从句是同位语，具体解释discovery的内容是什么。【关联点】这里的歹徒(gangsters)和破坏(destroy)都与前文内容直接关联，说明这种勒索模式古已有之。"
    },
    {
        "english": "Six hundred years ago, Sir Johan Hawkwood arrived in Italy with a band of soldiers and settled near Florence.",
        "chinese": "600年前,约翰.霍克伍德爵士带着一队士兵来到意大利,在佛罗伦萨附近驻扎下来,很快就出了名.",
        "note": "1. 核心结构是“主语 + 动词1 ... and + 动词2 ...”，描述了主角Hawkwood的两个连续动作：先“到达”(arrived)，再“安顿”(settled)。注意and后面省略了主语。\n\n2. 核心词汇：a band of soldiers (一队士兵)；settle (安顿/定居)。动词arrived和settled都用过去式，因为事情发生在“600年前”。\n\n3. 【关联点】这种用and连接同一主语两个动作的句型非常普遍。这和我们之后遇到的“He...made a name for himself and came to be known...”以及佛罗伦萨人“gave him a funeral and had a picture...”的结构完全一样，让叙事更连贯。"
    },
    {
        "english": "He soon made a name for himself and came to be known to the Italians as Giovanni Acuto.",
        "chinese": "意大利人叫他乔凡尼.阿库托.",
        "note": "1. 核心短语: make a name for oneself (为自己赢得名声) 和 come to be known as (逐渐被称为)。前者表示主动争取，后者描述被动获得的结果。\n\n2. 句型解析: 句子主干是“He + 动词1 ... and + 动词2 ...”，描述了两个连续的结果：先“出名”，再“被称作”。【关联点】这和我们之前遇到的 Hawkwood “arrived... and settled...” 的叙事结构完全一样，非常连贯。\n\n3. 【关联点】注意区分：本句用被动的 He came to be known as... (他被称为...) 来表达他的新身份。这和后文用主动的 the Italians regarded him as... (意大利人把他看作...) 表达了同样的意思，但视角不同。"
    },
    {
        "english": "Whenever the Italian city-states were at war with each other, Hawkwood used to hire his soldiers to princes who were willing to pay the high price he demanded.",
        "chinese": "每次意大利各城邦之间打伏,霍克伍德把他的士兵雇佣给愿给他出高价的君主。",
        "note": "1. 核心短语: used to do (过去常常做某事)，强调过去的一种固定习惯，但现在已不再如此。【关联点】这和我们之后遇到的 \"Hawkwood... would march...\" (会去进军) 中的 would 功能相似，都用来描述过去的习惯性动作。但used to更强调今昔对比。\n\n2. 句型解析: 句子主干是 Hawkwood used to hire his soldiers to princes (他过去把士兵雇给君主)。后面的 who... 从句是定语，像一个标签，详细说明是“哪种”君主——即那些 willing to pay (愿意付) 高价的君主。【关联点】这和我们之前遇到的 'a time when...' 结构完全一样，都是用一个从句来修饰前面的名词(time/princes)，让信息更具体。\n\n3. 【关联点】注意 a high price he demanded (他索要的高价)。这里的 'price' 与贯穿全文的 'large sums of money' 和 'protection money' 概念一脉相承，都指向了这种用武力换取金钱的商业模式。"
    },
    {
        "english": "In times of peace, when business was bad, Hawkwood and his men would march into a city-state and, after burning down a few farms, would offer to go away protection money was paid to them.",
        "chinese": "和平时期,当生意萧条时,霍克伍德便带领士兵进入某个城邦,纵火烧毁一两个农场,然后提出,如向他们缴纳保护金,他们便主动撤离。",
        "note": "1. 核心词汇: protection money (保护费)。这是霍克伍ഡ്在生意萧条(business was bad)时，通过纵火烧农场(burning down a few farms)这种暴力方式进行勒索的报酬。【关联点】这与开篇提到的歹徒(gangsters)勒索'protection'的行为模式完全一致，都是通过暴力威胁换取金钱。\n\n2. 核心用法: would。句中的两个would (would march, would offer) 都表示过去的习惯性动作，意为“过去常常会...”。【关联点】这和我们之前遇到的 'Hawkwood used to hire...' 中的 used to 功能非常相似。两者都描述过去的习惯，但would更常用于叙述故事中的重复动作。\n\n3. 句型解析: 句子描述了一个连贯的勒索流程：进军(march into)，烧毁农场(after burning down)，然后提出离开(offer to go away)。【关联点】这里的 burning 是跟在介词 after 后的动名词，这和我们之前遇到的 by destroying (通过捣毁) 结构相同。"
    },
    {
        "english": "Hawkwood made large sums of money in this way.",
        "chinese": "霍克伍德用这种方法挣了大笔钱.",
        "note": "1. 核心用法: make money (挣钱)。made是make的过去式。【关联点】注意区分：这和我们之前遇到的 make a name for oneself (为自己赢得名声) 中的make用法不同，前者指挣得财富，后者指赢得声誉。\n\n2. 核心词汇: large sums of money (大笔的钱)。【关联点】这个短语是贯穿全文的核心线索，从开篇芝加哥歹徒勒索，到人们宁愿付钱，再到霍克伍德的生财之道，都围绕着它。\n\n3. 句型解析: in this way (用这种方法) 指代上文描述的整个勒索过程：进军、烧农场、索要保护费。【关联点】这和我们之前遇到的 by destroying his shop (通过捣毁他的商店) 作用类似，都是用来具体说明实现目的的方式。"
    },
    {
        "english": "In spite of this, the Italians regarded him as a sort of hero.",
        "chinese": "尽管如此,意大利人还是把他视作某种英雄。",
        "note": "1. 核心短语: regard...as... (把...看作...)，一个表达主观看法的固定搭配。这里的 a sort of hero (某种英雄) 暗示这种看法并非绝对，带有一丝保留。\n\n2. 核心功能: In spite of this (尽管如此) 是一个强烈的转折信号，点明了意大利人看法的矛盾之处：尽管他有种种劣迹，却仍被视为英雄。this指代他之前的所作所为。\n\n3. 【关联点】这和我们之前遇到的 'He came to be known as...' (他被称为...) 形成了有趣的对比。'be known as' 描述的是一个客观事实(他的称号)，而 'regard him as' 则表达了意大利人主观的、带有复杂情感的评价。"
    },
    {
        "english": "When he died at the age of eighty, the Florentines gave him a state funeral and had a pictured with as dedicated to the memory of 'the most valiant soldier and most notable leader, Signor Giovanni Haukodue.'",
        "chinese": "他80岁那年死去时,佛罗伦萨人为他举行了国葬,并为他画像以纪念这位\"骁勇无比的战士、杰出的领袖乔凡尼.阿库托先生.\"",
        "note": "1. 句型解析: 佛罗伦萨人做了两件事，用and连接：gave him a state funeral (给了他国葬) 和 had a picture dedicated (为他画像)。【关联点】这和我们之前遇到的 Hawkwood “arrived... and settled...” 的叙事结构完全一样，用and连接同一主语的两个动作，使叙事更连贯。\n\n2. 核心用法: had a picture dedicated (让人为他画像以作纪念) 是 “have + 宾语 + 过去分词” 结构，表示“安排/让某事被做”。【关联点】这和我们之前遇到的 have their life work destroyed (让毕生心血被毁) 结构完全相同。但前者是主动安排的纪念，后者是不幸的遭遇，形成鲜明对比。"
    }
]