[
    {
        "english": "It is a good thing my aunt Harriet died years ago.",
        "chinese": "我的姑妈哈丽特好多年前就去世了，这倒是件好事。",
        "note": "1. 这是一个 “It is + 形容词/名词 + (that) 从句” 的经典句型，用来评价一件事。这里的 “It” 是形式主语，真正的主语是后面的 “my aunt Harriet died years ago” 这件事。\n\n2. 词汇 die (died) 意为“去世”。【关联点】这和我们后面遇到的名词 death (死亡) 形成词性对比，也和前面遇到的形容词 alive (活着的) 意思相反。\n\n3. 短语 years ago 意为“多年前”，是过去时的典型标志。ago 前面常接具体时间，如 two days ago (两天前)。"
    },
    {
        "english": "If she were alive today she would not be able to air her views on her favourite topic of conversation: domestic servants.",
        "chinese": "如果她活到今天，她将不能就她热衷的话题“佣人”发表意见了。",
        "note": "1. 这是一个与现在事实相反的虚拟条件句，基本结构是“If + 动词过去式, 主句 + would + 动词原形”。它用来表达不真实的假设。\n\n2. 关键标志：不论主语是谁(I/she/he)，be动词都用 were。【关联点】注意区分这里的 were 和之前句子中 she was... 的用法，前者是虚拟假设，后者是陈述过去事实。\n\n3. 词汇：alive (活着)，与第一句的 died 意思相反；air views (发表观点)；domestic servants (佣人) 是贯穿全文的核心话题。"
    },
    {
        "english": "Aunt Harriet lived in that leisurely age when servants were employed to do housework.",
        "chinese": "哈丽特生活在一个悠闲的年代，家务事都由雇来的佣人代劳。",
        "note": "1. 句子的核心是 \"when\" 引导的定语从句，它修饰名词 age，解释了“那个年代”的特点。【关联点】这和我们后面遇到的 \"when I was a boy\" 不同，后者是时间状语从句，只说明动作发生的时间。\n\n2. 关键结构是 “were employed to do sth.” (被雇佣来做某事)，这是一个被动语态。【关联点】employed (被雇佣) 与故事结尾贝西被 dismissed (解雇) 形成鲜明对比，预示了故事线。\n\n3. 核心词汇：leisurely (悠闲的)，描绘时代背景；age (时代)，指特定的历史时期，而非年龄。servant (佣人) 是贯穿全文的核心词。"
    },
    {
        "english": "She had a huge, rambling country house called 'The Gables'.",
        "chinese": "她在乡下有一幢巨大杂乱的房子，叫作“山墙庄园”。",
        "note": "1. 核心结构是“名词 + called + 名字”，这里的 called 是过去分词作后置定语，修饰前面的名词 house，意为“一个被叫做……的房子”。这是一种非常简洁高效的命名方式。\n\n2. 【关联点】这种用过去分词作定语的用法，和我们后面遇到的 highly polished silver (被擦亮的银器) 和 bottles neatly stacked (被堆放的瓶子) 类似，都是用过去分词生动地描述事物的状态。\n\n3. 核心词汇：rambling (adj.) 指建筑“杂乱无章的”，也可指讲话“漫无边际的”；country house 指“乡间别墅”。"
    },
    {
        "english": "She was sentimentally attached to this house, for even though it was far too big for her needs, she persisted in living there long after her husband's death.",
        "chinese": "她对这幢房子在感情上难舍难分。房子实在太大了，但在丈夫去世多年后，她仍然执意长年住在那儿。",
        "note": "1. 核心短语：be attached to (感情上依恋)；persist in doing sth. (执意做某事)。【关联点】这里的 persist in (执意) 和后面姑妈 unrelenting search (不懈寻找) 中的 carry on (继续) 意思相近，都表达了坚持，但 persist 更强调固执。\n\n2. 句中连词 for 意为“因为”，用来解释原因。【关联点】这和我们后面遇到的 in that (因为) 用法类似。注意区分表示转折的 even though (即使)，它和课文中的 Though/While 作用相似，都引导让步状语从句。\n\n3. 词汇 death (n. 死亡) 是名词。【关联点】这和我们开篇遇到的动词 die (v. 去世) 形成词性对比。记住“her husband's death”和“my aunt died”的区别。"
    },
    {
        "english": "Before she grew old, Aunt Harriet used to entertain lavishly.",
        "chinese": "哈丽特姑妈年轻时，喜欢大摆宴席，招待宾客。",
        "note": "1. 核心短语 used to do sth. 意为“过去常常做某事”，暗示现在已不再如此。它生动描绘了姑妈过去的生活习惯。【关联点】这和我们后面遇到的 “I often visited...” 表达的“过去经常”异曲同工，都用来追忆往事。\n\n2. 句首的 “Before she grew old” 是一个时间状语从句，为主要故事“大摆宴席”设定了时间背景。【关联点】这和我们后面遇到的 “when I was a boy”, “before she discovered...”, “after being absent” 等用法类似，都是作者用来标记事件顺序、推进故事的重要线索。\n\n3. 核心词汇：entertain lavishly (大摆宴席，慷慨招待)。这揭示了姑妈性格中奢华、讲究排场的一面。【关联点】注意姑妈性格的复杂性：她既有这样慷慨的一面，也有后面提到的 extremely difficult to please (极难取悦) 的另一面。"
    },
    {
        "english": "I often visited The Gables when I was boy.",
        "chinese": "我小时候常去“山墙庄园”作客。",
        "note": "1. 核心是 \"often + 动词过去式\"，用来生动地描述过去经常发生的动作或习惯。【关联点】这和我们之前遇到的 \"used to entertain\" (过去常常招待) 表达方式异曲同工，都是在追忆往事。\n\n2. \"when I was a boy\" 是一个时间状语从句，为主要动作“经常拜访”提供了清晰的时间背景。【关联点】注意区分，这里的 when 只说明时间；而之前 \"age when servants were employed\" 中的 when 是修饰名词 age，解释“那个年代”的特点。"
    },
    {
        "english": "No matter how many guests were present, the great house was always immaculate.",
        "chinese": "不管去多少宾客，大房子里总是收拾得干干净净。",
        "note": "1. 核心句型 “No matter how...” 引导让步状语从句，意为“无论多么...”。【关联点】这和我们之前遇到的 Though, even though, While 作用类似，都表达“虽然...但是...”的转折关系，引出与主句相反的情况。\n\n2. 核心词汇：immaculate (一尘不染的)，精准概括了房子洁净的细节 (shone, gleaming)。present (在场的)，【关联点】这和后面姑妈 being absent (缺席) 意思相反，形成对比。"
    },
    {
        "english": "The parquet floors shone like mirrors; highly polished silver was displayed in gleaming glass cabinets; even my uncle's huge collection of books was kept miraculously free from dust.",
        "chinese": "镶木地板洁如明镜，擦得发亮的银器陈列在明亮的玻璃柜里，连姑夫的大量藏书也保存得很好，奇迹般地一尘不染。",
        "note": "1. 本句用三个由分号连接的并列分句，从地板、银器到藏书，层层递进地描绘了一个极其洁净的环境，营造出强烈的画面感。\n\n2. 核心词汇：shone (闪耀) 和 gleaming (闪亮的) 都强调光洁。【关联点】这正是之前句子中 immaculate (一尘不染) 这个词所概括的景象，这里用具体画面进行了生动诠释。\n\n3. 核心语法：注意被动语态 was displayed (被陈列) 和 was kept (被保持)。【关联点】这和 servants were employed (被雇佣) 用法一致。同时，polished (被擦亮的) 作为形容词，与 a house called... 的用法类似，都是用过去分词描述事物状态。"
    },
    {
        "english": "Aunt Harriet presided over an invisible army of servants that continuously scrubbed, cleaned, and polished.",
        "chinese": "哈丽特姑妈统率着一支看不见的佣人大军，他们不停地擦拭、清扫、刷洗。",
        "note": "1. 核心短语 preside over 意为“掌管，统率”，生动描绘了姑妈如同指挥官般的地位。【关联点】这和后面贝西被 put in charge of (负责管理) 形成对比，前者是最高统帅，后者是具体负责人。\n\n2. 句中 “that continuously scrubbed...” 是一个定语从句，用来修饰前面的名词 servants。【关联点】这和我们之前遇到的 “age when servants were employed” 类似，都是用一个从句来详细描述前面的名词，但这里用 that 指代人，而之前用 when 指代时间。\n\n3. 词汇 invisible (看不见的) 带有夸张色彩，而三个并列动词 scrubbed, cleaned, polished 则具体描绘了佣人永不停歇的工作。【关联点】这些具体动作正是之前提到的房子 immaculate (一尘不染) 的原因，让抽象的“干净”变得具体。"
    },
    {
        "english": "She always referred to them as 'the shifting population', for they came and went with such frequency that I never even got a chance to learn their names.",
        "chinese": "她称这些佣人叫“流动人口”，因为他们来匆匆，所以我甚至都没有机会知道他们的姓名。",
        "note": "1. 核心短语 refer to... as... 意为“把……称作……”。shifting population 指“流动人口”。【关联点】shifting (流动的) 这个词暗示了佣人的不稳定性，这与后面姑妈批评的 fickleness (善变) 在主题上有所呼应。\n\n2. 句中 for 意为“因为”，引出原因。【关联点】这和我们之前遇到的 `...attached to this house, for...` 及 `...enlightened policy, in that...` 用法类似。for 从句的核心是 `such... that...` 结构，表示“如此...以至于...”。\n\n3. 【关联点】注意区分本句的 `such... that...` 和后面将遇到的 `so... that...`。`such` 后接名词短语 (such frequency)，而 `so` 后接形容词或副词 (so gained)，两者都表示强烈的因果关系。"
    },
    {
        "english": "Though my aunt pursued what was, in those days, an enlightened policy, in that she never allowed her domestic staff to work more than eight hours a day, she was extremely difficult to please.",
        "chinese": "姑妈待佣人在当时算是开明的，从来不让佣人每天工作超过8小时，但他们很难使她称心如意。",
        "note": "1. 核心结构是 “Though..., 主句”，表达“虽然...但是...”的转折。【关联点】这和我们之前遇到的 While, even though, No matter how... 作用完全相同，都是引出与主句相反的情况，展现姑妈性格的矛盾。\n\n2. 关键短语 in that 意为“因为，在于”，用来解释前文。【关联点】这和我们之前遇到的 `...attached to this house, for...` 和 `...came and went..., for...` 中的 for 用法类似，都是引出原因。\n\n3. 核心短语 difficult to please (难以取悦) 揭示了姑妈性格的另一面。【关联点】这与她之前 entertain lavishly (慷慨招待) 的形象形成鲜明对比，也解释了为何佣人会成为 a shifting population (流动人口)。"
    },
    {
        "english": "While she always criticized the fickleness of human nature, she carried on an unrelenting search for the ideal servant to the end of her days, even after she had been sadly disillusioned by Bessie.",
        "chinese": "她一方面总是批评人的本性朝三暮四，另一方面她又持之以恒地寻找一个理想的佣人。即使在贝西大大地伤她的心之后，她还在找，一直到她死去。",
        "note": "1. 核心结构是 “While..., 主句”，表达“虽然...但是...”的强烈对比，揭示了姑妈言行不一的矛盾。【关联点】这和我们之前遇到的 Though, even though, No matter how... 作用完全相同，都是用来展现人物或情况的复杂性。\n\n2. 核心词汇：fickleness (善变) 是她批评的对象，而 unrelenting (不懈的) search 则是她自己的行为，两者形成鲜明对比。【关联点】这里的 fickleness (善变) 正是之前提到的 shifting population (流动人口) 现象的根源，主题一脉相承。\n\n3. 核心短语 carry on 意为“继续”。【关联点】这和她之前 persist in living there (执意住在那里) 意思相近，都凸显了她固执、坚持的性格特点。\n\n4. 句末的过去完成时 had been disillusioned 表明“幻想破灭”发生在她“继续寻找”之前，强调了她的执着。【关联点】这和之前客人 had realized... 的用法一致，都是用来清晰地标记过去事件的先后顺序。"
    },
    {
        "english": "Bessie worked for Aunt Harriet for three years.",
        "chinese": "贝西在哈丽特家干了3年。",
        "note": "1. 核心是两个 for 的不同用法：for Aunt Harriet 指服务对象（为谁工作），for three years 指持续时间（工作多久）。【关联点】注意区分 for + 时间段（持续多久）和之前遇到的 ... ago（多久以前的时间点）。\n\n2. worked for 开启了贝西的故事线。【关联点】这与 servants were employed (被雇佣) 意思相近，并与她后来被 put in charge of (负责) 及最终被 dismissed (解雇) 的经历构成完整的故事链。"
    },
    {
        "english": "During that time she so gained my aunt's confidence that she was put in charge of the domestic staff.",
        "chinese": "在此期间，她赢得了姑母的赏识，甚至当上了大管家。",
        "note": "1. 核心句型是 so... that... (如此...以至于...)，用来强调因果关系。so 后面跟副词 (so gained)。【关联点】这和我们之前遇到的 such... that... 类似，但 such 后面跟名词短语 (such frequency)。两者都是表达强烈因果的黄金搭档。\n\n2. 核心短语 put in charge of 意为“负责，掌管”。【关联点】注意区分姑妈的 preside over (统率全局)，贝西的 put in charge of 则是被任命的具体负责人，体现了层级关系。这里的被动语态 was put 也延续了文中常见的用法，如 servants were employed。"
    },
    {
        "english": "Aunt Harriet could not find words to praise Bessie's industriousness and efficiency.",
        "chinese": "哈丽特不知该用什么言辞来赞扬贝西的勤奋与高效。",
        "note": "1. 核心短语 could not find words to do sth. 意为“找不到言辞做某事”，用于表达强烈情感。【关联点】这种极度的赞赏，与后面姑妈感到的 horrified (恐惧) 和 disillusioned (幻想破灭) 等负面情绪形成鲜明对比。\n\n2. 核心词汇 praise (赞扬)。【关联点】这和姑妈常常做的 criticized (批评) 意思相反。而 industriousness (勤奋) 与 efficiency (高效) 则是贝西作为 ideal servant (理想佣人) 的具体体现，与姑妈所鄙夷的 fickleness (善变) 截然不同。"
    },
    {
        "english": "In addition to all her other qualifications, Bessie was an expert cook.",
        "chinese": "贝西除了有各种本领以外，还是一个烹饪大师。",
        "note": "1. 核心短语 in addition to 意为“除……之外，还……”，用于补充信息。本句在描述贝西众多本领(qualifications)的基础上，又增加了一项“烹饪大师”(expert cook)。\n\n2. 【关联点】这和我们之前遇到的 praise Bessie's industriousness and efficiency (赞扬她的勤奋高效)一脉相承，共同塑造了贝西“理想佣人”的形象，为后文的巨大反差埋下伏笔。\n\n3. 句子的主干 Bessie was an expert cook 是我们多次遇到的主谓表结构，用来直接描述人物特征。"
    },
    {
        "english": "She acted the role of the perfect servant for three years before Aunt Harriet discovered her 'little weakness'.",
        "chinese": "她担任“理想仆人”角色3年之后，哈丽特终于发现她有“小小的弱点”。",
        "note": "1. 核心短语 act the role of 意为“扮演……的角色”，暗示了贝西之前的完美表现是一种伪装。词汇 discovered (发现) 则是故事的关键转折点。\n\n2. 核心结构是“主句 + before + 从句”，before 在此意为“……之后才……”，强调主句动作（扮演角色）持续了很长时间，直到从句动作（被发现）发生才终止。\n\n3. 【关联点】这里的 `before` 从句和我们之前遇到的 `Before...`、`when...`、`After...` 等用法类似，都是推进故事时间线的关键。同时，`acted the role` 与之前对她 `industriousness` (勤奋) 的赞美形成讽刺对比，揭示了真相。"
    },
    {
        "english": "After being absent from the Gables for a week, my aunt unexpectedly returned one afternoon with a party of guests and instructed Bessie to prepare dinner.",
        "chinese": "一次，姑妈有一个星期没在“山墙庄园”住。一天下午，她出其不意地回来了，带来一大批客人，吩咐贝西准备晚饭。",
        "note": "1. 句首的 “After being absent...” 是一个时间状语，为姑妈的突然回归设定了背景。【关联点】这和我们之前遇到的 Before..., when... 等用法类似，都是推进故事时间线的关键线索。\n\n2. 核心词汇：absent (缺席的)，【关联点】这和我们之前遇到的 present (在场的) 意思正好相反。a party of guests 指“一群客人”，这里的 party 意为“一伙人”，而非“派对”。\n\n3. 核心结构 instruct sb. to do sth. (吩咐某人做某事)，清晰地展示了姑妈发号施令的权威感。【关联点】这和后面她 never allowed her staff to work... (从不允许她的员工工作...) 中的 allow sb. to do sth. 句型类似，都体现了主人的控制力。"
    },
    {
        "english": "No only was the meal well below the usual standard, but Bessie seemed unable to walk steadily.",
        "chinese": "结果，不仅饭菜远不如平时做得好，而且贝西走起路来似乎东倒西歪。",
        "note": "1. 核心句型是 “Not only..., but...” (不仅...而且...)。当 Not only 置于句首时，前半句必须倒装，即将be动词(was)或助动词置于主语(the meal)之前，以示强调。\n\n2. 【关联点】“below standard” (低于标准) 与之前姑妈赞扬贝西 “industriousness and efficiency” (勤奋高效) 形成强烈反差，是故事急转直下的开端。\n\n3. 【关联点】“seem unable to walk steadily” (似乎走不稳) 为贝西接下来的 “bumped into furniture” (撞到家具) 和 “tripped on the carpet” (被地毯绊倒) 埋下伏笔，揭示了她“小弱点”的具体表现。"
    },
    {
        "english": "She bumped into the furniture and kept mumbling about the guests.",
        "chinese": "她撞到了家具上，嘴里还不断咕咕哝哝议论客人。",
        "note": "1. 核心短语：bump into (撞到)；keep doing sth. (持续做某事)。本句用 and 连接了两个连续动作，生动描绘了贝西醉酒后的失态表现。\n\n2. 【关联点】这个场景是前面 “seemed unable to walk steadily” (似乎走不稳) 的直接后果。同时，这里的 bump into (撞到) 和后面她 tripped on the carpet (被地毯绊倒) 都是她失态的具体表现，形成了一系列连贯的灾难性动作。"
    },
    {
        "english": "When she came in with the last course -- a huge pudding -- she tripped on the carpet and the pudding went flying through the air, narrowly missed my aunt, and crashed on the dining table with considerable force.",
        "chinese": "当她端着最后一道菜——一大盘布丁——走进屋来时，在地毯上绊了一跤。布丁飞到半空，从姑母身边擦过，然后狠狠地砸在餐桌上。",
        "note": "1. 本句用 “When...” 从句设置场景，随后用一连串动词 (tripped, went flying, missed, crashed) 描绘了一场快速、连续的灾难。\n\n2. 核心短语 tripped on (被...绊倒) 是这场混乱的导火索。【关联点】这和我们之前遇到的 she bumped into the furniture (她撞到家具) 类似，都是贝西醉酒后身体失控的具体表现，共同将故事推向高潮。\n\n3. 【关联点】句中用 and 连接多个动词 (went flying, missed, crashed) 的手法，与之前描述佣人 continuously scrubbed, cleaned, and polished 形成鲜明对比：前者描绘了一场混乱的灾难，后者则描绘了有序的日常工作。"
    },
    {
        "english": "Though this caused great mirth among the guests, Aunt Harriet was horrified.",
        "chinese": "这件事引起了客人们的欢笑，但哈丽特却着实吓了一跳。",
        "note": "1. 核心结构是 “Though..., 主句”，表达“虽然...但是...”的转折。本句用它来对比客人的欢笑和姑妈的惊恐，戏剧效果十足。\n\n2. 【关联点】这和我们之前遇到的 `Though my aunt pursued...`, `While she always criticized...` 等用法完全相同，都是引出与主句相反情况的黄金句型，用来展现矛盾与冲突。\n\n3. 核心词汇：mirth (欢笑) vs. horrified (恐惧的)。【关联点】姑妈的 horrified (恐惧) 与她之前对贝西的极度 praise (赞扬) 和后来的 disillusioned (幻想破灭) 情绪一脉相承，共同描绘了她情感的剧烈波动。"
    },
    {
        "english": "She reluctantly came to the conclusion that Bessie was drunk.",
        "chinese": "她不得不认定贝西是喝醉了。",
        "note": "1. 核心短语 come to the conclusion 意为“得出结论”，副词 reluctantly (不情愿地) 则生动描绘了她内心的挣扎。【关联点】这个思考过程，与之前客人 realized (意识到) 和姑妈 discovered (发现) 意思相近，但更强调经过思索才最终认定。\n\n2. 核心句型是“名词 + that 从句”，这里的 that 从句用来解释名词 conclusion 的具体内容。【关联点】注意区分：在 `...discovered that...` 中，that 从句是动词的宾语；在 `...servants that scrubbed...` 中，that 从句是修饰名词的定语从句。"
    },
    {
        "english": "The guests had, of course, realized this from the moment Bessie opened the door for them and, long before the final catastrophe, had had a difficult time trying to conceal their amusement.",
        "chinese": "客人们自然从贝西为他们开门那一刻起就看出来了，在好长一段时间里，即最后这个乱子发生前，他们努力克制才没笑出声来。",
        "note": "1. 核心是过去完成时 had realized 和 had had，表示这两个动作都发生在“最后的乱子”之前。【关联点】这和我们之前遇到的 had been disillusioned 用法一致，用来标记事件先后。特别注意 had had：第一个是助动词，第二个来自短语 have a difficult time。\n\n2. 核心短语 have a difficult time doing sth. (做某事很费劲)，这里指“努力憋笑”。词汇 amusement (好笑)【关联点】这和后面客人感到的 mirth (欢笑) 意思相近。而 realized (意识到) 则与姑妈的 discovered (发现) 和 came to the conclusion (得出结论) 属于同一组“发现”类动词。"
    },
    {
        "english": "The poor girl was dismissed instantly.",
        "chinese": "贝西当即被解雇了。",
        "note": "1. 核心结构是 `was dismissed`，这是一个被动语态，由“be动词 + 过去分词”构成，表示主语“被解雇”。动作的承受者是主语 the poor girl。\n\n2. 【关联点】这和我们之前遇到的 `servants were employed` (佣人被雇佣) 结构完全相同。`employed` (雇佣) 和 `dismissed` (解雇) 意思相反，恰好构成了贝西职业生涯的始末，是故事的关键线索。\n\n3. 核心词汇：`poor` 在此意为“可怜的”，而非“贫穷”，表达同情。`instantly` (立刻) 是副词，强调动作的迅速。"
    },
    {
        "english": "After her departure, Aunt Harriet discovered that there were piles of empty wine bottles of all shapes and sizes neatly stacked in what had once been Bessie's wardrobe.",
        "chinese": "贝西走后，哈丽特姑妈发现在贝西以前用过的衣柜里整整齐齐地放着一堆堆形状各导、大小不一的酒瓶子。",
        "note": "1. 核心结构是 “discovered that...”，that引导宾语从句，说明“发现”的具体内容。【关联点】这和我们之前遇到的 She... came to the conclusion that... 句型类似，that从句都用来解释前面的动词或名词。\n\n2. 从句的核心是 there were... 句型，表示“有，存在”。piles of (一堆堆) 和 of all shapes and sizes (各种形状大小) 都是用来生动描绘瓶子数量多、种类杂的。\n\n3. 核心用法是 neatly stacked (被整齐堆放的)，stacked是过去分词作定语，描述瓶子的状态。【关联点】这和我们之前遇到的 a house called... (被叫做...) 和 highly polished silver (被擦亮的) 用法完全相同，都是用过去分词生动描述事物。\n\n4. what had once been... 意为“那个曾经是...的地方”。过去完成时 had been 表示“衣柜”这个状态发生在“发现”之前。【关联点】这和之前客人 had realized... (早已意识到) 的用法一致，都用来标记一个更早的过去动作。"
    },
    {
        "english": "They had mysteriously found their way there from the wine cellar!",
        "chinese": "这些酒瓶神不知鬼不觉地从酒窖来到了这里。",
        "note": "1. 核心短语 find one's way 意为“设法到达”，常带意外感。副词 mysteriously (神秘地) 强调其过程离奇。【关联点】这和我们之前遇到的 miraculously (奇迹般地) 类似，都形容事件不可思议。注意文中众多-ly副词，它们都生动地描述动作。\n\n2. 核心时态 had found 是过去完成时，表示动作发生在故事的“过去”之前。【关联点】这和之前客人 had realized (早已意识到) 和姑妈 had been disillusioned (早已幻想破灭) 的用法完全相同，都是用来交代主线故事发生前的背景，是讲故事的重要技巧。"
    }
]