[
    {
        "english": "The expensive shops in a famous arcade near Piccadilly were just opening.",
        "chinese": "皮卡迪利大街附近的一条著名拱廊街道上，几家高档商店刚刚开始营业。",
        "note": "1. 核心解析：本句主干是 The shops were opening (商店正在开门)。were just opening (过去进行时) 描绘了过去某个时间点正在发生的背景动作，为故事拉开序幕。in a famous arcade near Piccadilly 则是地点状语，告诉我们故事发生在哪里。\n\n2. 【关联点】本句的 were opening 和后面 Mr. Taylor was admiring (正在欣赏) 都使用了过去进行时，作用相同，都是在描绘故事发生时的背景画面。这种“正在进行”的平静状态，与之后汽车突然 roar (呼啸而过) 的短暂动作形成鲜明对比。\n\n3. 【关联点】注意 arcade (拱廊街) 这个词。在这里，商店正在 arcade 里开门营业；紧接着下一句就告诉我们，这时的 arcade was almost empty (几乎是空的)。通过这个词，我们将故事的场景具体化了。"
    },
    {
        "english": "At this time of the morning, the arcade was almost empty.",
        "chinese": "在早晨的这个时候，拱廊街上几乎空无一人。",
        "note": "1. 核心解析：本句描绘了故事发生时的环境状态。主干是 the arcade was empty (拱廊街是空的)，almost (几乎) 强调了空旷的程度。句首的时间短语 At this time of the morning 交代了背景。\n\n2. 【关联点】这和我们之前遇到的 The shops in a famous arcade... 紧密相连。前一句交代商店在拱廊街开门，这一句立刻补充说明街上几乎没人，通过 arcade 这个词将场景串联起来。\n\n3. 【关联点】almost empty (几乎空无一人) 的宁静状态，与后面 a large car roared down the arcade (一辆大车呼啸而过) 的喧闹形成了强烈对比，为突发事件作铺垫。"
    },
    {
        "english": "Mr. Taylor, the owner of a jewellery shop was admiring a new display.",
        "chinese": "珠宝店主泰勒先生正在欣赏新布置的橱窗。",
        "note": "1. 核心解析：本句主干是 Mr. Taylor was admiring a display。中间插入的 the owner of a jewellery shop 是同位语，如同一个括号里的注释，补充说明了泰勒先生的身份。\n\n2. 【关联点】这和我们之前遇到的 The shops... were opening 类似，都使用了过去进行时。它们共同描绘了故事开始时平静的背景画面，为后续的突发事件做铺垫。\n\n3. 【关联点】注意 display (橱窗) 这个词。泰勒先生先是 admiring a new display (欣赏新橱窗)，不久后我们又读到他 gazing at the display (凝视着橱窗)。这个词串联起了他的动作。"
    },
    {
        "english": "Two of his assistants had been working busily since eight o'clock and had only just finished.",
        "chinese": "他手下两名店员从早上8点就开始忙碌，这时刚刚布置完毕。",
        "note": "1. 核心解析：本句用 and 连接了两个发生在“过去某个时间点”之前的动作。had been working (过去完成进行时) 强调从8点开始的“持续忙碌”过程；而 had only just finished (过去完成时) 则强调“刚刚完成”这个瞬间结果。\n\n2. 【关联点】这和我们之前遇到的 Diamond necklaces... had been beautifully arranged 类似，都使用了过去完成时，表示在故事主要时间点之前就已完成的动作。注意本句是主动语态 (店员自己工作)，而珠宝是被动地“被陈列”。\n\n3. 【关联点】店员们 (assistants) 忙碌布置的，很可能就是泰勒先生之前欣赏的那个 a new display，以及其中 had been beautifully arranged (被漂亮陈列) 的钻石。这几句话共同构建了抢劫发生前的场景。"
    },
    {
        "english": "Diamond necklaces and rings had been beautifully arranged on a background of black velvet.",
        "chinese": "钻石项链、戒指漂亮地陈列在黑色丝绒上面。",
        "note": "1. 核心解析：本句用过去完成时的被动语态 (had been arranged) 描述一种状态。这表示“陈列”这个动作在故事主要情节（如店主欣赏）发生前就已完成，且珠宝是动作的承受者。\n\n2. 【关联点】这和我们之前遇到的 Two of his assistants... had only just finished 类似，都使用了过去完成时，表示动作发生在故事主要时间点之前。注意区分：本句是被动语态（珠宝被陈列），而店员是主动完成工作。\n\n3. 【关联点】本句具体描绘了店员们 (assistants) 刚刚布置完成 (had... finished)、泰勒先生正在欣赏 (was admiring) 的那个新橱窗 (a new display) 里的内容。它将之前的人物、动作和物品串联成一个完整的场景。"
    },
    {
        "english": "After gazing at the display for several minutes, Mr. Taylor went back into his shop.",
        "chinese": "泰勒先生站在橱窗外凝神欣赏了几分钟就回到了店里。",
        "note": "1. 核心解析：本句用 After gazing... 交代了动作的先后顺序：先“凝视”，然后“回去”。gaze at 意为“凝视”，比 look at 更加专注、时间更长。主句是 Mr. Taylor went back... (他回去了)。\n\n2. 【关联点】这和我们之前遇到的 Mr. Taylor was admiring a new display 紧密相连。admire (欣赏) 带有赞美的感情色彩，而这里的 gaze (凝视) 则更强调他看得专注、时间长。两个词描绘了同一场景的不同侧面。\n\n3. 【关联点】注意区分动作顺序。本句的 After... (在...之后) 表示动作有先后。这与后面用 while 和 when 描述的“同时发生”的动作（如 While this was going on...）形成对比，帮助我们理清故事的时间线。"
    },
    {
        "english": "The silence was suddenly broken when a large car, with its headlights on and its horn blaring, roared down the arcade.",
        "chinese": "宁静突然被打破，一辆大轿车亮着前灯，响着喇叭，呼啸着冲进了拱廊街，",
        "note": "1. 核心解析：本句用被动语态 The silence was broken 强调“宁静”这个状态被打破。when 从句则生动描绘了打破宁静的元凶：一辆 roar (呼啸) 的汽车，动静对比强烈。\n\n2. 【关联点】这和我们之前遇到的 the arcade was almost empty 紧密相连。前文铺垫了“几乎空无一人”的宁静，本句的 The silence was suddenly broken 则用巨大的声响将其打破，形成强烈戏剧冲突。\n\n3. 【关联点】注意 with its headlights on 这种用法。它和后面描述窃贼时用的 with black stocking over their faces 结构类似，都是用 with 复合结构来补充细节，让画面更生动。"
    },
    {
        "english": "It came to a stop outside the jeweller's.",
        "chinese": "在珠宝店门口停了下来。",
        "note": "1. 核心解析：固定搭配 came to a stop 意为“停了下来”。主语 It 指代前文呼啸而来的那辆 a large car，点明了这辆不速之客停在了珠宝店门口，预示着接下来的行动。\n\n2. 【关联点】这和我们之前遇到的 Mr. Taylor, the owner of a jewellery shop 紧密相连。汽车停下的地点，正是故事主角泰勒先生的珠宝店，明确了抢劫的目标。\n\n3. 【关联点】注意动作的衔接。前一句车还在 roar down (呼啸而过)，这一句就立刻 came to a stop (停了下来)。一动一静的快速切换，营造了紧张的氛围。"
    },
    {
        "english": "One man stayed at the wheel while two others with black stocking over their faces jumped out and smashed the window of the shop with iron bars.",
        "chinese": "一人留在驾驶座上，另外两个用黑色长筒丝袜蒙面的人跳下车来。他们用铁棒把商店橱窗的玻璃砸碎。",
        "note": "1. 核心解析：本句用 while 连接两个同时发生的动作：一人留在车上 (stayed at the wheel)，另外两人则跳车并砸窗 (jumped out and smashed)。整个句子通过一连串简短的动词，快速描绘了抢劫的瞬间。\n\n2. 【关联点】注意 with black stocking over their faces 的用法。这和我们之前遇到的 with its headlights on 结构类似，都是用 with 复合结构来补充生动的画面细节，让描述更具体。\n\n3. 【关联点】这里的 while 强调动作同时发生。这与之前 After gazing... (表示先后顺序) 和后面 While this was going on... (描述背景与主线同时进行) 形成了时间关系的对比，帮助理解故事节奏。"
    },
    {
        "english": "While this was going on, Mr. Taylor was upstairs.",
        "chinese": "这开始发生时，泰勒先生正在楼上。",
        "note": "1. 核心解析：本句用 While... 交代了故事的另一条线索。当楼下正在发生抢劫 (this was going on) 这个背景事件时，主角泰勒先生正在楼上 (was upstairs)，为他接下来的反应作铺垫。\n\n2. 【关联点】这和我们之前遇到的 One man stayed... while two others jumped out... 类似，都用 while 表示“与此同时”。但注意细微差别：这里 while 引导的是背景事件，而之前那个句子连接的是两个同等重要的主线动作。\n\n3. 【关联点】这紧接上一句 Mr. Taylor went back into his shop。上一句说他“回去”，这一句就点明他回到了 upstairs (楼上)。这解释了他为何没有第一时间发现楼下的抢劫，使情节更合理。"
    },
    {
        "english": "He and his staff began throwing furniture out of the window.",
        "chinese": "他与店员动手向窗外投掷家具，",
        "note": "1. 核心解析：本句重点是 began doing sth. (开始做某事) 句型，生动描绘了店主和店员从静止到激烈反抗的转变。throwing 是动名词，作 began 的宾语。\n\n2. 【关联点】这和我们之前遇到的 Two of his assistants... 紧密相连。assistants (助理) 和这里的 staff (全体店员) 指的是同一群人，他们从布置橱窗的平静工作，转变为一同反击的激烈行动。\n\n3. 【关联点】注意区分：窃贼的目标是拿走店里的 diamonds，而店主则用店里的 furniture (家具) 作为武器向外扔。这两个名词形成了鲜明对比，凸显了现场的混乱与对抗。"
    },
    {
        "english": "Chairs and tables went flying into the arcade.",
        "chinese": "椅子，桌子飞落花流水在拱廊街上。",
        "note": "1. 核心解析：重点是 go + V-ing 结构，如 went flying，生动描绘了“飞速移动”的方式。它比单纯说 moved quickly 画面感强得多。主干是 Chairs and tables went... (椅子桌子移动了)。\n\n2. 【关联点】这和我们之前遇到的 He and his staff began throwing furniture... 紧密相连。前一句是“扔”的主动动作，这一句是从家具的视角，描述“被扔出去”的后果，展现了现场的混乱。\n\n3. 【关联点】注意地点 arcade。这个空间从最初的 almost empty (几乎无人)，到 a car roared down (汽车呼啸而过)，再到现在的 furniture went flying (家具乱飞)，场景的混乱程度在不断升级。"
    },
    {
        "english": "One of the thieves was struck by a heavy statue, but he was too busy helping himself to diamonds to notice any pain.",
        "chinese": "一个窃贼被一尊很重的雕像击中，但由于他忙着抢钻石首饰，竟连疼痛都顾不上了。",
        "note": "1. 核心解析：本句用 but 连接两个对比强烈的场景。前半句是被动语态 was struck (被击中)，后半句是 too...to... 句型，生动描绘窃贼因忙于 help himself to (抢夺) 钻石而忽略了疼痛。\n\n2. 【关联点】这和我们之前遇到的 The silence was broken 类似，都用被动语态描述突发事件。注意区分：这里的 was struck 描述的是对人的动作，而之前 The silence was broken 描述的是对抽象状态的打破。\n\n3. 【关联点】注意区分 be busy doing sth. (忙于做某事) 的用法。这与之前店员 working busily (忙碌地工作) 形成鲜明对比：一方是为工作而忙，另一方则是为抢劫而忙，凸显了场景的戏剧性。"
    },
    {
        "english": "The raid was all over in three minutes, for the men scrambled back into the car and it moved off at a fantastic speed.",
        "chinese": "这场抢劫只持续了3分钟，因为窃贼争先恐后地爬上轿车，以惊人的速度开跑了。",
        "note": "1. 核心解析：本句用 for 解释了抢劫为何只持续3分钟。核心短语 all over (结束了) 交代结果，scramble (争抢着爬) 和 move off (开走) 则生动描绘了窃贼慌乱逃跑的过程，动作一气呵成。\n\n2. 【关联点】这和我们之前遇到的 a car roared down (呼啸而过) 和 came to a stop (停下来) 紧密相连。这三个动词短语完整地描绘了汽车从闯入、停止到 move off (开走) 的全部过程，动作链条清晰。\n\n3. 【关联点】注意 scramble (争抢着爬) 这个词，它描绘了窃贼逃跑时的慌乱。这与他们之前砸窗 (smashed) 时的果断，以及故事开头的平静 (was admiring) 形成了鲜明对比，凸显了现场气氛的急剧变化。"
    },
    {
        "english": "Just as it was leaving, Mr. Taylor rushed out and ran after it throwing ashtrays and vases, but it was impossible to stop the thieves.",
        "chinese": "就在轿车离开的时候，泰勒先生从店里冲了出来，跟在车后追赶，一边还往车上扔烟灰缸、花瓶。但他已无法抓住那些窃贼了。",
        "note": "1. 核心解析：本句用 Just as... 交代关键时刻。主干是 Mr. Taylor rushed out and ran after it (冲出并追赶)。throwing... (现在分词) 生动描绘了伴随动作，而 but it was impossible... 则点明了失败的结局。\n\n2. 【关联点】这和我们之前遇到的 After gazing... (先后) 以及 while (同时) 形成对比。Just as 强调动作发生在另一动作“正要...”的精准瞬间，戏剧性更强。\n\n3. 【关联点】注意 it was impossible to stop the thieves (无法阻止) 这个失败的结果。这直接导致了故事的最终结局：They had got away with... (他们带着赃物逃走了)。"
    },
    {
        "english": "They had got away with thousands of pounds worth of diamonds.",
        "chinese": "他们已带着价值数千镑的首饰逃之夭夭了。",
        "note": "1. 核心解析：本句是故事的结局。核心短语 get away with 意为“带着赃物成功逃脱”。过去完成时 had got away... 表示在故事结束时，“逃走”这个动作已经完成，交代了最终结果。\n\n2. 【关联点】这和我们之前遇到的 it was impossible to stop the thieves 紧密相连。前一句交代了“无法阻止”的原因，本句则直接给出了“成功逃脱”的结果，形成清晰的因果链条。\n\n3. 【关联点】注意区分过去完成时的用法。之前 had been arranged (被陈列) 等表示抢劫发生“前”的背景，而这里的 had got away 则表示抢劫发生“后”的最终结局，为整个故事画上句号。"
    }
]