[
    {
        "english": "The river which forms the eastern boundary of our farm has always played an important part in our lives.",
        "chinese": "形成我们农场东部边界的一条河流一直在我们生活中发挥着重要作用。",
        "note": "1. 核心短语：play an important part in 意为“在…中扮演重要角色”，是描述影响力的常用搭配。例如，科技在现代生活中扮演着重要角色 (Technology plays an important part in modern life)。\n\n2. 句型解析：这是一个“主句+定语从句”结构。主句是 The river... has always played an important part... (河流发挥了重要作用)。而 which forms... farm 是一个补充说明，像个小标签，紧跟在 river 后面，具体解释是“哪一条”河。\n\n3. 【关联点】这里的 which 用来指代事物（river），这和我们之后遇到的“...the boathouse, which a predecessor... built...”用法完全相同。注意区分，之后我们还会学到用 who/whose 来指代人。"
    },
    {
        "english": "Without it we could not make a living.",
        "chinese": "要是没有这条河，我们就无法生存下去。",
        "note": "1. 核心短语：make a living 意为“谋生，维持生计”，是一个非常地道的表达。它形象地说明了为了生存需要去创造（make）生活所需。\n\n2. 句型解析：这是一个由\"Without\"引导的含蓄虚拟条件句。\"Without it\"相当于\"If we did not have it\"，表示与现在事实相反的假设，因此主句使用\"could not\"。\n\n3. 【关联点】这和我们之后遇到的“...if...were not related to it”类似，都是对现在情况的假设。同时注意区分之后学到的“...house...would have stood stoutly...”，那是对过去情况的假设。"
    },
    {
        "english": "There is only enough spring water to supply the needs of the houses, so we have to pump from the river for farm use.",
        "chinese": "泉水只能满足家庭生活用水，因此我们必须从河里抽水以用于农业生产。",
        "note": "1. 核心词组：supply the needs of (供应…的需求) 是固定搭配。have to pump (必须抽水) 则强调了动作的必要性，表达一种强制或客观要求。\n\n2. 句型解析：这是一个由 so 连接的因果复合句。前半句用经典的 There be 句型点明原因（泉水只够...），后半句清晰地引出结果（所以我们必须...）。\n\n3. 【关联点】本句用 so 引出“结果”。这和我们之后遇到的 “...as our climate seldom gets to extremes” 中用 as 引出“原因”的用法正好相反，但都用于构建因果关系。注意区分和共同记忆。"
    },
    {
        "english": "We tell river all our secrets.",
        "chinese": "我们向那条河倾诉我们的秘密。",
        "note": "1. 句型解析：这是一个“主谓双宾”句型 (S+V+o+O)，结构为“告诉+对象+内容”。这里将 river 拟人化，当作可以倾诉秘密的朋友，传递了一种深厚的情感。\n\n2. 【关联点】这和我们之前遇到的“...if the important events of our lives were not related to it”形成了呼应。本句具体说明了人们是如何将生活大事“关联”到河上的——通过“倾诉秘密”这种方式。"
    },
    {
        "english": "We know instinctively, just as beekeepers with their bees, that misfortune might overtake us if the important events of our lives were not related to it.",
        "chinese": "我们本能地懂得，就像养蜂人和他的蜜蜂那样，要是我们不把生活中的重大的事件告诉那条河，就可能大祸临头。",
        "note": "1. 核心短语：misfortune might overtake us 意为“不幸可能突然降临”。overtake 在此非“超车”，而是指坏事“突然发生，压倒我们”。\n\n2. 句型解析：核心是 if... were not... 引导的虚拟条件句，表示与现在事实相反的假设。主句用 might overtake 表达一种不确定的、推测性的后果。\n\n3. 【关联点】本句的 if... were not... 虚拟用法，和我们遇到的 Without it... (相当于 If we did not have it...) 类似。它也解释了为何要将生活与河“关联”，具体方式就是我们学过的 We tell river all our secrets。"
    },
    {
        "english": "We have special river birthday parties in the summer.",
        "chinese": "夏天，我们为这条河举办特殊的生日宴会。",
        "note": "1. 核心词汇：have 在此意为“举办”，相当于 hold 或 organize，常用于指代活动或事件。例如：have a meeting (开会)。\n\n2. 【关联点】注意区分 have 的多种用法。本句中是“举办”，但在我们遇到的 “...we have to pump...” 中，have to 意为“必须”，表示一种客观需要。小词多义是英语学习的关键。\n\n3. 句型与主题：本句描述了在夏天进行的活动。这和我们之后遇到的 “...crowning... in the spring, ...holding... on Midsummer Eve, ...giving thanks... in the autumn, and throwing... in the winter” 共同构成了一幅家庭与河流在四季中紧密相连的温馨画面。"
    },
    {
        "english": "Sometimes were go upstream to a favourite backwater, sometimes we have our party at the boathouse, which a predecessor of ours at the farm built in the meadow hard by the deepest pool for swimming and diving.",
        "chinese": "有时，我们溯流而上来到我们喜爱的回水河汊举办；有时在船坞举办。那船坞是农场一位前辈在一块草地上盖的，草地紧挨着一个专供游泳、跳水的深水池。",
        "note": "1. 句型解析：句子由两个 Sometimes... 并列展开，生动描绘了两种聚会选择：有时溯流而上，有时在船坞举办。这种并列结构使描述富有节奏感。\n\n2. 核心词组与定语从句：hard by 意为“紧邻”，比 near 更贴近。which...built... 是一个定语从句，像一个补充说明，详细介绍了船坞的来历和位置。\n\n3. 【关联点】这里的 which 用法和我们遇到的 The river which... 完全一致，都用来修饰事物。注意区分之后遇到的 whose/who 用来指代人。同时，这里的 have our party 和 have... parties 一样，都意为“举办”。"
    },
    {
        "english": "In a heat wave we choose a midnight birthday party and that is the most exciting of all.",
        "chinese": "天气炎热时，我们便选择在半夜举办生日聚会，这种聚会是最令人激动的。",
        "note": "1. 句型解析：本句由 and 连接两个部分，前句描述行为（选择午夜派对），后句表达评价。that 指代前文的 a midnight birthday party，使前后联系紧密。\n\n2. 核心用法：the most exciting of all 是形容词最高级，用来在多个事物中选出“最…”的一个，强调其突出程度。of all 明确了比较范围是“所有一切中”。\n\n3. 【关联点】最高级用法和我们遇到的 the deepest pool (最深的池子)、the youngest girl (最年轻的女孩) 完全一致，都是“the + 形容词最高级”结构。\n\n4. 【关联点】注意区分：exciting 形容事物（派对令人激动），而之后遇到的 worried 或 exhausted 则形容人（我们感到担心/筋疲力尽）。-ing 形容物，-ed 形容人。"
    },
    {
        "english": "We welcome the seasons by the riverside, crowning the youngest girl with flowers in the spring, holding a summer festival on Midsummer Eve, giving thanks for the harvest in the autumn, and throwing a holy wreath into the current in the winter.",
        "chinese": "我们在河边迎接一年四季。春天在河边为最年轻的姑娘戴上花冠，夏天在河边欢庆“仲夏前夜”，秋天在河边丰收而感恩，冬天往河中抛撒一个冬表花环。",
        "note": "1. 句型解析：核心结构为“主句 + 四个并列的-ing短语”。这些-ing短语生动地描绘了主句动作“welcome”的具体方式，如同电影分镜。\n\n2. 核心词汇：crown (加冕) 由名词“王冠”活用为动词，形象地表达出“为…戴上花冠”的珍视感。这个词让整个画面充满仪式感。\n\n3. 【关联点】本句详细描绘了四季的活动，是对之前“We have special river birthday parties in the summer”一句的完美补充和展开，共同构建了一幅人与自然和谐共处的画面。\n\n4. 【关联点】注意区分：这里的-ing短语作状语，说明“我们如何迎接四季”。这和我们之后遇到的“...a raft appeared, looking...carrying...”中，-ing短语作定语修饰名词“raft”的用法不同。"
    },
    {
        "english": "After a long period of rain the river may overflow its banks.",
        "chinese": "久雨这后，河水会泛滥成灾，",
        "note": "1. 核心词组：overflow its banks 意为“（河水）溢出河岸，泛滥”。overflow 生动地描绘了水满溢出的动态，而 banks 在此特指“河岸”，而非银行。\n\n2. 句型解析：这是一个典型的“原因+结果”结构。After a long period of rain 是原因，the river may overflow... 是可能发生的结果。may 表示一种可能性。\n\n3. 【关联点】本句描述的“河水泛滥”是一种潜在的自然现象。这和我们之后遇到的 “This is a rare occurrence...” (这是一件罕见的事) 形成了呼应，后者对这种现象的发生频率做出了评价。"
    },
    {
        "english": "This is a rare occurrence as our climate seldom guest to extremes.",
        "chinese": "但是在我们这里，气候很少发生异常，河水极少泛滥。",
        "note": "1. 核心词组：seldom gets to extremes 意为“很少达到极端情况”，指气候很少变得极热或极冷。seldom 是一个否定频率副词，表示“几乎不”。\n\n2. 句型解析：本句由 as (因为) 连接，解释了“这是一件罕见之事”的原因。as 在此引导原因状语从句，用法与 because 类似。\n\n3. 【关联点】这和我们之前遇到的 “...so we have to pump...” 正好相反。so 用于引出“结果”，而本句的 as 用于引出“原因”，两者共同构成了因果关系的表达。\n\n4. 【关联点】本句是对之前 “...the river may overflow its banks” 这一现象的评价。那一句描述了可能发生的洪水，这一句则点明这种事在我们这里是“罕见的”。"
    },
    {
        "english": "We are lucky in that only the lower fields, which make up a very small proportion of our farm, are effected by flooding, but other farms are less favorably sited, and flooding can sometimes spell disaster for their owners.",
        "chinese": "值得庆幸的是，只有低洼的受到洪水影响，而低洼地在我们农场比例很小。其他农场地势欠佳，洪水有时会给农场主带来灾难。",
        "note": "1. 核心用法：in that 用于解释“我们幸运”的原因。spell disaster 意为“招致灾难”，生动描绘了洪水的破坏力。整个句子通过 but 和 and 清晰对比了“我们”与“他人”的处境。\n\n2. 【关联点】句中 which make up... 的用法，和我们遇到的 The river which... 完全一致。同时，spell disaster 与 misfortune might overtake us 及 The first sign of disaster 共同揭示了河流作为生命之源也潜藏着危险的一面。"
    },
    {
        "english": "One had winter we watched the river creep up the lower meadows.",
        "chinese": "有一年冬天，天气不好，我们眼看着河水浸没了地势较低的草场。",
        "note": "1. 核心词汇：creep (缓慢移动) 一词极为传神，生动描绘了河水如爬行般悄然上涨的动态过程，充满了视觉张力。\n\n2. 句型解析：核心是“主语+感官动词(watch)+宾语(river)+动词原形(creep)”。这个结构强调目睹了动作的完整过程，表达“眼睁睁看着河水浸没了草场”。\n\n3. 【关联点】注意区分动词用法。本句用 creep (原形) 表示看到了河水上涨的“全过程”。这和我们之后遇到的 “...a dead sheep floating down” 不同，floating (-ing) 强调的是看到动作正在“进行中”的某个片段。"
    },
    {
        "english": "All the cattle had been moved into stalls and we stood to lose little.",
        "chinese": "所有的牲口已提前转移到畜圈里，没有造成什么损失。",
        "note": "1. 核心短语：stand to lose little 意为“几乎没什么可损失的”。stand to do sth. 表示“有可能/面临做某事”，而 little 在此是近乎否定的“很少”。\n\n2. 句型解析：had been moved 是过去完成时被动语态，表示“移动牲口”这个动作发生在故事主要时间点（如洪水到来）之前，是预先采取的措施。\n\n3. 【关联点】过去完成时的用法，和我们之后遇到的 “...the floods had put the telephone out of order” 类似，都强调动作发生在另一个过去动作之前。"
    },
    {
        "english": "We were, however, worried about our nearest neighbors, whose farm was low lying and who were newcomers to the district.",
        "chinese": "不过，我们很为我们的近邻担心。他们的农场地势低洼，而且他们又新来乍到。",
        "note": "1. 句型解析：核心结构为“主句 + 两个并列定语从句”。whose farm... 和 who were... 像两个补充标签，同时贴在 neighbors 身上，分别说明“他们的农场”和“他们是怎样的人”。\n\n2. 【关联点】注意区分：这和我们之前遇到的 The river which... 用法不同。which 指代事物，而本句的 whose (谁的) 和 who (谁) 则专门用来指代人，这是本课的一个重要升级。\n\n3. 【关联点】注意区分：worried 形容人“感到担心的”(-ed结尾)，这和我们之前遇到的 exciting 形容派对“令人激动的”(-ing结尾)用法正好相对。-ed形容人，-ing形容物。"
    },
    {
        "english": "As the floods had put the telephone out of order, we could not find out how they were managing.",
        "chinese": "由于洪水造成了电话中断，我们无法了解他们情况。",
        "note": "1. 核心短语与时态：put... out of order 意为“使…出故障”。had put 是过去完成时，表示“电话中断”这个动作发生在“我们无法了解情况”这一过去动作之前。\n\n2. 【关联点】过去完成时的用法，和我们之前遇到的 All the cattle had been moved... 类似，都强调一个动作先于另一个过去动作完成。\n\n3. 句型解析：本句由 As (因为) 引导原因状语从句，说明了“无法了解情况”的原因。\n\n4. 【关联点】这和我们遇到的 ...as our climate seldom gets to extremes 用法一致，都用 as 引出原因。注意与 ...so we have to pump... 中用 so 引出结果的用法进行对比记忆。"
    },
    {
        "english": "From an attic window we could get a sweeping view of the river where their land joined ours, and at the most critical juncture we took turns in watching that point.",
        "chinese": "从顶楼窗口看去，我们农场与他们农场接壤处的那段河流一览无余。在最紧急的时刻，我们轮流监视那段河流的险情。",
        "note": "1. 核心短语：get a sweeping view (一览无余)，take turns in doing sth (轮流做某事)。\n\n2. 句型要点：where 引导定语从句，像个小标签，具体说明是“哪一段”河流。\n\n3. 【关联点】the most critical juncture 是最高级用法，和我们遇到的 the deepest pool, the most exciting 用法完全一致。"
    },
    {
        "english": "The first sign of disaster was a dead sheep floating down.",
        "chinese": "灾难的第一迹象是一只死羊顺流而下，",
        "note": "1. 核心词汇：disaster (灾难)。本句点明了“灾难的第一个迹象”。【关联点】这和我们遇到的 misfortune might overtake us (不幸降临) 和 spell disaster (招致灾难) 共同揭示了河流潜藏的危险一面。\n\n2. 句型解析：核心是“主语+was+表语”结构，即“迹象 = 一只正在漂浮的羊”。floating down (-ing形式) 用作定语，修饰 sheep，强调其动态。\n\n3. 【关联点】注意区分：这里的 floating (-ing) 强调看到动作正在“进行中”的片段。这和我们之前遇到的 we watched the river creep (原形) 不同，后者用动词原形表示看到了动作的“全过程”。"
    },
    {
        "english": "Next came a horse, swimming bravely, but we were afraid that the strength of the current would prevent its landing anywhere before it became exhausted.",
        "chinese": "接着一匹活马勇敢地与水搏击。但我们担心，洪水力量将使它上岸之前就筋疲力尽了。",
        "note": "1. 句型解析：“Next came a horse”是倒装句，将时间副词置于句首，强调顺序，使叙述更生动。正常语序是“A horse came next”。\n\n2. 核心结构与词汇：prevent its landing (阻止它登陆)，即“prevent + 名词/动名词”。current 指“水流”。【关联点】这和我们遇到的 “...throwing a holy wreath into the current” 中的 current 是同一个词。\n\n3. 分词用法：swimming bravely 是现在分词短语，修饰马的状态。【关联点】这和我们之后遇到的 “...a raft appeared, looking... carrying...” 用法类似，都是用-ing短语来生动描绘名词。\n\n4. 核心词汇：exhausted 意为“筋疲力尽的”。【关联点】注意区分：exhausted 形容马“感到筋疲力尽的”，这和我们之前遇到的 worried (感到担心的) 用法一致，都是-ed结尾形容感受。注意与 exciting (令人激动的) 这类-ing结尾形容事物的词区分。"
    },
    {
        "english": "Suddenly a raft appeared, looking rather like Noah's ark, carrying the whole family, a few hens, the dogs, cat, and bird in a cage.",
        "chinese": "突然，出现了一只筏子，看起来很像诺亚方舟，上面载着他们全家老小，还有几只母鸡、几只狗，一只猫与一只鸟笼，那里头有一只小鸟。",
        "note": "1. 句型解析：核心结构为“主句 + 两个-ing短语”，如同两个镜头，一个描绘筏子的外貌(looking...)，一个描绘其内容(carrying...)。\n\n2. 【关联点】这种用法和我们之前遇到的 a dead sheep floating down 以及 a horse, swimming bravely... 类似，都是用-ing短语生动地描绘名词。\n\n3. 【关联点】注意区分：这里的-ing短语作定语修饰名词raft。这和我们遇到的 We welcome the seasons..., crowning... 中，-ing短语作状语说明“如何迎接”的用法不同。"
    },
    {
        "english": "We realized that they must have become unduly frightened by the rising flood, for their house, which had sound foundations, would have stood stoutly even if it had been almost submerged.",
        "chinese": "我们意识到他们一定是被不断上涨的洪水吓坏了。因为他们的房子地基牢固，即使洪水几乎灭顶也不会倒塌。",
        "note": "1. 核心句型(1)：must have become 意为“一定已经变得…”，是对过去情况的肯定推测。unduly (过度地) 强调了这种害怕是不必要的。\n\n2. 核心句型(2)：...would have stood... even if it had been... 是对过去情况的虚拟假设，表示“即使当时…本来也会…”，与事实相反。\n\n3. 【关联点】注意区分：这和我们之前遇到的 Without it we could not... (对现在的虚拟) 不同。本句是对“过去”的虚拟，时态更进一步。\n\n4. 【关联点】句中的 for 意为“因为”，用于补充说明推测的理由。这和我们遇到的 as our climate... 用法类似，都是引出原因。"
    },
    {
        "english": "The men of our family waded down through our flooded meadows with boathooks, in the hope of being able to grapple a corner of the raft and pull it out of the current towards our bank.",
        "chinese": "我家的男人们手拿船篙过被水淹没草场，希望能够钩住筏子一角，将它拽出激流，拖回岸边。",
        "note": "1. 核心短语：in the hope of doing sth. 意为“怀着…的希望”，清晰点明了整个行动的目的。wade (涉水) 和 grapple (钩住) 这两个动词生动描绘了在洪水中救援的艰难画面。\n\n2. 【关联点】本句的 raft (木筏) 和 current (激流)，与之后出现的邻居一家乘坐的 raft 和马儿搏斗的 current 形成了前后呼应，共同展现了洪水的险情。"
    },
    {
        "english": "We still think it a miracle that they we able to do so.",
        "chinese": "他们终于成功了。至今我们仍认为这是个奇迹。",
        "note": "1. 句型解析：核心是“think it + 名词/形容词 + that从句”结构。it 是形式宾语，真正要说明的事由 that 从句引出。这种结构常用于表达对某件事的看法或评价。(句中we应为were)\n\n2. 【关联点】这个“主谓宾补”结构，和我们遇到的 ...the floods had put the telephone out of order (使电话出故障) 类似。都是在宾语后加一个补语说明其状态。\n\n3. 【关联点】注意区分：本句用 it 作形式宾语。这和我们遇到的 We realized that... 不同。在 realize, know 等动词后，that从句可直接作宾语，无需形式宾语 it。"
    }
]