[
    {
        "english": "People will do anything to see a free show -- even if it is a bad one.",
        "chinese": "人们总要想尽办法看不花钱的演出——哪怕是拙劣的演出。",
        "note": "1. 核心短语：do anything 意为“不惜一切代价”，强调意愿之强。even if 意为“即使”，引出让步条件，突出人们对“免费”这件事的执着。\n\n2. 句法亮点：句末的 one 代指前文的 show，这是避免重复、让表达更简洁的常用技巧。 【关联点】 这和我们第一句遇到的 ...rushed to see it 中的 it 功能相似，都是用简单的代词指代核心事物“演出”，使语言更流畅。"
    },
    {
        "english": "When the news got round that a comedy show would be presented at our local cinema by the P. and U. Bird Seed Company, we all rushed to see it.",
        "chinese": "当“皮尤”鸟食公司将在我们当地影院演出喜剧节目的消息传开后， 我们都赶紧跑去观看。",
        "note": "1. 核心短语：get round 形象地表示消息“传开”；rush to do sth. 强调动作的急切。would be presented 意为“将被上演”，是被动语态。\n\n2. 句法亮点：句子主体是 \"we rushed to see it\"，前面是 When 引导的时间状语从句。其中，that 从句用于解释 the news 的具体内容，是典型的同位语从句。\n\n3. 【关联点】 句尾的 it 指代 a comedy show，这和我们第一句遇到的 a bad one 功能相似，都是避免重复。同时，注意区分这里的动词 present (演出) 和之前遇到的形容词 present (出席的)。"
    },
    {
        "english": "We had to queue for hours to get in and there must have been several hundred people present just before the show began.",
        "chinese": "我们不得不排了好几个小时才进得场去。在演出开始前场内肯定已有好几百人了。",
        "note": "1. 核心短语：had to queue 意为“不得不排队”，强调一种必要性。must have been 用于对过去的肯定推测，意为“肯定已经...”。present 在此是形容词，意为“出席的，在场的”。\n\n2. 句法亮点：句子由 and 连接两个部分，前半句描述“我们”的动作，后半句用 there be 句型描述现场情况。\n\n3. 【关联点】 注意区分这里的形容词 present (出席的)，和我们之前遇到的动词 present (上演)。\n\n4. 【关联点】 must have been 属于“情态动词+have done”结构。这和我们之后遇到的 should have done (本该做) 和 need not have done (本不必做) 类似，都是对过去发生事情的评论或推测。"
    },
    {
        "english": "Unfortunately, the show was one of the dullest we have ever seen.",
        "chinese": "不幸的是，这次演出是我们看过的最乏味的演出了。",
        "note": "1. 核心句型：“one of the + 形容词最高级”，意为“最...之一”。dullest 是 dull (乏味的) 的最高级形式。\n\n2. 语法亮点：“最高级 + (that) + 主语 + have ever done”是黄金搭档，用来表达“有史以来最...”的经历。这里的 have ever seen 就是在限定“最乏味”的范围。\n\n3. 【关联点】 句末的 \"we have ever seen\" 是一个省略了引导词 that 的定语从句。这和我们之后遇到的 \"The only funny things we heard...\" 结构完全相同，都是用来修饰前面的事物。"
    },
    {
        "english": "Those who failed to get in need not have felt disappointed, as many of the artistes who should have appeared did not come.",
        "chinese": "那些没能进到场内的人没有必要感到失望，因为很多应该出场的专业演员都没有来。",
        "note": "1. 核心短语：need not have done 意为“本不必做（但做了）”，表示多此一举。should have done 意为“本该做（但没做）”，表示遗憾或责备。两者形成鲜明对比。\n\n2. 句法亮点：句子结构为“结果 + as (因为) + 原因”。主句中的 Those who... 和原因从句中的 artistes who... 都是定语从句，用来限定“是哪些人”。\n\n3. 【关联点】 这两个短语与我们之前遇到的 must have been (肯定已经...) 都属于“情态动词+have done”结构，都用于评论或推测过去发生的事。"
    },
    {
        "english": "The only funny things we heard that evening came from the advertiser at the beginning of the programme.",
        "chinese": "那天晚上唯一有趣的事情是节目开始时那个报幕员的开场白。",
        "note": "1. 核心短语：came from 意为“源自，来自”，是 come from 的过去式，点明了笑话的来源。\n\n2. 句法亮点：本句主语很长 (The only funny things we heard that evening)，核心是 things。后面的 we heard that evening 是一个省略了引导词 that 的定语从句，用来修饰 things。\n\n3. 【关联点】 这种省略引导词的定语从句，和我们之前遇到的 ...the dullest we have ever seen 结构完全相同，都是用来限定说明前面的事物。"
    },
    {
        "english": "He was obviously very nervous and for some minutes stood awkwardly before the microphone.",
        "chinese": "他显然非常紧张，局促不安地在麦克风前站了好几分钟。",
        "note": "1. 句法亮点：句子由 and 连接两个并列部分。前半句 He was obviously very nervous 是“主谓表”结构，描述其“紧张”的状态；后半句 (He) stood awkwardly 是“主谓”结构，描绘其“局促”的动作。\n\n2. 【关联点】 副词 obviously 和我们之前遇到的 Unfortunately 类似，都用于对整个句子进行评价或设定基调。同时，形容词 nervous (紧张的) 和 disappointed (失望的) 用法也一致，都用来描述人物感受。"
    },
    {
        "english": "As soon as he opened his mouth, everyone burst out laughing.",
        "chinese": "但他刚一开口说话，人们便哄堂大笑起来。",
        "note": "1. 核心短语：As soon as 意为“一...就...”，强调动作的即时触发。burst out laughing 意为“哄堂大笑”，形象地表达了突然且无法抑制的笑声。\n\n2. 句法亮点：这是一个由 As soon as 引导的时间状语从句，清晰地展示了“开口”这个动作如何立刻引发了“大笑”这个结果。\n\n3. 【关联点】 这句的大笑正是对上一句中他 obviously very nervous (显然很紧张) 的直接反应。同时，As soon as 和我们遇到的 When 类似，都引导时间状语从句，但它最强调动作的即时性。"
    },
    {
        "english": "We all know what the poor man should have said, but what he actually said was: 'This is the Poo and Ee Seed Bird Company. Good ladies, evening and gentlemen!\"",
        "chinese": "我们都明白那个可怜的人应该说些什么，而他实际说的却是：“这是‘浦伊’鸟食公司，好女士们，晚上和先生们！”",
        "note": "1. 核心短语：should have said 意为“本该说（但没说）”，与 what he actually said（他实际说的）形成鲜明对比，揭示了“理想”与“现实”的差距。\n\n2. 【关联点】 这和我们遇到的 should have appeared (本该出现) 和 need not have felt (本不必感觉) 属于同一语法家族，都是“情态动词+have done”结构，用来评论过去。\n\n3. 【关联点】 这里的 poor 意为“可怜的”，表达同情。这和我们之前遇到的 nervous (紧张的) 和 disappointed (失望的) 类似，都是用来描述人物状态或感受的词。"
    }
]