[
    {
        "english": "Dentists always ask questions when it is impossible for you to answer.",
        "chinese": "牙科医生们总是在你无法作出回答的时候向你提出问题。",
        "note": "1. 核心句型是 “It is impossible for you to answer”，这是一个固定搭配，意为“对某人来说做某事是...的”。这里的 it 是形式主语，真正的主语是后面的 to answer。\n\n2. 【关联点】本句点明了“无法回答”的客观原因。这和我们之后遇到的“I tried to say something, but...”以及“could not say anything”形成了因果呼应，生动描绘了主角想说却说不出的窘境。\n\n3. 【关联点】这里的 ask questions 是泛指“提问”这一行为。注意对比后面牙医提出的具体问题：“...asked me whether...”和“...asked me how...”。从泛指到特指，让情节更具体。"
    },
    {
        "english": "My dentist had just pulled out one of my teeth and had told me to rest for a while.",
        "chinese": "我的牙科医生刚刚给我拔掉了一颗牙，叫我休息一会儿。",
        "note": "1. 句子的核心由 and 连接了牙医的两个动作：had pulled out a tooth (拔牙) 和 had told me to rest (叫我休息)。其中 tell someone to do something (吩咐某人做某事) 是一个非常实用的句型。\n\n2. 【关联点】本句的 pull out (拔出) 与结尾高潮处的 he had pulled out the wrong tooth (他拔错了牙) 形成关键呼应，是整个故事的核心动作。\n\n3. 【关联点】两个动作都用了过去完成时 (had done)，表示它们发生在故事主要时间点之前。这与后面 “where the tooth had been” (牙齿曾经在的地方) 的时态用法一致，共同构建了事件的先后顺序，为后续的“发现错误”埋下伏笔。"
    },
    {
        "english": "I tried to say something, but my mouth was full of cotton wool.",
        "chinese": "我想说点什么，但我嘴里塞满了药棉。",
        "note": "1. 核心结构是“I tried to do..., but...”，这是一个经典句型，生动描绘了主角的内心意图与现实阻碍之间的冲突。前半句表达“努力尝试”，后半句用 be full of... (充满...) 解释了尝试失败的直接原因。\n\n2. 【关联点】这句生动地解释了第一句 “it is impossible for you to answer” (你无法回答) 的具体原因——嘴里塞满了棉花。它将抽象的“不可能”具象化，让读者身临其境，也为结尾“removed the cotton wool”后真相大白埋下伏笔。\n\n3. 【关联点】注意主角沟通状态的演变：从本句的 tried to say (尝试说但失败)，到后面的 could not say anything (彻底说不出)，再到结尾的 was able to tell (终于能说)。这一系列变化构成了故事的核心戏剧冲突。"
    },
    {
        "english": "He knew I collected match boxes and asked me whether my collection was growing.",
        "chinese": "他知道我收集火柴盒，于是问我收藏的米柴盒是否在增加。",
        "note": "1. 本句核心是转述一个“是否”类问题，句型为 ask someone whether... (问某人是否...)。同时注意动词 collect (收集) 和名词 collection (收藏品) 的词性变化，它们是同根词。\n\n2. 【关联点】这和我们稍后遇到的 “...asked me how... and whether...” 句型完全一样，都是 “ask + 宾语 + 疑问从句” 的结构，是间接引语的典型用法，将直接提问转为陈述。\n\n3. 【关联点】本句是课文第一句 “Dentists always ask questions...” 的具体例证。牙医基于 “knew” (了解) 的信息，发起了 “asked” (提问) 的行为，生动展现了那个“无法回答”的尴尬场景。"
    },
    {
        "english": "He then asked me how my brother was and whether I liked my new job in London.",
        "chinese": "接着他又问我的兄弟近来如何，问我是否喜欢伦敦的新工作。",
        "note": "1. 核心结构是用 and 连接了两个宾语从句，转述了两个不同类型的问题：一个是特殊疑问句 (how...)，另一个是一般疑问句 (whether...)。\n\n2. 【关联点】这个句型结构与我们之前遇到的 “...asked me whether my collection was growing” 完全一致，都是 “ask + 宾语 + 疑问从句” 的用法，巩固了间接引语的知识点。\n\n3. 【关联点】本句是开篇 “Dentists always ask questions” 的又一个具体例证。牙医接连提出两个具体问题，生动地再现了那个“无法回答”的尴尬场景，使故事的戏剧性不断升级。"
    },
    {
        "english": "In answer to these questions I either nodded or made strange noises.",
        "chinese": "作为对这些问题的回答，我不是点头，就是发出奇怪的声音。",
        "note": "1. 核心句型是 either... or... (不是...就是...)，用于连接两个并列的选项。本句中，它连接了主角的两种非语言回应：nodded (点头) 和 made strange noises (发出奇怪的声音)。\n\n2. 【关联点】句首的 In answer to these questions (作为对这些问题的回答) 直接回应了牙医之前提出的 ...asked me whether... 和 ...asked me how... 等一连串问题，将对话的问与答串联起来。\n\n3. 【关联点】这和我们之前遇到的 I tried to say something (我想说话) 形成鲜明对比。由于嘴里塞着棉花，主角无法用语言回答，只能选择 nodded (点头) 或 made strange noises (发出怪声) 这种非语言方式。"
    },
    {
        "english": "Meanwhile, my tongue was busy searching out the hole where the tooth had been.",
        "chinese": "与此同时，我的舌头正在忙着寻找刚拔掉的那颗牙的伤口。",
        "note": "1. 核心句型是 be busy doing sth. (忙于做某事)，生动描绘了舌头下意识的动作。where the tooth had been 是一个定语从句，用来具体描述 the hole (牙洞) 的位置。\n\n2. 【关联点】这里的过去完成时 had been (曾经在)，与我们之前遇到的 had pulled out (已拔掉) 时态一致。它们共同强调这些动作都发生在“舌头寻找”这个主要故事时间点之前，清晰地交代了事件背景。\n\n3. 【关联点】这个“寻找牙洞”的动作，是主角第一次亲身“探查”拔牙后果。它直接承接了 My dentist had just pulled out one of my teeth 的情节，并为结尾发现 the wrong tooth (拔错牙) 的惊人真相埋下伏笔。"
    },
    {
        "english": "I suddenly felt very worried, but could not say anything.",
        "chinese": "我突然非常着急起来，但却什么也说不出来。",
        "note": "1. 核心结构是“内心感受 + but + 外部无能为力”。前半句用系动词 felt 连接主语和 worried 状态，后半句用 could not (can的过去式) 表示“当时做不到”。\n\n2. 【关联点】主角的沟通状态再次恶化。这和我们之前遇到的 I tried to say something (尝试但失败) 形成递进，从“尝试说”变为“彻底说不出”，为结尾的 was able to tell (终于能说) 埋下伏笔。\n\n3. 【关联点】主角为何 suddenly felt worried (突然着急)？这与之前 my tongue was busy searching out the hole (舌头忙着寻找牙洞) 的动作紧密相连。正是舌头的“探查”带来了不祥的预感，是发现拔错牙的前奏。"
    },
    {
        "english": "When the dentist at last removed the cotton wool from my mouth, I was able to tell him that he had pulled out the wrong tooth.",
        "chinese": "当那位牙医最后将药棉从我嘴中取出时，我总算有可能告诉他，他拔错了牙。",
        "note": "1. 核心句型是 I was able to tell him that... (我总算能告诉他...)。be able to 强调在克服困难后“终于能够”做到某事，生动地表达了主角在嘴里的棉花被取出后，终于获得了说话的能力。\n\n2. 【关联点】主角的沟通状态至此完成了一个完整的闭环。从 I tried to say something (尝试说但失败)，到 could not say anything (彻底说不出)，再到本句的 was able to tell (终于能说出口)，戏剧冲突在此达到高潮并得以解决。\n\n3. 【关联点】注意过去完成时 had pulled out 的用法。它表示“拔错牙”这个动作发生在“我告诉他”这个动作之前。这与我们之前遇到的 had pulled out one of my teeth (拔了一颗牙) 形成致命呼应，揭示了故事的惊人真相：牙医拔是拔了，但拔错了。"
    }
]