[
    {
        "english": "Children who play truant from school are unimaginative.",
        "chinese": "逃学的孩子们都缺乏想像力。",
        "note": "1. play truant: 动词短语，意为“逃学”。【关联点】这个短语在本课中会再次出现，用来描述一个逃学并旅行了1600英里的男孩，注意体会上下文。\n\n2. unimaginative: 形容词，“缺乏想像力的”。由 imaginative (有想像力的) 加上表示否定的前缀 un- 构成。【关联点】这和我们遇到的第一句暗示的“生活单调”相呼应，那句话描述了这些孩子能做到的极限。\n\n3. 句型解析: 句子的主干是 Children are unimaginative。中间的 who play truant from school 是一个定语从句，像一个标签，具体说明是“哪些”孩子。【关联点】这种用 who 来修饰人的用法，在本课中反复出现，比如描述那个创造纪录的男孩，要熟练掌握。"
    },
    {
        "english": "A quiet day's fishing, or eight hours in a cinema seeing the same film over and over again, is usually as far as they get.",
        "chinese": "他们通常能够做到的，至多也就是安静地钓上一天鱼，或在电影院里坐上8个小时，一遍遍地看同一部电影。",
        "note": "1. 核心短语: as far as they get 意为“他们所能达到的极限”，暗示其生活单调、缺乏想象力。【关联点】这与我们遇到的第一个词 unimaginative (缺乏想象力的) 在意思上相互呼应，共同描绘了这些孩子的特点。\n\n2. 句型解析: 句子的主语很长，由 or 连接。但因被视为一个整体概念（能做的无非就是这些事），谓语动词用单数 is。其中 seeing... 是现在分词短语，修饰前面的 eight hours，说明这八小时在做什么。\n\n3. 内容关联: 【关联点】本句描述的单调活动（钓鱼、重复看电影）与后文中那个逃学旅行1600英里的男孩的大胆冒险形成鲜明对比，这为引出那个与众不同的男孩做了铺垫。"
    },
    {
        "english": "They have all been put to shame by a boy who, while playing truant, travelled 1,600 miles.",
        "chinese": "而有那么一个小男孩，他在逃学期间旅行了1,600英里，从而使上述所有逃学的孩子们都相形见绌了。",
        "note": "1. 核心短语: put to shame 意为“使...相形见绌”。本句用其被动形式 be put to shame by...，生动地表达了“被...比下去了”的含义。\n\n2. 核心词汇: play truant 意为“逃学”。【关联点】这和我们遇到的第一句 Children who play truant... 中的用法完全相同，再次强调了“逃学”这个核心概念。\n\n3. 句型解析: 句子的主干是 They have... been put to shame by a boy。who... travelled... 是一个定语从句，用来修饰 a boy。【关联点】这和第一句的句型类似，都是用 who 从句来具体说明前面的人。"
    },
    {
        "english": "He hitchhiked to Dover and, towards evening, went into a boat to find somewhere to sleep.",
        "chinese": "他搭便车到了多佛，天快黑时钻进了一条船，想找个地方睡觉。",
        "note": "1. 核心词汇: hitchhike 意为“搭便车”。【关联点】这是主人公的核心旅行方式，后文描述他“hitchhiked to Paris”时会再次遇到此词，要注意这个贯穿全文的动作。\n\n2. 核心短语: towards evening 意为“临近傍晚”。somewhere to sleep 意为“一个睡觉的地方”，是“不定代词+不定式”的经典结构，类似 something to eat。\n\n3. 句型解析: 句子由 and 连接两个连续动作。后半句的 to find somewhere to sleep 是不定式作目的状语，解释“为什么”要上船。【关联点】这个动作（上船睡觉）直接导致了下一句的意外发现：船在他睡着时开走了。"
    },
    {
        "english": "When he woke up next morning, he discovered that the boat had, in the meantime, travelled to Calais.",
        "chinese": "第二天早上他醒来时，发现船在这段时间已经到了加。",
        "note": "1. 核心短语: in the meantime 意为“在这期间”，巧妙连接了他睡着和醒来两个时间点，点明船是在他睡觉时开走的。【关联点】这直接承接了上一句他“上船睡觉”的情节，是故事的关键转折点。\n\n2. 时态解析: 本句是理解过去完成时的绝佳例子。船到达(had travelled)发生在他发现(discovered)之前，所以用过去完成时(had + 动词过去分词)表示“过去的过去”，清晰地交代了动作的先后顺序。\n\n3. 句型解析: 句子结构为“When时间状语从句, 主句+that宾语从句”。【关联点】这里的When从句和我们之前遇到的“as he crept off”中的as从句功能类似，都是为主要动作提供时间背景。"
    },
    {
        "english": "No one noticed the boy as he crept off.",
        "chinese": "当男孩从船里爬出来时，谁也没有发现他。",
        "note": "1. 核心词汇: crept off 意为“悄悄溜走”，由 creep (悄悄移动) 和 off (离开) 组成，生动描绘了男孩不引人注意的动作，这直接开启了他接下来的独自冒险。\n\n2. 句型解析: 句子主干是 No one noticed the boy。as he crept off 是时间状语从句，交代主句动作发生的背景。【关联点】这和我们分析 When he woke up... 时遇到的情况类似，这里的 as 和那句的 When 功能完全相同，都是为主要事件提供时间背景。"
    },
    {
        "english": "From there, he hitchhiked to Paris in a lorry.",
        "chinese": "从那里他又搭上卡车到了巴黎。",
        "note": "1. 核心词汇: hitchhike 意为“搭便车”。lorry 意为“卡车”(美式英语常用truck)。【关联点】hitchhike 一词再次出现，与之前的 hitchhiked to Dover 呼应，强调这是男孩的核心旅行方式。\n\n2. 句型解析: 这是一个描述行程的经典句式：From [起点], 主语 + 动作 to [终点] in [交通工具]。它清晰地交代了旅行的四个要素。【关联点】注意区分 in a lorry (乘坐卡车) 和之前遇到的 travel to Calais (航行到加来)，两者都描述了移动，但方式不同。"
    },
    {
        "english": "The driver gave him a few biscuits and a cup of coffee and left him just outside the city.",
        "chinese": "司机给了他几块饼干和一杯咖啡，就把他丢在了城外。",
        "note": "1. 核心句型: give sb sth (给某人某物) 是一个经典句型，简洁地表达了“给予”的动作和对象。本句中即 gave him (sb) a few biscuits and a cup of coffee (sth)。\n\n2. 结构解析: 句子用 and 连接了司机做的两个连续动作 (gave... and left...)。【关联点】这和我们遇到的 He hitchhiked to Dover and went into a boat... 结构完全相同，都是描述同一个人完成的连贯动作。\n\n3. 词汇解析: left him just outside the city 意为“把他丢在了城外”，清晰交代了动作和地点。【关联点】注意区分这里的 left (丢下) 和后文 take him to Paris (带他去巴黎) 在方向和意图上的不同。"
    },
    {
        "english": "The next car the boy stopped did not take him into the centre of Paris as he hoped it would, but to Perpignan on the French-Spanish border.",
        "chinese": "男孩截住的下一辆车，没有像他希望的那样把他带到巴黎市中心，而是把他带到了法国和西班牙边界上的佩皮尼昂。",
        "note": "1. 核心句型: not... but... (不是...而是...) 是本句的骨架，强烈对比了男孩的期望(巴黎)与现实(佩皮尼昂)，是故事的关键转折点。这个结构清晰地表达了事与愿违的结果。\n\n2. 结构解析: 句子的主语是 The next car the boy stopped。其中 the boy stopped 是一个定语从句，修饰 car，省略了关系代词 that。【关联点】这和我们之前遇到的用 who 修饰人的定语从句 (a boy who...) 类似，但这里修饰的是物，且省略了代词，用法更简洁。\n\n3. 细节辨析: as he hoped it would 意为“像他所希望的那样”，其中 it would 是 it would take him to Paris 的省略形式，避免重复。【关联点】注意动词 take (带到) 与前文司机 left him (把他丢下) 的区别，前者是中性的运送，后者则带有遗弃的意味，凸显了此次搭车结果的意外性。"
    },
    {
        "english": "There he was picked up by a policeman and sent back to England by the local authorities.",
        "chinese": "他在那儿被一个警察抓住了，之后被当局送回了英国。",
        "note": "1. 结构解析: 句子由 and 连接两个并列的被动动作 (was picked up and sent back)，主语 he 承受了这两个动作。后半句省略了 he was，使句子更紧凑。【关联点】这和我们之前遇到的 He hitchhiked... and went... 结构类似，但一个是主动，一个是被动，对比体会。\n\n2. 核心句型: be + 动词过去分词 + by... (被...怎么样)。本句用 by a policeman 和 by the local authorities 点明了动作的执行者。【关联点】这和我们遇到的 They have... been put to shame by a boy... 用法完全相同，都是通过 by 来引出动作的发出者。\n\n3. 核心词汇: pick up (此处指“逮捕”) 和 send back (遣返)。这两个动作标志着男孩大胆冒险的结束，他最终被官方力量介入并送回了家，为整个故事画上句号。"
    },
    {
        "english": "He has surely set up a record for the thousands of children who dream of evading school.",
        "chinese": "他无疑为成千上万梦想逃避上学的孩子们创造了一项纪录。",
        "note": "1. 核心短语: set up a record 意为“创造一项纪录”。dream of evading school 意为“梦想逃学”。【关联点】这里的 evading school (逃避上学) 与我们反复遇到的 play truant (逃学) 意思相近，都指向了故事的核心主题。\n\n2. 句型解析: 句子的主干是 He has... set up a record for the... children。后面的 who dream of... 是一个定语从句，用来具体说明是“哪些”孩子。【关联点】这和我们之前遇到的 a boy who... 和 Children who... 结构完全相同，是本课反复强调的核心句型。\n\n3. 内容关联: 这句话是对男孩非凡冒险的总结。他用行动“创造纪录”(set up a record)，而其他孩子仅仅停留在“梦想”(dream of)。【关联点】这与开篇提到的那些 unimaginative (缺乏想象力) 的孩子形成了最终的、最强烈的对比。"
    }
]