[
    {
        "english": "A Festival for the Dead is held once a year in Japan.",
        "chinese": "日本每年过一次“亡灵节”。",
        "note": "1. 核心短语: \"the Dead\" 指“死者们”(the+形容词表一类人)；\"is held\" 是 hold (举办) 的被动形式，表示“被举办”；\"once a year\" 表示频率“每年一次”。\n\n2. 句型解析: 这是一个典型的被动语态句。结构为“主语 + be + 动词过去分词”。句子的主角“节日”不是自己举办，而是“被举办”，强调的是事件本身。\n\n3. 【关联点】被动语态是本课重点。这句的 \"is held\" 和我们之后遇到的 \"are welcomed\" (被欢迎), \"is laid out\" (被摆放), \"are hung\" (被挂上) 结构完全相同。注意与主动句 \"people dance and sing\" (人们跳舞唱歌) 的区别。"
    },
    {
        "english": "This festival is a cheerful occasion, for on this day, the dead are said to return to their homes and they are welcomed by the living.",
        "chinese": "这个节日是个欢乐的日子，因为在这一天，据说死去的人要回到他们的家里来，活着的人则对他们表示欢迎。",
        "note": "1. 核心短语: for (连词, 因为), 通常前面有逗号; are said to... (据说); the dead / the living (死者/活人), 这是“the+形容词”表示一类人的用法。\n\n2. 句型解析: 这是一个典型的“结论 + for + 原因”结构。前半句下结论“节日是欢乐的”，后半句用两个被动语态解释原因：亡灵“据说要回来”(are said to return) 且“被欢迎”(are welcomed)。\n\n3. 【关联点】这里的被动语态 \"are welcomed\" 和我们第一句遇到的 \"is held\" (被举办) 结构完全相同，都是本课重点。注意区分主动句 \"people dance and sing\" (人们跳舞唱歌)。\n\n4. 【关联点】\"the dead\" 的用法和第一句 \"A Festival for the Dead\" 中的用法一致。同时注意 \"the dead\" 和 \"the living\" 形成的鲜明对比。"
    },
    {
        "english": "As they are expected to be hungry after their long journey, food is laid out for them.",
        "chinese": "因为预料到他们在经过长途旅行之后会感到饥饿，所以为他们摆放好了食品。",
        "note": "1. 核心短语: be expected to do (被期望/预料做某事); lay out (摆放), 其过去分词是 laid out。\n\n2. 句型解析: 这是一个典型的“原因 (As...) + 结果”复合句。句中包含两个被动语态: “他们被预料会饿”(are expected to be hungry) 和“食物被摆放好”(is laid out)。\n\n3. 【关联点】本句的两个被动语态 \"are expected\" 和 \"is laid out\" 延续了本课重点。这和我们之前遇到的 \"is held\" (被举办) 和 \"are welcomed\" (被欢迎) 结构完全相同。\n\n4. 【关联点】注意短语 \"laid out\" (摆放)。我们稍后会在一个更复杂的句子中再次遇到它: \"...the food that had been laid out...\" (为亡灵摆放的食物)，时态不同但意思一样。"
    },
    {
        "english": "Specially-made lanterns are hung outside each house to help the dead to find their way.",
        "chinese": "特制的灯笼挂在各家的门外，为的是帮助亡灵看清道路。",
        "note": "1. 核心短语: specially-made (特制的), 由“副词+过去分词”构成; are hung (被挂着), 是动词hang的被动形式; to help... 是不定式，表目的。\n\n2. 句型解析: 句子核心是被动语态“灯笼被挂着”(lanterns are hung)，后半句用不定式“为了帮助...”(to help...)来解释挂灯笼的目的。这是一个“被动动作+目的”的经典结构。\n\n3. 【关联点】本句的被动语态 'are hung' 延续了本课重点。这和我们之前遇到的 'is held' (被举办) 和 'is laid out' (被摆放) 结构完全相同。\n\n4. 【关联点】'the dead' (亡灵) 这个用法和我们之前遇到的 'A Festival for the Dead' 中的用法一致，指一类人。"
    },
    {
        "english": "All night long, people dance and sing.",
        "chinese": "整个夜晚人们载歌载舞。",
        "note": "1. 核心短语: All night long (整个晚上)，表示动作持续的时间。dance and sing 是两个并列的动词，表示人们主动进行的活动。\n\n2. 句型解析: 这是一个典型的主动语态句型 (主语+动词)。主语 \"people\" 是动作的发出者，主动进行 \"dance\" 和 \"sing\" 的动作。\n\n3. 【关联点】这是本课唯一的纯主动句。请注意与贯穿全文的被动语态做对比，如 A festival is held (节日被举办), food is laid out (食物被摆放)。主动句强调“谁做了”，被动句强调“什么被做了”。"
    },
    {
        "english": "In the early morning, the food that had been laid out for the dead is thrown into a river or into the sea as it is considered unlucky for anyone living to eat it.",
        "chinese": "一大早，人们便把为死者摆放的食品扔进河中或海里，因为人们认为活着的人吃了这些东西是不吉利的。",
        "note": "1. 核心结构: had been laid out (过去完成时被动, 表示“摆放”发生在“扔掉”之前); is thrown (被扔掉); as 在此意为“因为”; it is considered unlucky for sb. to do sth. (做某事被认为不吉利)。\n\n2. 句型解析: 句子主干是 the food is thrown... (食物被扔掉)。that had been laid out... 是定语从句，修饰是“哪种”食物。as 引导原因状语从句，解释了“为什么”要扔掉。\n\n3. 【关联点】这和我们之前遇到的 food is laid out 意思相同，但时态变为过去完成时 had been laid out，强调“摆放”发生在主句动作“扔掉”之前。\n\n4. 【关联点】本句再次集中出现了本课重点——被动语态。is thrown 和 is considered 与之前的 is held (被举办), are welcomed (被欢迎) 等结构完全一致。"
    },
    {
        "english": "In towns that are near the sea, the tiny lanterns which had been hung in the streets the night before, are placed into the water when the festival is over.",
        "chinese": "在靠海的城镇中，头天夜里挂在大街小巷的小灯笼在节后就放在了水里。",
        "note": "1. 核心结构: had been hung (过去完成时被动, 表示“悬挂”发生在“放置”之前); which... (定语从句, 修饰灯笼); when... (时间状语从句, 说明放置的时间)。\n\n2. 句型解析: 句子主干是 the lanterns are placed into the water (灯笼被放入水中)。中间的 which 从句详细描述了是“哪种”灯笼 (头天夜里被挂起来的那些)，最后的 when 从句则点明了这一动作发生的“时间” (节日结束后)。\n\n3. 【关联点】本句的被动语态 are placed (被放置) 和 had been hung (曾被挂起) 延续了本课重点。这和我们之前遇到的 is held (被举办), is laid out (被摆放) 等结构完全相同。\n\n4. 【关联点】注意区分时态。had been hung 和之前遇到的 had been laid out 结构一致，都用过去完成时表示一个更早发生的背景动作。而 are placed 则和 is thrown 一样，用一般现在时描述一个常规习俗。"
    },
    {
        "english": "Thousands of lanterns slowly drift out to sea guiding the dead on their return journey to the other world.",
        "chinese": "成千上万只灯笼慢慢漂向大海，指引着亡灵返回另一个世界。",
        "note": "1. 核心结构: guiding... 是现在分词作伴随状语，生动地描绘出灯笼在“漂流”(drift)时，同时进行的第二个动作——“指引”，极具画面感。\n\n2. 【关联点】这是本课为数不多的主动句 (灯笼主动漂流)，和之前的 people dance and sing (人们跳舞唱歌) 类似。请注意与贯穿全文的被动语态，如 food is laid out (食物被摆放) 做对比。\n\n3. 【关联点】现在分词的用法是本句重点。这和我们之后遇到的 ...stand on the shore watching... (站在岸边注视着...) 结构类似，都是用-ing形式来表示一个伴随发生的动作。\n\n4. 【关联点】词汇 the dead (亡灵) 和 journey (旅程) 都在前文出现过。这里的 return journey (回归之旅) 与之前的 long journey (长途旅行) 形成呼应。"
    },
    {
        "english": "This is a moving spectacle, for crowds of people stand on the shore watching the lanterns drifting away until they can be seen no more.",
        "chinese": "这是一个感人的场面，人们成群地伫立在海岸上，注视着灯笼远去，直到再也看不见为止。",
        "note": "1. 核心结构: 这是一个典型的“结论 + for + 原因”结构。前半句给出结论“这是一个感人的场面”，后半句用 for 引导一个生动的画面来解释原因：人们伫立岸边，目送灯笼远去。\n\n2. 【关联点】这和我们之前遇到的 This festival is a cheerful occasion, for... 结构完全相同，都是用 for 来引出详细的解释，比 because 更具文学色彩。\n\n3. 【关联点】句中 watching the lanterns drifting away 的用法是本课重点。这和我们之前遇到的 lanterns... guiding the dead... 结构完全相同，都是用-ing形式表示一个伴随发生的动作，让画面更生动。\n\n4. 【关联点】注意句尾的被动语态 can be seen。这延续了本课的重点，和我们遇到的 is held (被举办), is laid out (被摆放) 等结构一致，都强调动作的承受者（灯笼）。"
    }
]