[
    {
        "english": "Aeroplanes are slowly driving me mad.",
        "chinese": "飞机正在逐渐把我逼疯。",
        "note": "1. 核心短语是 drive...mad，意为“把……逼疯”。这里的 drive 并非“驾驶”，而是“驱使，迫使”，表示让某人进入某种状态。这是一个非常生动的表达。\n\n2. 本句是典型的“主谓宾补”结构(S+V+O+C)：Aeroplanes (主语) are driving (谓语) me (宾语) mad (宾补)。形容词 mad 作为宾补，补充说明宾语 me 的状态。\n\n3. 【关联点】 这和我们遇到的 Over a hundred people must have been driven away (被赶走) 中的 drive 意思不同，后者意为“驱赶”。同时，mad 一词也出现在 Everybody says I must be mad 中，含义相同。"
    },
    {
        "english": "I live near an airport and passing planes can be heard night and day.",
        "chinese": "我住在一个机场附近，过往飞机日夜不绝于耳。",
        "note": "1. passing 是动词pass的-ing形式作形容词，意为“经过的”，生动地描述了飞机的动态。【关联点】这和我们后面遇到的 a passing plane 用法完全相同。\n\n2. can be heard 是“情态动词+被动语态”结构，主语 planes 是动作的承受者。飞机是“被听到”，而不是主动去听。\n\n3. 【关联点】被动语态是本课核心语法，与 The airport was built, it could not be used, will be knocked down 等用法类似，都是强调主语“被”怎么样了。\n\n4. night and day 是固定短语，意为“日夜不停地”，形象地描绘了噪音的持续性。"
    },
    {
        "english": "The airport was built years ago, but for some reason it could not be used then.",
        "chinese": "机场是许多年前建的 ，但由于某种原因当时未能启用。",
        "note": "1. 本句的核心是被动语态：was built (被建造) 和 could not be used (不能被使用)。主语 airport 是动作的承受者，而非发出者。\n\n2. 【关联点】 这和我们遇到的 can be heard, will be knocked down 等用法一致，都是被动语态，是本课反复出现的重点语法。\n\n3. for some reason 是一个固定短语，意为“由于某种原因”，常用来引出一个未知或不便明说的理由，使语气更委婉。\n\n4. 【关联点】 注意 could not be used (未能启用) 与后面 Last year... it came into use (投入使用) 形成鲜明对比，讲述了机场命运的转折。\n\n5. 【关联点】 这里的转折词 but 和后面遇到的 however 功能类似，都用于连接意思相反的两个部分，但 but 更口语化。"
    },
    {
        "english": "Last year, however, it came into use.",
        "chinese": "然而去年机场开始使用了。",
        "note": "1. 核心短语 come into use，意为“投入使用”，强调从无到有的状态变化。came 是 come 的过去式。【关联点】这与之前的 could not be used (未能启用) 形成强烈对比，清晰展现了机场命运的转折。\n\n2. however 是副词，意为“然而”，用于转折。注意它在句中常被逗号隔开。【关联点】这和我们之前遇到的 but 功能类似，但 however 更为正式。\n\n3. 【关联点】注意区分被动语态。The airport was used (机场被使用了) 强调被动动作，而 it came into use (它投入使用了) 则更主动地描述其进入可用状态的事实。"
    },
    {
        "english": "Over a hundred people must have been driven away from their homes by the noise.",
        "chinese": "有100多人肯定是被噪音逼得已经弃家远去，",
        "note": "1. 核心结构是 must have been driven away，用于对过去已发生之事的肯定推测。“must”表“肯定”，“have been driven”是被动语态，指动作已完成。\n\n2. 动词短语 drive away 意为“赶走，驱逐”，生动地描绘了人们被迫离开家园的情景。\n\n3. 【关联点】注意区分 drive 的用法。这和我们遇到的 Aeroplanes are slowly driving me mad (把……逼疯) 中的“驱使”不同，本句意为“驱赶”。\n\n4. 【关联点】must 的用法也值得比较。在 Everybody says I must be mad 中，是对现在的推测；而本句的 must have been 则是对过去的推测。\n\n5. 【关联点】本句的被动语态是本课重点。它与 can be heard, was built, will be knocked down 等用法一脉相承，都是强调主语“被”怎么样了。"
    },
    {
        "english": "I am one of the few people left.",
        "chinese": "我是少数留下来的人中的一个。",
        "note": "1. 核心短语是 one of the few...，意为“少数...之一”，用来强调在某个群体中，符合条件的人或物数量极少。\n\n2. 关键点是 left。它不是动词，而是动词 leave 的过去分词作形容词，修饰 people，意为“被留下的”。这种“名词+过去分词”的后置定语结构非常简洁地表达了被动含义。\n\n3. 【关联点】这和我们遇到的 passing planes 形成鲜明对比。passing 是现在分词，表主动含义（正在经过的飞机）；而 left 是过去分词，表被动含义（被留下的人）。\n\n4. 【关联点】left 所隐含的“被动”意味，与本课反复出现的被动语态（如 was built, can be heard）主题一致，都是强调事物承受了某个动作。"
    },
    {
        "english": "Sometimes I think this house will be knocked down by a passing plane.",
        "chinese": "有时我觉得这房子就要被一架飞过的飞机撞倒。",
        "note": "1. 核心结构是将来时被动语态 will be knocked down (将被撞倒)，表达对未来的猜测。【关联点】这延续了本课被动语态的主题，与 can be heard (现在) 和 was built (过去) 形成对比。\n\n2. 动词短语 knock down 意为“撞倒”。【关联点】a passing plane (飞过的飞机) 与我们之前遇到的 passing planes 用法完全一致。"
    },
    {
        "english": "I have been offered a large sum of money to go away, but I am determined to stay here.",
        "chinese": "他们曾向我提供一大笔钱让我搬走，但我决定留在这儿 。",
        "note": "1. 核心结构是现在完成时被动语态 have been offered (已被提供)，表示过去的动作对现在造成了影响（我正面临选择）。【关联点】这延续了本课被动语态的主题，与 was built, can be heard, will be knocked down 等用法一脉相承。\n\n2. 关键短语 be determined to do sth. 意为“下定决心做某事”，表达了主语“我”面对诱惑时的坚定立场，与前半句的被动接受形成对比。\n\n3. 转折词 but 连接了两个意思相反的部分：外部的诱惑与内心的决定。【关联点】这和我们之前遇到的 however 功能类似，都用于引出转折，但 but 更口语化。"
    },
    {
        "english": "Everybody says I must be mad and they are probably right.",
        "chinese": "大家都说我肯定是疯了， 也许他们说的是对的。",
        "note": "1. 核心是情态动词 must be，表示对现在情况的肯定推测（“肯定是”）。【关联点】这和我们遇到的 must have been driven away (对过去的推测) 形成对比，一个是猜现在，一个是猜过去。\n\n2. 【关联点】这里的 mad (疯了) 与开篇句 Aeroplanes are slowly driving me mad 中的 mad 意思完全相同，都是指不理智或被逼疯的状态。\n\n3. 句子由 and 连接两部分。第二部分的 probably (很可能) 表达了不完全确定的认可，语气比 must 弱得多，体现了一种自嘲的口吻。\n\n4. 【关联点】句型 Everybody says + 从句，与我们遇到的 I think + 从句 结构类似，都是引出说话人的观点或他人的看法。"
    }
]