[
    {
        "english": "Fishermen and sailors sometimes claim to have seen monsters in the sea.",
        "chinese": "渔夫和水手们有时声称自己看到过海里的妖怪。",
        "note": "1. 核心句型: claim to have done sth. 意为“声称已经做过某事”。这里的 to have seen 是完成时不定式，强调“看见”这个动作发生在“声称”之前，这是理解本句的关键。\n\n2. 【关联点】本句的 sometimes (有时) 是一个频率副词。这和我们之后遇到的 occasionally (偶尔)、at times (有时) 意思相近，而与 rarely (很少) 意思相反，可以一并记忆。\n\n3. 【关联点】渔夫们主动“声称看到”(claim to have seen)，而课文第一句中提到这些怪物“被看到”(have been sighted)。这形成了主动声称与被动事实的有趣对比，注意动词语态的变化。"
    },
    {
        "english": "Though people have often laughed at stories told by seamen, it is now known that many of these 'monsters' which have at times been sighted are simply strange fish.",
        "chinese": "虽然人们常常对水手们讲的故事付诸一笑， 但现在看来，人们有时看到的这些“妖怪”很多不过是些奇怪的鱼。",
        "note": "1. 核心句型：“Though..., it is now known that...”，表达“虽然...，但现在众所周知...”。这里的 “it” 是形式主语，引导出真正的主语从句 “that...”，使语气更客观。\n\n2. 【关联点】注意作者如何用不同词汇描述“奇怪的生物”：本句的 strange fish，与之前的 monsters, unusual creatures, peculiar fish, no ordinary fish 属于同义表达，丰富了文章的描述。\n\n3. 【关联点】本句的 have been sighted (被看见) 是现在完成时被动语态。这和我们之前遇到的 was caught (被抓住), are washed (被冲上岸) 等被动语态类似，都是强调“生物”本身是动作的承受者。\n\n4. 语法点: stories told by seamen 中，told by seamen 是过去分词短语作后置定语，修饰 stories，相当于一个定语从句 which were told by seamen。这种用法简洁有力。"
    },
    {
        "english": "Occasionally, unusual creatures are washed to the shore, but they are rarely caught out at sea.",
        "chinese": "一些异常的生物偶尔会被冲到岸上来，但它们在海上却极少能被捕到。",
        "note": "1. 核心句型: 这是一个由 but 连接的转折句，清晰对比了两种情景：生物在岸上被发现 (are washed) 与在海里被捕获 (are caught) 的不同境遇。\n\n2. 【关联点】注意频率副词的对比：Occasionally (偶尔) 与 rarely (很少) 形成鲜明对比。这和我们之前遇到的 sometimes (有时) 意思相近，都用来描述事件发生的频率。\n\n3. 【关联点】本句的 are washed (被冲上岸) 和 are caught (被捕获) 均为被动语态。这与我们遇到的 was caught (被抓住), have been sighted (被看见) 等用法一致，都强调生物是动作的承受者。\n\n4. 【关联点】unusual creatures (异常生物) 是本文描述“怪物”的又一说法。回顾全文，作者使用了 monsters, strange fish, peculiar fish 等词，注意学习这种同义替换的写作技巧。"
    },
    {
        "english": "Some time ago, however, a peculiar fish was caught near Madagascar.",
        "chinese": "然而不久前，在马达加斯加附近的海里却捕到了一条奇怪的鱼。",
        "note": "1. 核心结构: a peculiar fish was caught (一条怪鱼被捕获了)。这是简单过去时的被动语态，强调“鱼”是动作的承受者。转折词 however 引出与前文相反的情况。\n\n2. 【关联点】被动语态是本文重点。本句的 was caught (被抓住) 与之前遇到的 have been sighted (被看见), are washed (被冲上岸) 等用法一致，都强调生物是动作的承受者。\n\n3. 【关联点】peculiar fish (奇怪的鱼) 是本文描述“神秘生物”的又一说法。这和我们之前遇到的 monsters, strange fish, unusual creatures 属于同义表达，体现了作者丰富的词汇。"
    },
    {
        "english": "A small fishing boat was carried miles out to sea by the powerful fish as it pulled on the line.",
        "chinese": "一条小渔船被一条咬住钩的强壮的大鱼拖到了几英里以外的海面上。",
        "note": "1. 核心结构: 主句用被动语态 (A boat was carried) 描述船的遭遇，从句用 as it pulled... 描绘鱼的主动行为，生动再现了“船被鱼拖着走”的动态画面。\n\n2. 【关联点】被动语态是本文重点。本句的 was carried (被拖走) 与之前遇到的 was caught (被抓住), are washed (被冲上岸) 等用法一致，都强调主语是动作的承受者。\n\n3. 【关联点】注意区分 as 的用法。本句中 as 引导时间状语从句，意为“当…时”。这和我们之后遇到的 as they live... (因为它们生活在…) 中引导原因状语从句的用法不同。"
    },
    {
        "english": "Realizing that this was no ordinary fish, the fisherman made every effort not to damage it in any way.",
        "chinese": "那位渔民意识到这根本不是一条普通的鱼，于是千方百计不让它受到丝毫伤害。",
        "note": "1. 核心结构: Realizing... 开头，作原因状语，生动地解释了渔夫后续动作的原因，即“因为意识到...，所以...”。这比用 because 连接更简洁。\n\n2. 核心短语: make every effort not to do sth. 意为“尽一切努力避免做某事”。这是一个非常实用的表达，强调为达成一个消极目标（不做某事）所付出的努力。\n\n3. 【关联点】no ordinary fish (不是普通的鱼) 是本文描述“神秘生物”的又一说法。这和我们之前遇到的 monsters, strange fish, unusual creatures, peculiar fish 类似，都是同义表达，注意学习这种丰富的写作手法。"
    },
    {
        "english": "When it was eventually brought to shore, it was found to be over thirteen feet long.",
        "chinese": "当终于把它弄上岸后，人们发现它身长超过了13英尺。",
        "note": "1. 核心结构: “When..., it was found to be...”句型，先用When从句交代时间背景，再用主句说明发现的结果。结构清晰，叙事感强。\n\n2. 【关联点】被动语态是本文重点。本句的 was brought (被带到) 和 was found (被发现) 与我们之前遇到的 was carried (被拖走), was caught (被抓住) 等用法一致，都强调主语是动作的承受者。\n\n3. 核心短语: be found to be... 意为“被发现是...”，常用于客观陈述发现的结果或事物的本质。"
    },
    {
        "english": "It had a head like a horse, big blue eyes, shining silver skin, and a bright red tail.",
        "chinese": "它长着一个像马一样的头，有着大的蓝眼睛和闪闪发光的银色皮肤，还有一条鲜红色的尾巴。",
        "note": "1. 核心句型: It had + [特征A], [特征B], [特征C], and [特征D]。这是一个典型的并列结构，用逗号和and连接多个名词短语，生动地描绘了生物的外貌。介词 like 用于进行形象的比较。\n\n2. 【关联点】本句首次具体描绘了生物的外观。这和我们之前遇到的 monsters, strange fish, peculiar fish 等模糊的称呼形成对比，从神秘走向具体。\n\n3. 【关联点】注意动词的变化。此前多用被动语态的动作动词（如 was caught, was carried）来叙述事件，而本句使用状态动词 had 来进行静态描述，从“发生了什么”转向“它长什么样”。"
    },
    {
        "english": "The fish, which has since been sent to a museum where it is being examined by a scientist, is called an oarfish.",
        "chinese": "此鱼叫桨鱼，被送进了博物馆，现正接受一位科学家的检查。",
        "note": "1. 核心结构：“主语...插入语...谓语”。句子主干是 The fish is called an oarfish。中间用逗号隔开的长句是补充说明，这种结构能在不打断主句的情况下提供丰富信息。\n\n2. 【关联点】被动语态是本文重点。本句的 has been sent (已被送去) 和 is being examined (正被检查) 延续了这一模式，与之前的 was caught, was carried 等用法一致，都强调主语是动作的承受者。\n\n3. 【关联点】本句最终揭晓了鱼的名字 oarfish (桨鱼)。这解答了之前用 monsters, strange fish, peculiar fish 等词制造的悬念，使对生物的描述从模糊走向明确。\n\n4. 语法细节：插入语包含两层从句，which 指代 the fish，where 指代 a museum。同时，has been sent (已完成) 与 is being examined (进行中) 的时态对比，清晰地展示了事件的先后顺序和状态。"
    },
    {
        "english": "Such creatures have rarely been seen alive by man as they live at a depth of six hundred feet.",
        "chinese": "人们很少能看到活着的这类动物，因为它们生活在600英尺深的水下。",
        "note": "1. 核心结构: 这是一个由 as (因为) 连接的因果复合句，清晰解释了“很少被看见”的原因是“生活在深海”。\n\n2. 【关联点】注意区分 as 的用法。这和我们之前遇到的 as it pulled on the line (当...时) 不同，这里的 as 引导原因状语从句，意为“因为”。\n\n3. 【关联点】被动语态是本文重点。本句的 have rarely been seen (很少被看见) 与之前的 was caught, was carried 等用法一致，都强调生物是动作的承受者。\n\n4. 【关联点】频率副词 rarely (很少) 再次出现，与我们之前遇到的 occasionally (偶尔) 和 sometimes (有时) 形成鲜明对比，强调了看见的几率极低。"
    }
]