[
    {
        "english": "A woman in jeans stood at the window of an expensive shop.",
        "chinese": "一位穿着牛仔裤的妇女站在一家高档商店的橱窗前。",
        "note": "1. 核心结构 “a woman in jeans” (穿着牛仔裤的妇女) 使用介词 in 来描述人物穿着。这是一种简洁的表达方式。【关联点】这和我们后面遇到的 “dressed in a fur coat” (穿着裘皮大衣) 作用相同，但后者更正式。\n\n2. “stood at the window” 表示 “站在橱窗前”，强调位置在橱窗的外部。【关联点】注意区分后面提到的 “a dress that was in the window” (橱窗里的裙子)，in the window 指物品在橱窗内部陈列。\n\n3. 整个句子像一幅素描：先点出人物（A woman in jeans），再说明其动作和位置（stood at the window...）。这是英语中常见的“谁在哪儿干什么”的描述方式，层层递进，让画面更清晰。"
    },
    {
        "english": "Though she hesitated for a moment, she finally went in and asked to see a dress that was in the window.",
        "chinese": "她虽然犹豫了片刻，但终于还是走进了商店，要求把陈列在橱窗里的一件衣服拿给她看。",
        "note": "1. 句首的 “Though” 意为“虽然”，引出一个与主句相反的铺垫，形成“虽然犹豫，但还是行动了”的转折。这让一个简单的动作变得更有故事性。\n\n2. 核心动作是 “went in and asked to see...”，用 and 连接两个连续动作。“ask to do”意为“要求做某事”。【关联点】这和后面“decided to punish”（决定去惩罚）的结构类似，都是“动词 + to do”的形式，表示目的或决定。\n\n3. “that was in the window” 是一个修饰语，像标签一样说明是“哪一件”裙子。【关联点】注意区分我们最开始遇到的 “stood at the window”（站在窗外），这里的 “in the window” 指的是裙子在橱窗“内部”陈列。"
    },
    {
        "english": "The assistant who served her did not like the way she was dressed. Glancing at her scornfully, he told her that the dress was sold.",
        "chinese": "接待她的售货员不喜欢她的那副打扮，轻蔑地看了她一眼后，便告诉她那件衣服已经卖出去了。",
        "note": "1. “who served her”是一个修饰语，像聚光灯一样指明是“哪个”售货员。【关联点】这和我们之前用“that was in the window”来指明是“哪件”裙子，用法完全相同。它们都起到了精准定位的作用。\n\n2. “Glancing at her scornfully”描述了一个伴随动作，生动地画出了售货员轻蔑的神态。【关联点】这里的副词 scornfully 和后面“walked out angrily”中的 angrily 用法一样，都是修饰动作。这个“分词短语作状语”的结构，也和后面将遇到的“Not realizing who she was”类似。\n\n3. “the way she was dressed”指“她穿着的方式”。【关联点】注意动词 serve (接待)，它在后面售货员态度转变时还会出现 (eager to serve her)，形成鲜明对比。最后，“the dress was sold”使用被动语态，强调“被卖掉”这个结果，而不是谁卖了它。"
    },
    {
        "english": "The woman walked out of the shop angrily and decided to punish the assistant next day.",
        "chinese": "这位妇女怒气冲冲地走出了商店，决定第二天教训一下那个售货员。",
        "note": "1. 核心动作由 and 连接：walked out (走出) 和 decided to punish (决定教训)，清晰地展示了两个连续发生的行为。\n\n2. angrily (生气地) 是一个副词，生动地描绘了她“走出”时的情绪。【关联点】这和我们之前遇到的 scornfully (轻蔑地) 用法完全一样，都是用来修饰动词，让动作充满感情色彩。\n\n3. decided to punish 意为“决定去教训”。【关联点】这个“动词 + to do”的结构，和我们之前遇到的 asked to see (要求看) 类似，都用来表达一个人的决定或意图。"
    },
    {
        "english": "She returned to the shop the following morning dressed in a fur coat, with a handbag in one hand and a long umbrella in the other.",
        "chinese": "第二天上午，她又来到这家商店，穿了一件裘皮大衣，一只手拎着一只手提包，另一只手拿着一把长柄伞。",
        "note": "1. “dressed in a fur coat” (穿着裘皮大衣) 是描述人物穿着的另一种方式。【关联点】这和我们最初遇到的 “a woman in jeans” 作用相同，但 “dressed in” 这种表达更显正式，暗示了她身份的转变。\n\n2. “with a handbag in one hand...” 是一种补充描述，生动地描绘了她当时的状态。【关联点】注意，这里的 with 用于描述“伴随状态”，而后面会遇到的 “with great difficulty”（费了很大劲儿）中的 with 则用来描述动作的“方式”，用法不同。\n\n3. 句中的 “the following morning” (第二天上午) 紧承上一句的 “next day”，推动了故事时间线的发展。同时，动词 returned (回来) 暗示了她复仇计划的开始。"
    },
    {
        "english": "After seeking out the rude assistant, she asked for the same dress.",
        "chinese": "找到那个无礼的售货员后，她还要看昨天的那件衣服。",
        "note": "1. 结构 “After seeking out...” 清晰交代了动作的先后顺序：先找到目标，再开始行动。这直接呼应了她前一天“决定要教训”售货员的计划，表明复仇正式开始。\n\n2. 【关联点】注意区分这里的 “ask for the same dress”（要求得到这件衣服）和她第一次进店时的 “asked to see a dress”（要求看一看）。前者意图更强硬，直接索要物品；后者则更礼貌。词汇的细微变化体现了她态度的转变。\n\n3. “the rude assistant” (那个无礼的售货员) 首次为他的行为贴上了标签。【关联点】这和我们之前看到的他 “scornfully”（轻蔑地）看她的神态相呼应，也解释了她为何要 “punish”（教训）他。一个形容词就串联起了前因后果。"
    },
    {
        "english": "Not realizing who she was, the assistant was eager to serve her this time.",
        "chinese": "那个售货员没有认出她是谁，这一回接待她的态度非常殷勤。",
        "note": "1. 句首的 “Not realizing who she was” (没有认出她是谁) 是一个分词短语，它简洁地解释了主句动作发生的原因。【关联点】这和我们之前遇到的 “Glancing at her scornfully” 结构类似，都是用一个生动的分词短语来补充说明主句的背景或原因。\n\n2. 核心短语 “eager to serve” (殷勤地接待) 体现了售货员态度的巨大转变。【关联点】这里的 serve 与之前售货员冷淡地 “served her” 形成戏剧性对比，动词没变，但前面的 eager 彻底改变了态度，凸显了他的势利。\n\n3. 结构 “eager to do sth.” 表示“渴望做某事”。【关联点】这个 “形容词/动词 + to do” 的用法很常见，和我们之前学过的 asked to see (要求看) 以及 decided to punish (决定教训) 属于同一类用法。"
    },
    {
        "english": "With great difficulty, he climbed into the shop window to get the dress.",
        "chinese": "费了好大劲儿，他爬进橱窗去取那件衣服。",
        "note": "1. “With great difficulty”放在句首，生动地强调了动作的艰难方式。【关联点】这里的 with 用来描述动作的“方式”。注意区分我们之前遇到的 “with a handbag...”，那里的 with 用于描述“伴随状态”。\n\n2. 动词 climb 搭配 into，清晰地表达了“爬进去”的动态过程。【关联点】注意介词变化：at the window (窗外) -> in the window (窗内) -> into the window (进入)，生动展现了位置关系的变化。\n\n3. 句尾的 “to get the dress” 回答了 “为什么爬” 的问题，点明了动作的目的。【关联点】这个 “to do” 表目的的用法，和我们之前遇到的 asked to see 以及 decided to punish 结构完全相同。"
    },
    {
        "english": "As soon as she saw it, the woman said she did not like it.",
        "chinese": "这位妇女对那件衣服只看一眼，就说不喜欢。",
        "note": "1. 核心短语 “As soon as” (一...就...) 强调了两个动作的紧密连接，即“看见”这个动作瞬间就触发了“说不喜欢”的反应，中间没有任何犹豫。\n\n2. 【关联点】注意动词 said 的用法。这里用 “said she did not like it” 来转述她的话。这和我们之前遇到的 “he told her that the dress was sold” 结构类似，都是转述内容。区别在于 told 后面必须跟一个宾语（告诉谁），而 said 则不必。\n\n3. 【关联点】这句中的 “she did not like it” (她不喜欢它) 与之前售货员的 “did not like the way she was dressed” (不喜欢她的穿着) 形成了有趣的呼应。双方都基于第一印象迅速做出了负面判断，为故事的冲突埋下伏笔。"
    },
    {
        "english": "She enjoyed herself making the assistant bring almost everything in the window before finally buying the dress she had first asked for.",
        "chinese": "她开心地迫使那位售货员把橱窗里几乎所有的东西都拿了出来，最后才买下了她最先要看的那一件。",
        "note": "1. 核心句型 “make sb do sth” (让某人做某事)，这里的 “make the assistant bring” 生动展现了她如何实施前文提到的 “punish” (教训) 计划。注意 bring 是动词原形，表达一种强制性。\n\n2. 结构 “enjoyed herself making...” 意为“通过做某事获得乐趣”。这与她之前 “angrily” (生气地) 离开形成强烈对比，复仇的快感尽在其中。\n\n3. 【关联点】她最终买的还是“她最先 asked for 的那件”，这让整个折腾人的过程显得极具戏剧性。注意，这里的 ask for (索要) 比她第一次进店时的 ask to see (要求看) 语气更直接，也暗示了她此时的主导地位。"
    }
]