[
    {
        "english": "Nearly a week passed before the girl was able to explain what had happened to her.",
        "chinese": "几乎过了一个星期，那姑娘才能讲述自己的遭遇。",
        "note": "1. 句型 \"...passed before...\" 意为“过了…才…”，强调时间的流逝是动作发生的前提。这个结构清晰地表达了两个动作的先后顺序，即“一周过去”是先，“女孩解释”是后。\n\n2. 【关联点】本句用过去完成时 had happened 表示“遭遇”发生在“解释”之前。这和我们之后会遇到的 the light she had seen 用法完全相同，都是用来标记一个“更早的过去”动作。\n\n3. 词汇 be able to 强调“有能力”或“条件允许”，比 can 更侧重于克服困难后才能做到，符合此处语境。"
    },
    {
        "english": "One afternoon she set out from the coast in a small boat and was caught in a storm.",
        "chinese": "一天下午，她乘小船从海岸出发，遇上了风暴。",
        "note": "1. 句型：本句用 and 连接两个连续动作。注意从主动的 set out (出发) 到被动的 was caught in (遭遇) 的转变，生动地表现了主人公命运的突然转折。\n\n2. 【关联点】注意区分本句的 coast 和之后多次出现的 shore。coast (海岸) 指的是一个国家或地区沿海的广阔区域，而 shore (岸边) 则更具体，指水体与陆地交接的边缘。\n\n3. 短语 be caught in 形象地表示“突然遭遇，被困于”，常用于天气或交通等无法控制的状况，如 be caught in the rain (淋雨了)。"
    },
    {
        "english": "Towards evening, the boat struck a rock and the girl jumped into the sea.",
        "chinese": "天将黑时，小船撞在了一块礁石上，姑娘跳进了海里。",
        "note": "1. 句型: 本句用 and 连接两个接连发生的动作 (撞上礁石 -> 跳入海中)，快速推进了故事情节。【关联点】这和我们之前遇到的 she set out... and was caught in a storm 结构类似，都是用 and 串联起关键事件，制造紧张感。\n\n2. 词汇 towards: 此处 towards evening 指时间上的“临近”，强调傍晚将至。【关联点】注意区分之后遇到的 towards the light，后者表示空间方向上的“朝向”。同一个词，用法不同，一个是时间，一个是空间。\n\n3. 词汇 strike (过去式 struck): 意为“撞击”，常用于描述突发的、猛烈的碰撞。记住其不规则的过去式 struck。"
    },
    {
        "english": "Then she swam to the shore after spending the whole night in the water.",
        "chinese": "她在海里游了整整一夜才游到岸边。",
        "note": "1. 句型 after spending... (介词 after + 动名词) 清晰地交代了动作的先后顺序：先“在水中过夜”，然后才“游到岸边”。这是一种高效表达动作先后关系的常用结构。\n\n2. 【关联点】这里的 after spending 和我们之后会遇到的 On arriving at the shore 结构完全相同，都是用“介词 + V-ing”的形式作时间状语，引出主句的动作，这是非常地道的用法。\n\n3. 词汇 spend 的核心用法是 spend time doing sth. (花时间做某事)。【关联点】注意 shore (岸边) 的再次出现，这和我们之前遇到的 coast (海岸，指大范围区域) 形成对比，表明她已抵达具体的水陆交界处。"
    },
    {
        "english": "During that time she covered a distance of eight miles.",
        "chinese": "在那段时间里，她游了8英里。",
        "note": "1. 核心短语 cover a distance of... 意为“行进了…的距离”，是描述路程的常用句式。这里的动词 cover 强调完成了一段旅程，而非“覆盖”。\n\n2. 【关联点】本句是对女孩游泳求生的量化总结。注意它和之前 swam to the shore 的区别：swam 描述动作过程，而 covered a distance 强调动作的结果和总量，体现了她惊人的毅力。"
    },
    {
        "english": "Early next morning, she saw a light ahead. She knew she was near the shore because the light was high up on the cliffs.",
        "chinese": "第二天凌晨，她看到前方有灯光，知道自己已经接近岸边了，因为那灯光是在高高的峭壁上。",
        "note": "1. 句型 ...because... 揭示了主人公的推理过程：看到高处的光（证据），得出靠近岸边的结论（判断）。这是英语中表达因果逻辑的直接方式。\n\n2. 【关联点】本句的 shore (岸边) 和 cliffs (峭壁) 再次出现，它们是女孩求生的关键地标。这和我们之前遇到的 swam to the shore 和 struggled up the cliff 紧密相连，构成了完整的行动路线。\n\n3. 【关联点】注意 a light (一盏灯) 和之后 the light she had seen (她看到的那盏灯) 的区别。前者是首次提及，后者是特指。这盏灯是推动情节的关键线索，连接了她的发现与行动。"
    },
    {
        "english": "On arriving at the shore, the girl struggled up the cliff towards the light she had seen.",
        "chinese": "到达岸边后，姑娘朝着她看到的灯光方向挣扎着往峭壁上爬去。",
        "note": "1. 句型 On arriving at... 意为“一到达…就…”，表示动作紧密衔接。【关联点】这和我们之前遇到的 after spending 结构完全相同，都是用“介词 + V-ing”作时间状语，简洁高效。\n\n2. 时态 the light she had seen 用过去完成时，强调“看见光”发生在“爬”之前。【关联点】这呼应了开篇的 what had happened to her，用法一致。同时，the light 特指了之前 saw a light 里的那盏灯，是故事的关键线索。\n\n3. 词汇 towards the light 表示空间上的“朝向”。【关联点】注意区分之前遇到的 towards evening，后者表示时间上的“临近”。同一个词，在不同语境下指代空间或时间，非常灵活。"
    },
    {
        "english": "That was all she remembered.",
        "chinese": "她所记得的就是这些。",
        "note": "1. 句型 \"That was all (that) she remembered\" 是一个强调句式，核心是 \"That was all\" (那就是全部)。后面的 \"she remembered\" 像一个标签，具体说明 \"all\" 指的是什么内容。注意，口语中常省略 that。\n\n2. 【关联点】这个结构和我们之前遇到的 the light she had seen 完全相同。she remembered 用来修饰 all，正如 she had seen 用来修饰 the light。这都是省略了关系代词 that 的定语从句，是英语中非常地道的用法。\n\n3. 词汇 all 在此作代词，指“所有的事情”。这个句子有力地强调了女孩记忆的残缺与有限，暗示了创伤的严重性，为她接下来讲述的有限内容做了铺垫。"
    },
    {
        "english": "When she woke up a day later, she found herself in hospital.",
        "chinese": "第二天她醒来时，发现自己躺在医院里。",
        "note": "1. 核心短语 find oneself 意为“发现自己意外地身处某地或某种状态”。其结构为 find + 反身代词(herself) + 地点/状态(in hospital)，生动描绘了她醒来后的惊讶与迷茫。\n\n2. 句型 \"When..., ...\" 是经典的时间状语从句结构，前半句交代背景时间（醒来时），后半句引出主要事件（发现身在医院），使叙事层次分明，是讲故事的常用手法。\n\n3. 【关联点】本句用 \"When...\" 从句交代时间，这和我们之前遇到的 \"after spending...\" 和 \"On arriving at...\" 作用类似，都是引出主句动作的“时间状语”，但本句用的是一个完整的从句结构。"
    }
]