[
    {
        "english": "Tired of sleeping on the floor, a young man in Teheran saved up for years to buy a real bed.",
        "chinese": "德黑兰的一个人年轻人由于对睡地板感到厌倦，于是积蓄多年买了一张真正的床。",
        "note": "1. 核心短语: Tired of doing sth. 意为“对做某事感到厌倦”，是一种非常地道的表达。save up 则是指为了特定目的而“攒钱，储蓄”。\n\n2. 句首的 “Tired of sleeping on the floor,” 是整个句子的原因状语，点明了年轻人攒钱的动机。它用一个简洁的短语，替代了完整的从句，让表达更精炼。\n【关联点】这和我们之后遇到的 “Because the weather was very hot...” 作用相同，都是解释原因，但这里的用法更显简洁。\n\n3. 句中 “for years” (多年) 用来补充动作持续的时间。\n【关联点】这和我们之后遇到的 “for the first two nights” (头两个晚上) 用法一致，都是 “for + 时间段” 结构，表示动作持续了多久。"
    },
    {
        "english": "For the first time in his life, he became the proud owner of a bed which had springs and a mattress.",
        "chinese": "他平生第一次自豪地拥有了一张既有弹簧又带床垫的床。",
        "note": "1. 句子的核心是 “he became the proud owner of a bed”，一个主谓表结构，说明“他”变成了什么。关键在于后面的 “which had springs and a mattress”，这是一个定语从句，像一个标签，具体描述了这张床的特点。\n【关联点】这和我们之后遇到的 “...the bits of wood and metal that lay around him” 中的 “that” 从句功能完全相同，都是用来修饰前面的名词。\n\n2. 句首的 “For the first time in his life” 是一个固定的时间状语，强调这是“平生第一次”，为整个故事增添了特殊意义。\n【关联点】注意它与我们遇到的 “for the first two nights” (头两个晚上) 的区别：“For the first time” 强调的是次数（第一次），而 “for + 时间段” 则强调动作持续了多久。\n\n3. “proud owner” (自豪的主人) 是一个地道搭配，生动地表达了人物获得心爱之物后的喜悦与满足感。这比简单说 “he owned a bed” 更有感情色彩。"
    },
    {
        "english": "Because the weather was very hot, he carried the bed on to the roof of his house.",
        "chinese": "由于天气很热，他便把床搬到了他的屋顶上。",
        "note": "1. “Because”引导原因状语从句，直接点明“搬床”的原因，是最清晰的因果表达。【关联点】这和我们之前遇到的 “Tired of...” 作用相同，但 “Because” 引导的是一个完整的句子，而 “Tired of...” 是一个更简洁的短语。\n\n2. 核心动词 carry (搬运) 搭配介词 on to，生动描绘了“搬到……上面”的方向。【关联点】注意对比之后遇到的 “carried it into his house” (搬进屋里)。介词 on to 和 into 精准地表达了不同的移动方向。"
    },
    {
        "english": "He slept very well for the first two nights, but on the third night, a storm blew up.",
        "chinese": "头两天晚上，他睡得非常好。但第三天晚上起了风暴。",
        "note": "1. 这是一个由 “but” 连接的转折句，清晰对比了前两晚的平静与第三晚的风暴突起。【关联点】这和我们之后遇到的 “Although...” 都表示转折，但 “but” 连接两个独立句子，结构更直接。\n\n2. 时间短语 “for the first two nights” 表示动作持续的时间段。【关联点】这和我们之前遇到的 “for years” 用法完全一致，都是 “for + 时间段” 结构，强调持续性。\n\n3. 动词短语 “blew up” 生动地表示风暴“突然刮起，爆发”。【关联点】注意它和之后 “swept the bed” (刮走了床) 的区别：“blew up” 是风暴自己发生，而 “swept” 是风主动发出的动作，后面需要跟宾语。"
    },
    {
        "english": "A gust of wind swept the bed off the roof and sent it crashing into the courtyard below.",
        "chinese": "一阵大风把床从屋顶上刮了下来，把它摔碎在下面的院子里。",
        "note": "1. 核心动词 sweep (刮走) 是及物动词，后面必须跟宾语 the bed。【关联点】这和我们之前遇到的 a storm blew up (风暴刮起) 不同。“blew up” 指风暴自己发生，是不及物用法，而 “swept” 是风主动发出的动作。\n\n2. 关键结构是 “sent it crashing”，即 “动词+宾语+现在分词”，表示 “使宾语处于……的状态”。这里的 crashing 生动描绘了床猛烈撞击的动态过程，比单纯说 “sent it and it crashed” 更简洁有力。\n\n3. 词汇 crash (猛撞摔碎)。【关联点】注意区分本课中描述“撞击”的几个词：crash (猛撞摔碎), smash (打碎，强调破碎结果，如 bed was smashed to pieces), 和 strike (击打，如 bed had struck the ground)。"
    },
    {
        "english": "The young man did not wake up until the bed had struck the ground.",
        "chinese": "那年轻人直到床撞到地上才醒了过来。",
        "note": "1. 核心句型 not...until... 意为“直到……才……”，强调主句的动作是在从句的动作发生之后才发生的，点明了“醒来”这个动作的触发条件。\n【关联点】这和我们之后遇到的 When... 和 After... 类似，都是引导时间状语从句，但 not...until 结构更强调一个动作的“临界点”。\n\n2. 注意时态的搭配：从句用过去完成时 (had struck)，表示“床撞地”这个动作发生在主句的过去时动作 (did not wake up) 之前。这是叙述过去事件先后顺序的经典用法。\n【关联点】这里的时态用法和我们之后遇到的 After he had put it on the floor... 完全一致，都是用过去完成时表示一个更早发生的过去动作。\n\n3. 动词 strike (struck) 意为“撞击”。\n【关联点】注意区分本课中几个表示“撞击”的词：strike 是一般的撞击；crash 侧重猛烈撞击并发出巨响；而 smash 则强调“打碎，摔碎”的结果，如 the bed was smashed to pieces。"
    },
    {
        "english": "Although the bed was smashed to pieces, the man was miraculously unhurt.",
        "chinese": "尽管床摔成了碎片，但年轻人却奇迹地没有受伤。",
        "note": "1. 核心句型是 “Although..., ...”，引导一个让步状语从句，意为“尽管……，但……”，用来表达强烈的转折。\n【关联点】这和我们之前遇到的 “but” 功能类似。但 “Although” 从句在前，主句在后；而 “but” 则直接连接两个独立的句子，结构更直接。\n\n2. 动词 smash (打碎) 搭配短语 to pieces，生动地描绘了“摔得粉碎”的结果。\n【关联点】注意区分本课中几个“撞击”动词：smash 强调破碎结果；crash 侧重猛烈撞击的过程；strike 则是一般的击打。\n\n3. 形容词 unhurt (未受伤的) 中的前缀 un- 表示“不，非”，是一种常见的否定前缀。副词 miraculously (奇迹般地) 则强调了结果的出人意料。"
    },
    {
        "english": "When he woke up, he was still on the mattress.",
        "chinese": "他醒来时，仍然躺在床垫上。",
        "note": "1. 核心结构是“When..., ...”，用一个时间状语从句设定主句动作发生的时间背景。【关联点】这和我们之后遇到的 “After...” 结构类似，都是交代时间，但 “not...until...” 更强调动作发生的临界点。\n\n2. 动词短语 wake up (过去式 woke up) 意为“醒来”。副词 still (仍然) 强调状态的持续。【关联点】这里的 woke up 与之前 The young man did not wake up 形成情节对比。\n\n3. 名词 mattress (床垫)。【关联点】这是那张“有弹簧和床垫”的床唯一幸存的部分。在床被 smashed to pieces 后，他捡起的也正是这个 mattress，这个词串联了故事的关键物品。"
    },
    {
        "english": "Glancing at the bits of wood and metal that lay around him, the man sadly picked up the mattress and carried it into his house.",
        "chinese": "年轻人看了一眼周围的碎木片和碎金属片，伤心地捡起了床垫，把它拿进了屋。",
        "note": "1. 句首的 Glancing at... 是一个现在分词短语，生动地描绘了主语的伴随动作，为后面的主句行为 picked up and carried 铺垫了场景。副词 sadly 则点明了人物此刻悲伤的心情。\n\n2. 核心动作由 and 连接：picked up (捡起) 和 carried (搬运)。\n【关联点】这里的 carried it into his house (搬进屋里) 与之前遇到的 carried the bed on to the roof (搬上屋顶) 形成对比，介词 into 和 on to 精准地展示了不同的移动方向。\n\n3. 短语 that lay around him 是一个定语从句，像标签一样修饰前面的 wood and metal。\n【关联点】这和我们之前遇到的 which had springs and a mattress 功能完全相同，都是用一个从句来具体描述名词。"
    },
    {
        "english": "After he had put it on the floor, he promptly went to sleep again.",
        "chinese": "他把床垫往地板上一放，很快又睡着了。",
        "note": "1. 核心结构是 “After..., ...”，引导一个时间状语从句，清晰地表明了动作的先后顺序：先“放”，后“睡”。\n【关联点】这和我们之前遇到的 When... 类似，都是交代时间背景。但 After 强调动作的完成，而 not...until... 则更侧重于一个动作触发另一个动作的临界点。\n\n2. 注意从句中的过去完成时 (had put)。它强调“放床垫”这个动作，发生在主句“睡着了”(went to sleep) 之前。\n【关联点】这里的时态用法和我们之前遇到的 ...until the bed had struck the ground 完全一致，都是用过去完成时来表示一个更早发生的过去动作，是叙事中的经典手法。\n\n3. 副词 promptly (迅速地) 生动地描绘了入睡的速度之快，暗示了主人公的疲惫。\n【关联点】注意本课中副词的运用：这里的 promptly 描述动作的速度，而之前的 miraculously (奇迹般地) 和之后的 sadly (悲伤地) 则为动作增添了情感色彩。"
    }
]