[
    {
        "english": "Firemen had been fighting the forest for nearly three weeks before they could get it under control.",
        "chinese": "消防队员们同那场森林大火搏斗了将近3个星期才最后把火势控制住。",
        "note": "1. 核心短语: fight a fire (灭火) 指与火搏斗的过程，而 get... under control (控制住) 则是成功控制局面的结果。两者清晰地描述了行动与最终成效。\n\n2. 句型解析: 句子的关键是时态 “had been doing... before... could do”，它生动地描绘了一个持续很久的动作（搏斗了三周），最终被另一个过去的动作（控制住）所终结。【关联点】这里的 had been fighting 强调搏斗的持续过程，这和我们之后遇到的 The planes had been planting seed... (飞机一直在播种) 用法完全相同。注意它和 had done (已完成) 的区别，如 great trees had covered... (已经覆盖)。"
    },
    {
        "english": "A short time before, great trees had covered the countryside for miles around.",
        "chinese": "就在不久之前，参天大树还覆盖着方圆数英里的土地。",
        "note": "1. 句型解析: 句子的核心是过去完成时 had covered，意为“过去的过去”。它描绘了一个在故事主要时间点（大火之后）之前早已存在的状态：大树曾经覆盖着广袤的土地。短语 for miles around 形象地描绘出“方圆数英里”的辽阔景象。\n\n2. 【关联点】注意区分完成状态与持续动作。这里的 had covered (已经覆盖) 是一个完成的状态，这和我们之后遇到的 the grass had already taken root (草已生根) 类似。而我们之前遇到的 Firemen had been fighting... (一直在搏斗) 则用 had been doing 强调动作的持续性。"
    },
    {
        "english": "Now, smoke still rose up from the warm ground over the desolate hills.",
        "chinese": "而现在，发热的地面上仍然升腾着烟雾，弥漫在荒凉的山丘上。",
        "note": "1. 核心动词: rose up (升起)。这个简单的动作通过两个介词短语被描绘得十分生动: from the warm ground (指明来源) 和 over the desolate hills (描绘路径与范围)。形容词 desolate (荒凉的) 是营造灾后萧索氛围的关键。\n\n2. 【关联点】注意时态的重大转变。此前描述背景时，我们用了过去完成时 (如 great trees had covered...)。而这里的 rose (一般过去时) 则将镜头拉回“当时”的现场，标志着叙事正式开始。这是从“背景铺垫”到“实时描绘”的切换信号。"
    },
    {
        "english": "Winter was coming on and the hills threatened the surrounding villages with destruction, for heavy rain would not only wash away the soil but would cause serious floods as well.",
        "chinese": "冬季即将来临，这些山丘对周围的村庄具有毁灭性的威胁，因为大雨不仅会冲走土壤，而且还会引起严重的水灾。",
        "note": "1. 核心短语: threaten... with destruction (以毁灭来威胁)。句子用 for (因为) 引导原因，清晰地展示了“季节来临→产生威胁→解释原因”的逻辑链条。动词短语 come on 生动地表示季节的“降临”。\n\n2. 【关联点】这和我们之前遇到的 smoke still rose up... over the desolate hills 类似，都描绘了山丘的负面景象。结构 not only... but... as well 强调了双重破坏效果：冲走土壤，并引发洪水，极具说服力。"
    },
    {
        "english": "When the fire had at last been put out, the forest authorities ordered several tons of a special type of grass-seed which would grow quickly.",
        "chinese": "在大火最后被扑灭后，森林管理当局订购了好几吨一种生长迅速的特殊类型的草籽。",
        "note": "1. 句型解析: 这是一个典型的“时间状语从句 + 主句 + 定语从句”结构。它清晰地展示了事件的逻辑顺序：大火被扑灭 (前提) → 当局订购草籽 (行动) → 草籽能快速生长 (特性)。\n\n2. 核心时态: had been put out (被扑灭) 是过去完成时的被动语态，强调“扑灭”这个动作在“订购”之前已经由他人完成。【关联点】这和我们之后遇到的 The seed was sprayed... (种子被喷洒) 都是被动语态，但时态不同。注意区分：had been put out 强调动作发生在“过去的过去”，而 was sprayed 仅表示过去发生的动作。\n\n3. 关键从句: which would grow quickly 是一个定语从句，用来修饰前面的 grass-seed。【关联点】这和我们之后遇到的 In place of the great trees which had been growing... 用法完全相同，都是用 which 来具体描述前面的名词。"
    },
    {
        "english": "The seed was sprayed over the ground in huge quantities by aeroplanes.",
        "chinese": "飞机把这种草籽大量地撒播在地上。",
        "note": "1. 核心结构: 这是一个典型的被动语态句，结构为“主语 + was + 动词过去分词”。主语 seed (种子) 并非动作的发出者，而是“被喷洒”的对象。句末的 by aeroplanes 则点明了动作的执行者。短语 in huge quantities (大量地) 形象地说明了播撒的规模。\n\n2. 【关联点】这和我们之前遇到的 When the fire had at last been put out 都是被动语态，但请注意区分时态。had been put out (已先被扑灭) 用过去完成时，强调动作发生在“订购种子”这个过去动作之前。而这里的 was sprayed (被喷洒) 则用一般过去时，描述一个单纯的过去事件，不强调其先后顺序。"
    },
    {
        "english": "The planes had been planting seed for nearly a month when it began to rain.",
        "chinese": "飞机撒播近一个月后，开始下起雨来。",
        "note": "1. 句型解析: 句子的核心时态是“had been doing... when... did”，它描绘了一个持续已久的背景动作（一直在播种），被另一个突然发生的动作（开始下雨）所打断。过去完成进行时 had been planting 形象地强调了播种这个动作的漫长与持续。\n\n2. 【关联点】这个时态用法和我们遇到的 Firemen had been fighting... (消防员一直在搏斗) 完全相同，都强调一个动作在过去某个节点前持续了很久。请注意区分它和表示“完成状态”的过去完成时，如 great trees had covered... (已经覆盖)。"
    },
    {
        "english": "By then, however, in many places the grass had already taken root.",
        "chinese": "然而到那时，很多地方的草已经生了根。",
        "note": "1. 核心短语: take root (生根)，形象地描绘了新生命的开始。时态 had already taken root 强调在“那时”(By then) 这个过去的时间点之前，生根的动作已经完成，标志着一个积极的转折。\n\n2. 【关联点】这和我们之前遇到的 great trees had covered... (已经覆盖) 类似，都使用过去完成时表示一个完成的状态。请注意区分它和强调“持续动作”的过去完成进行时，如 Firemen had been fighting... (一直在搏斗)。一个是“已完成”，一个是“一直在做”。"
    },
    {
        "english": "In place of the great trees which had been growing there for centuries patches of green had begun to appear in the blackened soil.",
        "chinese": "一片片的绿草开始出现在这片烧焦的土地上，代替了多少世纪以来一直生长在那里的参天大树。",
        "note": "1. 核心短语: In place of (代替)。它引出新旧事物的更替：patches of green (一片片的绿草) 出现在 blackened soil (烧焦的土地) 上，取代了参天大树。这标志着毁灭后的新生。\n\n2. 关键从句与时态: which had been growing... 是一个定语从句，用过去完成进行时生动描绘了树木长达数世纪的持续生长状态。【关联点】这和我们之前遇到的 Firemen had been fighting... (一直在搏斗) 用法完全相同，都强调动作的持续性。注意区分表示完成状态的 had covered (已覆盖)。"
    }
]