[
    {
        "english": "My daughter, Jane, never dreamed of receiving a letter from a girl of her own age in Holland.",
        "chinese": "我的女儿简从未想过会接到荷兰一位同龄姑娘的来信。",
        "note": "1. 核心短语 `dream of doing sth.` 意思是“梦想做某事”，在本句中引申为“从未想过会发生某事”，表达了强烈的意外感。\n\n2. 【关联点】注意区分 `dream of` 和我们遇到的 `think of`。`dream of` 强调“梦想，未曾料想”，情感更强烈；而 `think of` 仅表示“想起，想到”，是更中性的回忆或思考。\n\n3. `receiving` 是动名词，作介词 `of` 的宾语。【关联点】这和我们后面遇到的 `she received a letter` 中的 `received` 是同一个词。这里用-ing形式是因为它跟在介词 `of` 后面。\n\n4. 句型为“主语 + never dreamed of + 动名词短语”。这里的动名词短语 `receiving a letter...` 整体作为 `dreamed of` 的宾语，说明了她“从未想过”的具体内容。"
    },
    {
        "english": "Last year, we were travelling across the Channel and Jane put a piece of paper with her name and address on it into a bottle.",
        "chinese": "去年，当我们横渡英吉利海峡时，简把写有她姓名和住址的一张纸条装进了一只瓶子，又将瓶子扔进了大海。此后她就再没去想那只瓶子。",
        "note": "1. 句首的 we were travelling (过去进行时) 描绘了一个持续的背景动作：当时我们正在横渡海峡。这为后面简的突然举动提供了场景。【关联点】这里的 travel 指人“行进”，和后面信件的 travel (传递) 意思不同，注意体会词汇在不同语境下的活用。\n\n2. 核心动作是 put sth. into... (把某物放进某处)。【关联点】这和我们遇到的 She threw the bottle into the sea 句型完全一样，都是“动词+宾语+into地点”的结构，生动地描述了动作和方向。\n\n3. a piece of paper with her name and address on it 这个长短语是宾语。其中 with...on it 用来补充说明纸上“带有”什么内容，是一种常见的修饰方法，让描述更具体。\n\n4. 整个句子由 and 连接两个部分，清晰地叙述了事件的先后顺序：先是“我们正在渡海”，然后是“简把纸条放进瓶子”。【关联点】这和后面用 but 连接两个句子来表示转折是类似的语法功能。"
    },
    {
        "english": "She threw the bottle into the sea.",
        "chinese": "去年，当我们横渡英吉利海峡时，简把写有她姓名和住址的一张纸条装进了一只瓶子，又将瓶子扔进了大海。此后她就再没去想那只瓶子。",
        "note": "1. 核心句型是“动词+宾语+into+地点”，生动描绘了“扔”这个动作的方向。【关联点】这个结构和我们之前遇到的 Jane put a piece of paper... into a bottle 完全一致，都是描述将某物移动到某处，可以对比学习。\n\n2. 动词 threw 是 throw (扔) 的过去式，表明“扔瓶子”这个动作已经完成。\n\n3. the bottle 特指上一句中简放入纸条的那只瓶子，使用定冠词 the 表明了上下文的承接关系，让故事的叙述更连贯。"
    },
    {
        "english": "She never thought of it again, but ten months later, she received a letter from a girl in Holland.",
        "chinese": "但10个月以后，她收到了荷兰一位姑娘的来信。",
        "note": "1. 这是一个由 but 连接的转折句，清晰地展现了故事的意外发展：前半句是“再也没想过”（遗忘），后半句是“却收到了信”（惊喜）。【关联点】这和我们之前用 and 连接两个顺承动作的句子不同。\n\n2. 【关联点】thought of (想起) 是 think of 的过去式。这和我们之前遇到的 dream of (梦想，未曾料想) 形成对比，think of 情感更平淡，只表示简单的“想到”。\n\n3. 【关联点】received 是动词 receive 的过去式，直接作谓语。这和我们遇到的 dream of receiving 中的动名词 receiving 形式不同。一个是句子核心动作，一个跟在介词后。\n\n4. ten months later (十个月后) 是一个典型的时间状语结构：“时间段 + later”。它精确地标明了事件发生的时间点，推动了故事发展。"
    },
    {
        "english": "Both girls write to each other regularly now.",
        "chinese": "现在这两位姑娘定期通信了。",
        "note": "1. 核心短语 write to each other 意为“互相通信”。each other 强调了动作是双向的，发生在两个人之间，点明了她们成为了笔友。\n\n2. 【关联点】这与之前 Jane 靠扔瓶子这种不确定的方式传递信息形成鲜明对比。现在的通信是双向且 regularly (定期) 的，关系更稳定。\n\n3. 【关联点】write to (写信给) 与我们遇到的 received a letter from (收到来自...的信) 构成了一组核心动作，共同描绘了“通信”的全过程。"
    },
    {
        "english": "However, they have decided to use the post office.",
        "chinese": "然而她们还是决定利用邮局。",
        "note": "1. 核心短语 decide to do sth. 意为“决定做某事”。这里的 to use the post office 是不定式短语，作宾语，清晰说明了决定的内容。\n\n2. 动词 have decided 是现在完成时，强调过去的“决定”对现在有直接影响：她们现在要开始用邮局了，这也引出了下文对邮寄利弊的讨论。\n\n3. 【关联点】句首的 However, (然而) 起到了强烈的转折作用。这和我们之前遇到的用 but 连接两个分句的功能类似，都用来引出与前文不同的情况。\n\n4. 【关联点】注意动词后的搭配：decide to do (后接不定式)，而我们之前学过的 dream of doing (后接动名词)。这是两种常见的动词用法，需要区分记忆。"
    },
    {
        "english": "Letters will cost a little more, but they will certainly travel faster.",
        "chinese": "这样会稍微多花点钱，但肯定是快得多了。",
        "note": "1. 这是一个典型的利弊权衡句，用 but 连接了邮寄的缺点 (cost a little more) 与优点 (travel faster)。【关联点】这和我们之前遇到的 'She never thought..., but...' 结构完全一样，都用于引出对比或转折。\n\n2. cost a little more 和 travel faster 是两个核心对比点。more 和 faster 都是比较级，清晰地指出了邮寄在“价格”和“速度”上的变化。\n\n3. 【关联点】这里的 travel 指信件的“传递”，是一种拟人化的用法。这和我们之前遇到的 we were travelling (人们“行进”) 意思不同，展现了同一个词在不同语境下的灵活运用。"
    }
]