[
    {
        "english": "I have just received a letter from my old school, informing me that my former headmaster, Mr. Stuart Page, will be retiring next week.",
        "chinese": "我刚刚收到母校的一封信，通知我说以前的校长斯图亚特.佩奇先生下星期就退休了。",
        "note": "1. 核心词汇：former 意为“以前的”，headmaster 指“校长”（尤用于英式英语），retiring 是动词 retire (退休) 的现在分词形式。\n\n2. 【关联点】注意 former 这个词，我们稍后会遇到 'former pupils' (老同学)。同样，这里的 retiring (即将退休) 与后文的 retirement (名词) 和 retired (动词过去分词) 都围绕同一主题。\n\n3. 句型解析：主句是 I have just received a letter... (我刚收到一封信)。逗号后的 informing... 是现在分词短语，补充说明信件的功能是“通知我”。that 后面则引出了通知的具体细节。\n\n4. 【关联点】这里的 will be retiring (将要退休) 使用了将来进行时，表示一个已安排好的未来计划。这和我们之后遇到的 will be sending (将要寄送) 和 will be attending (将要参加) 的用法完全一致，是本文的一个常用时态。"
    },
    {
        "english": "Pupils of the school, old and new, will be sending him a present to mark the occasion.",
        "chinese": "为了纪念这个日子，学校的学生——无论老同学还是新同学——将送他一件礼物。",
        "note": "1. 核心词汇：Pupils 指中小学生。present 意为“礼物”。to mark the occasion 是一个固定搭配，意为“为了纪念这个场合”。\n\n2. 【关联点】这里的 present (礼物) 和我们稍后会遇到的 gift (礼物) 是同义词，可以互换使用，都指为了表达心意而赠送的物品。\n\n3. 句型解析：主干是“送给某人某物”(send him a present)。中间的 old and new 是插入语，补充说明主语 pupils。句末的 to mark... 是目的状语，解释送礼的原因。\n\n4. 【关联点】时态 will be sending (将要寄送) 是将来进行时，表示计划好的未来安排。这和我们遇到的 will be retiring 和 will be attending 用法一致。"
    },
    {
        "english": "All those who have contributed towards the gift will sign their names in a large album which will be sent to the headmaster's home.",
        "chinese": "所有凑钱买此礼品的人都将自己的名字签在一本大签名簿上，签名簿将被送到校长的家里。",
        "note": "1. 核心词汇：contribute towards (为...捐助)，album (签名簿)。【关联点】这里的 gift (礼物) 和我们之前遇到的 present 是同义词，都指为校长准备的赠品。\n\n2. 句型解析：本句主干是 All those will sign their names in an album。它巧妙地用两个定语从句来添加细节：第一个 who... 从句限定了是“哪些人”，第二个 which... 从句则描述了是“什么样的签名簿”。\n\n3. 定语从句对比：who have contributed... 用 who 来修饰人 (those)。【关联点】这和我们之前遇到的 the encouragement he gave us 类似，都是修饰名词的从句。注意区分：who 指人，which 指物，而 he gave us 中省略了指物的 that。\n\n4. 关键语法：注意 which will be sent... (将被送到...) 使用了将来时的被动语态。这表明 album (签名簿) 是动作的承受者，而不是发出者，强调了“被”送过去这一事实。"
    },
    {
        "english": "We shall all remember Mr. Page for his patience and understanding and for the kindly encouragement he gave us when we went so unwillingly to school.",
        "chinese": "我们不会忘记佩奇先生对我们既有耐心又充满理解， 也不会忘记在我们不愿去上学时他给予我们的亲切鼓励。",
        "note": "1. 核心词汇：patience (耐心)，encouragement (鼓励)，unwillingly (不情愿地)。注意 encouragement 是名词，其动词形式是 encourage。\n\n2. 句型解析：核心结构是 remember sb for sth (因某事而记住某人)。本句用两个并列的 for 短语，清晰列出了我们记住佩奇先生的两大原因：他的品格和他的鼓励。\n\n3. 【关联点】注意 the encouragement (that) he gave us 是一个省略了关系代词的定语从句。这和我们之前遇到的用 who 和 which 引导的从句一样，都是用来修饰名词的，用法更简洁。\n\n4. 时态运用：主句用 shall remember (将来时) 表达一种郑重的、未来的怀念，而从句用 gave 和 went (过去时) 回忆往事，时态对比鲜明，情感真挚。"
    },
    {
        "english": "A great many former pupils will be attending a farewell dinner in his honour next Thursday.",
        "chinese": "很多老同学都准备参加下星期四为他举行的告别宴会。",
        "note": "1. 核心词汇：A great many (大量的，比many语气更强)，attend (出席)，farewell dinner (告别宴会)。in his honour 是一个固定搭配，意为“为了向他表示敬意”。\n\n2. 【关联点】这里的 former pupils (老同学) 与开篇遇到的 former headmaster (前任校长) 用法一致，former 意为“以前的”，用来修饰名词。\n\n3. 【关联点】时态 will be attending (将要参加) 再次使用了将来进行时。这和我们之前遇到的 will be retiring 和 will be sending 用法完全一致，都表示一个已计划好的未来安排。\n\n4. 句型解析：句子的主干是 pupils will be attending a dinner。in his honour 是目的状语，解释为何举办宴会。【关联点】这和之前遇到的 to mark the occasion (为了纪念) 功能类似，都是用来回答 Why 的。"
    },
    {
        "english": "It is a curious coincidence that the day before his retirement, Mr. Page will have been teaching for a total of forty years.",
        "chinese": "佩奇先生退休的前一天正好是他执教满40年的日子，这真是奇妙的巧合。",
        "note": "1. 核心词汇：curious coincidence (奇妙的巧合)，retirement (退休)。【关联点】注意 retirement 是名词，这和我们之前遇到的动词 retiring (即将退休) 和之后将遇到的 retired (已经退休) 是一家人，都围绕“退休”这一主题。\n\n2. 关键时态：will have been teaching (将来完成进行时) 强调到未来某个时间点（退休前一天），一个动作已经持续了多久。【关联点】注意区分本文多次出现的将来进行时，如 will be attending (将要参加)，它只表示未来某个时段的安排，而本句时态则强调了动作的“持续时长”。\n\n3. 句型解析：本句采用“It is... that...”结构，It 是形式主语，真正的主语是后面的 that 从句。这种结构常用于强调前面的形容词或名词（如 a curious coincidence），避免句子头重脚轻，使表达更自然。"
    },
    {
        "english": "After he has retired, he will devote himself to gardening.",
        "chinese": "他退休后，将致力于园艺。",
        "note": "1. 核心词汇：devote oneself to sth 是一个固定搭配，意为“致力于某事”或“投身于某事”，表示全身心投入。这里的 gardening (园艺) 就是他退休后投入的事情。\n\n2. 关键语法：在由 After, when 等引导的时间状语从句中，用现在完成时 (has retired) 表示将来已经完成的动作，而主句则使用将来时 (will devote)。这是一个重要的时态规则。\n\n3. 【关联点】这里的 has retired (已经退休) 与我们之前遇到的 retiring (即将退休) 和 retirement (名词) 属于同一词汇家族。通过它们，课文从不同角度描述了“退休”这件事。\n\n4. 【关联点】注意区分时态。本文多次使用 will be attending 等将来进行时来描述已安排好的活动。而这里的 will devote (简单将来时) 则更侧重于表达主观的计划和意愿。"
    },
    {
        "english": "For him, this will be an entirely new hobby.",
        "chinese": "对于他来说，这将是一种全新的爱好。",
        "note": "1. 核心词汇：entirely (副词) 意为“完全地”，用来加强形容词的语气，如 entirely new (全新的)。hobby (名词) 指“爱好”。\n\n2. 句型解析：本句是主谓表结构 (This will be a hobby)，用来定义主语“是什么”。【关联点】这和我们之前遇到的 It is a curious coincidence... 结构类似，都是用系动词 be 来连接主语和表语。\n\n3. 【关联点】注意时态区分。本文多次使用 will be attending 等将来进行时，表示已安排好的活动。而这里的 will be (简单将来时) 则更直接地陈述一个未来的事实或状态。\n\n4. 【关联点】这里的 hobby (爱好) 指的是什么？就是我们之前提到的 gardening (园艺)。通过这句话，我们知道了园艺将成为校长退休后的新爱好。"
    },
    {
        "english": "But this does not matter, for, as he has often remarked, one is never too old to learn.",
        "chinese": "但这没有关系，因为正如他常说的那样，人要活到老学到老。",
        "note": "1. 核心词汇：matter 在此是动词，意为“要紧”，does not matter 即“没关系”。one is never too old to learn 是一句谚语，意为“活到老学到老”，其中 one 泛指“任何人”。\n\n2. 句型解析：核心句型是 too...to... (太...而不能...)。但前面加上 never 后，否定了其消极含义，变成了“永远不会太...而不能...”，是一种充满鼓励的肯定表达。\n\n3. 【关联点】这里的 for 引导原因，意为“因为”。这和我们之前遇到的 remember Mr. Page for his patience... (因他的耐心而记住他) 中的 for 功能相似，都是用来解释原因。\n\n4. 【关联点】注意 as he has often remarked 是一个插入语，用来补充说明信息。这和我们之前遇到的 Pupils..., old and new,... 类似，都是在句子中间插入补充成分，使表达更灵活。"
    }
]