[
    {
        "english": "During a bullfight, a drunk suddenly wandered into the middle of the ring.",
        "chinese": "在一次斗牛时，一个醉汉突然溜达到斗牛场中间，",
        "note": "1. 核心词汇: drunk (n.) 醉汉; wander (v.) 溜达，漫无目的地走; ring (n.) 此处指斗牛的圆形场地; suddenly (adv.) 突然地。\n\n2. 【关联点】副词 suddenly 是本课的“节奏控制器”。这里它描述醉汉的动作出人意料，后面我们还会看到它修饰公牛的发现 (suddenly caught sight) 和人群的反应 (suddenly grew quiet)，反复强调了故事的突发性。\n\n3. 句型解析: 句子的主干是“a drunk wandered”(一个醉汉溜达了)，这是一个简单的主谓结构。其余部分都是在为这个画面添加细节：During a bullfight (时间)，suddenly (方式)，以及 into the middle of the ring (地点)，共同构成了一个完整的场景。"
    },
    {
        "english": "The crowd began to shout, but the drunk was unaware of the danger.",
        "chinese": "人们开始大叫起来，但醉汉却没有意识到危险。",
        "note": "1. 核心词汇: crowd (n.) 人群; began to shout 开始大叫; unaware of (adj.) 未察觉...的，不知道...的。\n\n2. 【关联点】注意区分两种“喊叫”：这里的 shout 是人群因恐惧发出的警告，而之前醉汉 shouting rude remarks 则是出于挑衅。同一个词根，表达了完全不同的情绪。\n\n3. 句型解析: 这是一个由 but 连接的并列句，展现了鲜明对比。前半句“人群开始大叫”(主谓宾)，描述外部的紧张气氛；后半句“醉汉没有意识到”(主谓表)，描述主角的无知状态。"
    },
    {
        "english": "The bull was busy with the matador at the time, but it suddenly caught sight of the drunk who was shouting rude remarks and waving a red cap.",
        "chinese": "当时那公牛正忙于对付斗牛士，但突然它看见了醉汉， 只见他正大声说着粗鲁的话，手里挥动着一顶红帽子。",
        "note": "1. 核心词汇: busy with 忙于；catch sight of 突然看见，瞥见；rude remarks 粗鲁的言语。这三个短语共同描绘了公牛注意力转移前的紧张对峙和转移时的瞬间。\n\n2. 【关联点】正如之前所说，副词 suddenly 再次推动情节，强调了公牛发现醉汉这一关键转折的突发性。这和醉汉 suddenly wandered 进场形成了呼应。\n\n3. 【关联点】注意区分两种“喊叫”：之前人群的 shout 是恐惧的警告，而醉汉这里的 shouting rude remarks 则是主动的挑衅，正是这个行为吸引了公牛的注意。\n\n4. 句型解析: who 引导的从句是点睛之笔。它像一个特写镜头，补充说明醉汉正在做什么(大声喊叫和挥舞帽子)，生动解释了他为何会成为公牛的新目标。"
    },
    {
        "english": "Apparently sensitive to criticism, the bull forgot all about the matador and charged at the drunk.",
        "chinese": "对挑衅显然非常敏感的公牛完全撇开斗牛士，直奔醉汉而来。",
        "note": "1. 核心词汇: sensitive to criticism 对挑衅敏感，这里的 criticism 巧妙呼应了醉汉之前的 rude remarks；charge at 猛冲向。这两个短语生动展现了公牛被激怒后的连锁反应。\n\n2. 【关联点】这和我们之前遇到的 “the drunk was unaware of the danger” (醉汉未察觉危险) 形成了鲜明对比。同样是“形容词+介词”结构，unaware of 描述了醉汉的无知，而 sensitive to 则刻画了公牛的易怒。\n\n3. 句型解析: 句首的 “Apparently sensitive to criticism” 是一个形容词短语，用来解释主语“the bull”为什么会做出后面的动作。这种“原因前置”的写法，先交代状态再描述行为，让叙事逻辑更清晰。"
    },
    {
        "english": "The crowd suddenly grew quiet.",
        "chinese": "观众突然静了下来，",
        "note": "1. 核心用法: grow + 形容词。动词 grew (grow的过去式) 在此不作“生长”，而是“变得”的意思，用来描述主语状态的变化，如 The sky grew dark (天色变暗了)。\n\n2. 【关联点】副词 suddenly 第三次出现，串联起所有关键瞬间：醉汉的突然闯入 (wandered)，公牛的突然发现 (caught sight of)，以及此刻人群的突然安静 (grew quiet)。\n\n3. 【关联点】注意动词 grew 的用法。它和 get, become, seem 一样，都可作系动词，后接形容词表示状态变化，这和之前的 the bull got close (变得靠近) 用法一致。"
    },
    {
        "english": "The drunk, however, seemed quite sure of himself.",
        "chinese": "可 这醉汉像是很有把握似的。",
        "note": "1. 核心用法: seem + 形容词/短语，表示“看起来...”。短语 sure of himself 意为“对自己很有把握”。转折词 however 凸显了醉汉与众不同的状态。\n\n2. 【关联点】动词 seem 在此表示“看起来”。这和我们最后会遇到的 Even the bull seemed to feel sorry... (甚至公牛似乎都...) 用法完全相同，都用来描述主观的推测。\n\n3. 【关联点】注意 however 带来的反差。前一句他 clumsily stepped aside (笨拙躲开)，这一句却 seemed sure of himself (显得自信)，行为与神态的矛盾正是故事的趣味所在。"
    },
    {
        "english": "When the bull got close to him, he clumsily stepped aside to let it pass.",
        "chinese": "当公牛逼近他时，他踉跄地住旁边一闪，牛扑空了。",
        "note": "1. 核心词汇: clumsily (adv.) 笨拙地；step aside 闪到一边；let it pass 让它通过。这三个词串联起一个连贯的躲闪动作：笨拙地、闪开、放行。\n\n2. 【关联点】动词 get 的用法。这里的 got close (变得靠近) 和我们之前遇到的 The crowd grew quiet (变得安静) 用法完全一致，都是“系动词+形容词”结构，表示状态的变化。\n\n3. 【关联点】注意人物行为的矛盾。他此刻 clumsily stepped aside (笨拙地躲开)，但紧接着却 seemed sure of himself (显得自信)。这种反差是故事的趣味所在。\n\n4. 句型解析: to let it pass 是目的状语，解释了“为何”要闪到一边。这和之前用句首的形容词短语 (Apparently sensitive to criticism) 来解释公牛“为何”冲锋，是两种表达原因的常用方式。"
    },
    {
        "english": "The crowd broke into cheers and the drunk bowed.",
        "chinese": "观众欢呼起来，醉汉向人们鞠躬致谢。",
        "note": "1. 核心用法: broke into cheers 意为“突然爆发出欢呼声”，生动地描绘了现场气氛的瞬间转变。动词 bow 意为“鞠躬”。\n\n2. 【关联点】注意人群情绪的变化：从最初的 began to shout (惊叫)，到中途的 grew quiet (安静)，再到现在的 broke into cheers (欢呼)。这三个短语串起了故事的氛围转变。\n\n3. 【关联点】注意 drunk 一词。在本课中它一直作名词(醉汉)，但它也可以是形容词，如 He is drunk (他喝醉了)。这和我们初次见到 a drunk (一个醉汉)时的用法一致。\n\n4. 句型解析: 这是一个由 and 连接的并列句，清晰地展示了两个紧密相连的动作：先是观众的反应，然后是醉汉的回应。"
    },
    {
        "english": "By this time, however, three men had come into the ring and they quickly dragged the drunk to safety.",
        "chinese": "然而，此时已有3个人进入斗牛场，迅速把醉汉拉到安全的地方。",
        "note": "1. 核心词汇: drag 意为“拖拽”，强调费力地拉；to safety 是一个固定搭配，表示动作的目的或结果是“到达安全地带”。转折词 however 则引出了与前文危险局面相反的救援场面。\n\n2. 语法解析: 注意时态 had come (过去完成时)。它表示“进入斗牛场”这个动作，发生在“拖拽”(dragged, 过去时)之前，清晰地交代了两个动作的先后顺序。\n\n3. 【关联点】这个句子由 and 连接两个动作，描述了救援的连续过程。这和我们之前遇到的 The crowd broke into cheers and the drunk bowed (人群欢呼，醉汉鞠躬) 结构完全相同，都是用 and 连接两个紧接着发生的事件。\n\n4. 【关联点】注意区分转折词。这里的 however 和之前的 but (The crowd began to shout, but the drunk...) 作用类似。但 however 语气更正式，用法更灵活，可以像这样插入句中。"
    },
    {
        "english": "Even the bull seemed to feel sorry for him, for it looked on sympathetically until the drunk was out of the way before once more turning its attention to the matador.",
        "chinese": "好像连牛也在为他感到遗憾，因为它一直同情地看着醉汉，直到他的背影消逝，才重新将注意力转向斗牛士。",
        "note": "1. 核心用法: feel sorry for 意为“为...感到遗憾/同情”。副词 sympathetically (同情地) 进一步赋予公牛人性化的情感。短语 turn one's attention to 意为“将注意力转向...”。\n\n2. 【关联点】动词 seem 在此表示“似乎”。这和我们之前遇到的 The drunk... seemed quite sure of himself (醉汉似乎很自信) 用法完全相同，都用来描述一种主观的推测或感觉。\n\n3. 【关联点】注意区分两种“看”。之前公牛是 suddenly caught sight of the drunk (突然瞥见)，是被动的发现。而这里是 turning its attention to the matador (将注意力转向)，是主动地转移焦点。\n\n4. 句型解析: 句中的 for 相当于“因为”，用来解释前一分句的原因。整个后半句通过 until... before... 的结构，清晰地展示了“看着-直到-才转向”这一连串动作的时间顺序。"
    }
]