[
    {
        "english": "One of the most famous monuments in the world, the Statue of Liberty, was presented to the United States of America in the nineteenth century by the people of France.",
        "chinese": "世界上最著名的纪念碑之一的自由女神雕像是在19世纪时由法国人民赠送给美国的。",
        "note": "1. monument 纪念碑。【关联点】这个词在课文结尾还会出现：the great monument has been a symbol of liberty...，指代同一座雕像，首尾呼应。\n\n2. was presented by... 由...赠送。【关联点】这是被动语态，强调“被赠送”。本课大量使用此结构，如was designed by, was constructed by等。注意，结尾处Bartholdi也officially presented了雕像。\n\n3. 句型：One of the..., the Statue of Liberty... 这是一个典型的同位语结构。前面的长短语是“自由女神像”的补充说明或“头衔”，两者指代同一事物，共同作主语，让信息更丰富。"
    },
    {
        "english": "The great statue, which was designed by the sculptor Auguste Bartholdi, took ten years to complete.",
        "chinese": "这座由雕像家奥古斯特.巴索尔地设计的巨大雕像是用10年时间雕像刻成的。",
        "note": "1. 句型 `take + 时间 + to do sth.` 意为“花费时间做某事”，是表达耗时的核心句式。本句主干即 The statue took ten years to complete.\n\n2. 结构：\", which was designed by...\" 是非限制性定语从句，如同一个插入的“括号”，补充说明雕像的来源，移除后主句依然完整。\n\n3. 【关联点】这和我们遇到的 `was presented by...` 及 `...constructed by Eiffel` 结构完全相同，都是“be动词+过去分词+by”，强调“被谁所做”。这是贯穿全文的核心句式。"
    },
    {
        "english": "The actual figure was made of copper supported by a metal framework which had been especially constructed by Eiffel.",
        "chinese": "这座雕像的主体是用铜制成的，由艾菲尔特制的金属框架支撑着。",
        "note": "1. 核心词汇：figure 在此指“雕像”，区别于它常见的“数字”或“人物”之意。framework 指“框架，构架”，如同建筑的骨架。\n\n2. 结构：supported by... 是过去分词作后置定语，修饰figure。which had been... 是定语从句，修饰framework。过去完成时had been constructed强调框架的建造先于雕像的支撑动作。\n\n3. 【关联点】...constructed by Eiffel 延续了全文的核心句式“be + 过去分词 + by”，与我们之前遇到的 was presented by 和 was designed by 结构完全一致，都用于强调动作的执行者。"
    },
    {
        "english": "Before it could be transported to the United States, a site had to be found for it and a pedestal had to be built.",
        "chinese": "在雕像被运往美国之前，必须为它选好一块场地，同时必须建造一个基座。",
        "note": "1. 核心句型 `had to be + 过去分词` (如 found, built) 表达了“过去必须被做”的被动含义，强调了事件的必要性。\n\n2. 【关联点】这和我们遇到的 `was presented`, `was designed` 等被动语态类似，但加入了 `had to` 来强调“必须”，是对全文核心句式的扩展。\n\n3. 核心词汇：site (n.) 场地。【关联点】注意，紧接着的下一句 `The site chosen...` 就具体说明了这个场地在哪里，形成了上下文的紧密衔接。"
    },
    {
        "english": "The site chosen was an island at the entrance of New York Harbour.",
        "chinese": "场地选在了纽约港入口处的一个鸟上。",
        "note": "1. 结构：The site chosen 意为“被选中的场地”。chosen 是过去分词作后置定语，修饰 site，相当于 The site which was chosen。\n\n2. 【关联点】The site 直接回应了上一句的 a site had to be found。用 The 特指“那个被找到的场地”，体现了上下文的连贯。\n\n3. 【关联点】这种“名词+过去分词”的用法，和我们遇到的 supported by a metal framework 中的 supported 类似，都是表示被动。"
    },
    {
        "english": "By 1884, a statue which was 151 feet tall had been erected in Paris.",
        "chinese": "到1884年，一座高度达151英尺的雕像在巴黎竖立起来了。",
        "note": "1. 时态：By 1884... had been erected 是过去完成时被动语态。它强调“到1884年为止”，竖立雕像的动作已经完成。【关联点】这和我们遇到的 ...framework which had been especially constructed... 用法一致，都表示在过去某个时间点前已完成的被动动作。\n\n2. 结构：which was 151 feet tall 是定语从句，修饰名词 a statue。【关联点】这和我们遇到的 which was designed by... 作用相同，都是用一个从句来补充说明前面的名词，使信息更完整。\n\n3. 词汇：erect (v.) 竖立，建立。常用于高大的建筑或纪念碑。【关联点】注意区分：erect 强调“立起来”的动作，而我们之前遇到的 construct 和 built 更侧重于“建造”的过程。"
    },
    {
        "english": "The following year, it was taken to pieces and sent to America.",
        "chinese": "第二年，它被拆成若干小块，运到美国。",
        "note": "1. 核心短语：take to pieces 意为“拆开”。【关联点】这个动作与后文的 put together again (重新组装) 形成鲜明对比，生动地描述了雕像从拆解到重建的过程。\n\n2. 结构：was taken... and (was) sent... 是两个并列的被动动作，省略了第二个was，使句子更紧凑。主语it承受了“被拆开”和“被运走”两个连续的动作。\n\n3. 【关联点】本句的被动语态延续了全文的叙事风格 (如 was presented, was designed)，始终将焦点保持在雕像本身，而非动作的执行者。"
    },
    {
        "english": "By the end of October 1886, the statue had been put together again and it was officially presented to the American people by Bartholdi.",
        "chinese": "到1886年10月底，这座雕像被重新组装起来，由巴索尔地正式赠送给美国人民。",
        "note": "1. 核心短语：put together again 意为“重新组装”。【关联点】这与我们之前遇到的 take to pieces (拆开) 形成了一组完美的对应动作，清晰地勾勒出雕像“拆解运输-异地重建”的完整过程。\n\n2. 时态对比：had been put together (过去完成时) 强调“组装”在“赠送”之前就已完成。was officially presented (一般过去时) 描述随后的赠送仪式。【关联点】这两种被动语态贯穿全文，如 had been constructed 和 was designed，共同将叙事焦点锁定在雕像本身。\n\n3. 【关联点】注意区分：开篇提到雕像 was presented... by the people of France (由法国人民赠送)，是一个宏大的概念。此处是 was officially presented by Bartholdi (由巴索尔地正式赠送)，聚焦于具体的、官方的交接仪式，使故事更具体。"
    },
    {
        "english": "Ever since then, the great monument has been a symbol of liberty for the millions of people who have passed through New York Harbour to make their homes in America.",
        "chinese": "从那时起，这座伟大的纪念碑对通过纽约港进入美国定居的千百万人来说就一直是自由的象征。",
        "note": "1. 时态：Ever since then... has been... 使用现在完成时，标志着叙事从过去的历史事件，转变为雕像延续至今的永恒意义。\n\n2. 结构：who have passed through... 是定语从句，修饰people。【关联点】这和我们之前遇到的 which was designed by... 作用相同，都是补充说明。注意此处用who指代人。\n\n3. 【关联点】the great monument 回应了开篇的monument，首尾呼应。to make their homes (为了安家) 的用法，与 The statue took ten years to complete 中的 to complete 类似，都表示目的。"
    }
]