[
    {
        "english": "The Olympic Games will be held in our country in four years' time.",
        "chinese": "4年以后，奥林匹克运动会将在我们国家举行。",
        "note": "1. 核心结构是将来时被动语态“will be held”（将被举行）。主语“奥运会”是动作的承受者，它不能“举行”自己，只能“被举行”。时间短语 in four years' time 意为“四年以后”，注意所有格 's 的用法。\n2. 【关联点】这和我们最后遇到的“they have never been held before”类似，都是用被动语态谈论“举办”这件事，只是时态不同。同时注意区分本句的“将来会发生”，和后面“will be building”（将来持续做）及“will have completed”（将来已完成）的区别。"
    },
    {
        "english": "As a great many people will be visiting the country, the government will be building new hotels, an immense stadium, and a new Olympic-standard swimming pool.",
        "chinese": "由于将有大批的人到我们国家来，所以政府准备建造一些新的饭店、一个大型体育场和一个新的奥运会标准游泳池。",
        "note": "1. 核心结构为 As... (由于)，引出原因。主句 will be building (将来进行时) 表示政府的建造是一项持续性的计划。\n2. 【关联点】将来进行时态和 They will also be building... 及 Everybody will be watching... 用法一致，都表示将来持续进行的动作。\n3. 【关联点】注意区分本课三种将来时：will be held (将来发生), will be building (将来持续做), will have completed (将来已完成)。\n4. 【关联点】immense (巨大的) 与 The fantastic modern buildings 中的 fantastic 意思相近。注意区分本句中表原因的 as 和后面表时间的 as。"
    },
    {
        "english": "They will also be building new roads and a special railway line.",
        "chinese": "他们还将修筑一些新的道路和一条铁路专线。",
        "note": "1. 核心结构是将来进行时 will be building，强调“建造”是一个有计划、持续进行的未来动作。also (也) 表明这是对之前建造计划的补充。\n2. 【关联点】这和我们之前遇到的 will be visiting 用法一致。注意与后面 Workers will have completed the new roads 形成对比：一个是“将要持续建”，一个是“到时会建完”，描述了计划的不同阶段。"
    },
    {
        "english": "The Games will be held just outside the capital and the whole area will be called 'Olympic City'.",
        "chinese": "奥运会就在首都市郊举办，整个地区将被称作“奥林匹克城”。",
        "note": "1. 这是一个由 and 连接的并列句，两个分句都使用了将来时被动语态：will be held (将被举办) 和 will be called (将被称作)。\n2. 【关联点】will be held 与第一句用法完全相同，再次强调“被举办”。同时，这里的将来时被动语态 (will be + 过去分词) 和后面遇到的现在完成时被动语态 (have been designed) 形成对比，都是强调“被”怎么样。"
    },
    {
        "english": "Workers will have completed the new roads by the end of this year.",
        "chinese": "工人们将在今年年底前把新路铺好；",
        "note": "1. 核心是将来完成时 will have completed，与标志性短语 by the end of... 连用，强调在将来某个时间点前，动作已经完成并产生结果。\n2. 【关联点】这和我们之前遇到的 They will also be building new roads 形成鲜明对比。一个是“将要持续建”，一个是“到时会建完”，描述了计划的不同阶段。\n3. 【关联点】注意区分本课三种将来时：will be held (将来发生)，will be building (将来持续做)，和本句的 will have completed (将来已完成)。\n4. 【关联点】本句用法与 By the end of next year, they will have finished... 完全一致，动词 complete 与 finish 意思也相近，可对比学习。"
    },
    {
        "english": "By the end of next year, they will have finished work on the new stadium.",
        "chinese": "到明年年底，他们将把新体育场建成。",
        "note": "1. 核心是将来完成时 will have finished，与标志性短语 by the end of... 连用，强调在将来某个时间点前，动作已经完成。work on a project 意为“从事某个项目”。\n2. 【关联点】本句用法与 Workers will have completed... 完全一致，都用将来完成时描述“到时会建完”的状态。动词 finish 与 complete 意思也相近，可对比学习。\n3. 【关联点】这与我们之前遇到的 will be building (将要持续建) 形成对比，后者强调过程，本句强调“到时已完成”的结果，描述了计划的最终阶段。\n4. 【关联点】词汇 stadium (体育场) 在 As a great many people... an immense stadium 中也出现过，可以一起记忆。"
    },
    {
        "english": "The fantastic modern buildings have been designed by Kurt Gunter.",
        "chinese": "这些巨大的现代化建筑是由库尔特.冈特设计的。",
        "note": "1. 核心是现在完成时被动语态 have been designed (已经被设计)，强调动作已完成且结果可见。by 引出动作的执行者。\n2. 【关联点】这和我们之前遇到的 will be held (将来时被动) 类似，都强调主语“被”怎么样，只是时态不同。一个是将来被做，一个是现在已经做完。\n3. 【关联点】这里的 fantastic 意为“巨大的”，和之前遇到的 immense stadium 中的 immense 意思相近，都用来形容建筑物的宏伟。"
    },
    {
        "english": "Everybody will be watching anxiously as the new buildings go up.",
        "chinese": "大家都将急切地注视着新建筑的建成。",
        "note": "1. 核心结构是将来进行时 will be watching，表示将来持续进行的动作。as 在此引导时间状语从句，意为“当……时候”，连接两个同时发生的动作。注意从句用一般现在时 go up 表示将来。\n2. 【关联点】将来进行时与我们之前遇到的 will be visiting 和 will be building 用法完全一致，都用来描述未来有计划、持续进行的活动。\n3. 【关联点】注意区分本句中 as 的用法。这里 as 意为“当……时候”，而在 As a great many people... 句中，as 意为“由于”，用来解释原因。\n4. 【关联点】动词短语 go up (建成) 呼应了本课“建造”的主题，与 build, complete, finish 等词在意义上相关联。"
    },
    {
        "english": "We are all very excited and are looking forward to the Olympic Games because they have never been held before in this country.",
        "chinese": "我们都非常激动，盼望着奥运会的到来，因为在这个国家里还从未举办过奥运会。",
        "note": "1. 核心是现在时态 (are excited, are looking forward to) 描述当前感受，并由 because 引出原因。短语 look forward to (期待) 的 to 是介词，后接名词或动词-ing形式。\n2. 原因从句使用了现在完成时被动语态 have never been held (从未被举办过)，强调“从过去到现在”的事实，解释了现在激动的原因。\n3. 【关联点】这和我们之前遇到的 The Olympic Games will be held... 形成鲜明对比。一个是“将来要被举办”，一个是“过去从未被举办”，都是被动语态，但时态不同，共同构成了事件的完整背景。\n4. 【关联点】这里的 because 和 As a great many people... 句中的 As 作用类似，都用于引出原因。"
    }
]