[
    {
        "english": "Haroun Tazieff, the Polish scientist, has spent his lifetime studying active volcanoes and deep caves in all parts of the world.",
        "chinese": "波兰科学家哈罗恩.塔捷耶夫花了毕生的精力来研究世界各地的活火山和探洞。",
        "note": "1. 核心用法是 spend one's lifetime doing something，意为“花费一生做某事”。这里的 studying 是动名词，具体说明“花费一生”的内容。\n\n2. 句中的 a Polish scientist 是主语 Haroun Tazieff 的同位语，相当于一个补充说明的标签。现在完成时 has spent 强调了这项事业贯穿他一生，并对其人生构成了深远影响。\n\n3.【关联点】本句总述了他一生的事业 (studying active volcanoes)，后续句子会具体展开他如何研究，例如 to observe a new volcano (观察)、take photographs (拍照) 和 measure temperatures (测量温度)。\n\n4.【关联点】这里的 active volcanoes (活火山) 是贯穿全文的核心词，在结尾句 He has been able to tell us more about active volcanoes... 中会再次出现，形成呼应。\n\n5.【关联点】注意 lifetime (一生) 和后面将遇到的 life (生命) 的区别。前者强调时间的跨度，而后者在 risk his life (冒生命危险) 中则指具体的生命本身。"
    },
    {
        "english": "In 1948, he went to Lake Kivu in the Congo to observe a new volcano which he later named Kituro.",
        "chinese": "1948年他去了刚果的基伍湖，对一座后来被他命名为基图罗的新火山进行观察。",
        "note": "1. 句中不定式 to observe a new volcano 表明目的，意为“为了观察”。【关联点】这和我们后面遇到的 so that he could take photographs... 作用类似，都是用来解释做某事的目的。\n\n2. which he later named Kituro 是一个定语从句，修饰 volcano。其核心句型是 name + 宾语 + 宾补，即“把...命名为...”。\n\n3.【关联点】这里的 observe (观察) 是对首句 studying active volcanoes 的具体化。它和后面的 take photographs (拍照)、measure temperatures (测量温度) 一样，都是他研究火山的具体方式。"
    },
    {
        "english": "Tazieff was able to set up his camp very close to the volcano while it was erupting violently.",
        "chinese": "当火山正在猛烈地喷发时，塔捷耶夫有办法把帐篷搭在离它非常近的地方。",
        "note": "1. 句子的核心结构是用 while 连接的两个同时发生的动作。主句 Tazieff was able to set up... 描述了主要行为，而从句 it was erupting violently 则描绘了这一行为发生的惊险背景。\n\n2.【关联点】was able to 强调“有能力并成功做到了”。这和我们后面遇到的 he was able to return... 用法一致。注意与 he could not stay... 形成对比，一个表示成功做到，一个表示无法做到。\n\n3.【关联点】过去进行时 was erupting 描述了当时持续发生的背景。这和我们后面遇到的 a river of liquid rock was coming towards him. 的用法完全相同，都用来营造紧张的、正在进行中的危险氛围。\n\n4. 核心短语 set up 意为“搭建”，而副词 violently (猛烈地) 则生动地修饰了喷发 (erupting) 的强度，增强了画面的危险感。"
    },
    {
        "english": "Though he managed to take a number of brilliant photographs, he could not stay near the volcano for very long.",
        "chinese": "尽管他设法拍了一些十分精彩的照片，但他却不能在火山附近停留太长的时间。",
        "note": "1. 句子的核心是由 Though 引导的让步状语从句，表达“尽管...但...”的转折关系，连接了一个积极成果（拍到照片）和一个客观限制（不能久留）。\n\n2. 核心短语 manage to do sth. 意为“设法成功做某事”，强调克服困难。【关联点】这和我们遇到的 managed to escape (设法逃离) 和 managed to climb (设法爬进) 用法完全一致，都凸显了主人公的能力与毅力。\n\n3. take photographs (拍照) 是他研究火山的具体方式之一。【关联点】这和我们之前遇到的 observe (观察) 和 measure temperatures (测量温度) 类似，都是对首句 studying (研究) 的具体化。\n\n4. could not stay (不能停留) 表达了能力的局限。【关联点】注意这与前文的 was able to set up (能够搭建) 和后文的 was able to return (能够返回) 形成鲜明对比，一个表示无法做到，一个表示成功做到。"
    },
    {
        "english": "He noticed that a river of liquid rock was coming towards him. It threatened to surround him completely, but Tazieff managed to escape just in time.",
        "chinese": "他发现有一股岩浆正向他流过来，眼看就要将他团团围住，但塔捷耶夫还是设法及时逃离了。",
        "note": "1. 句子由 but 连接，展现了“发现危险 (noticed) -> 危险升级 (threatened) -> 成功脱险 (managed to escape)”的完整叙事链条，节奏紧张。\n\n2. 核心短语：liquid rock (岩浆)；threaten to surround him (威胁要包围他) 描绘了危险；just in time (及时) 则凸显了逃脱的惊险。\n\n3.【关联点】managed to escape (设法逃离) 意为“成功做到”。这和我们遇到的 managed to take (设法拍到) 和 managed to climb (设法爬进) 用法完全一致，都强调主人公在困境中最终成功。\n\n4.【关联点】过去进行时 was coming... 生动描绘了岩浆逼近的动态画面。这和我们之前遇到的 it was erupting violently 用法完全相同，都是为了营造一种正在发生的、紧张危险的氛围。"
    },
    {
        "english": "He waited until the volcano became quiet and he was able to return two days later.",
        "chinese": "他等到火山平静下来，两天以后又返回去。",
        "note": "1. 句子的核心是由 and 连接的两个先后发生的动作：waited (等待) 与 was able to return (能够返回)。其中，until 从句明确了“等待”这一动作的结束条件。\n\n2.【关联点】was able to return 意为“成功返回”。这和我们之前遇到的 was able to set up (能够搭建) 用法一致，都强调有能力并成功做到某事，与 could not stay (不能停留) 形成鲜明对比。\n\n3.【关联点】注意区分 until 和 while。until 表示主句动作在从句动作发生时“结束”；而之前遇到的 while (it was erupting) 则表示主句和从句的动作“同时发生”。\n\n4. 核心短语 become quiet (变得平静) 描述了火山状态的转变，与前文 erupting violently (猛烈喷发) 的危险情景形成对照。"
    },
    {
        "english": "This time, he managed to climb into the mouth of Kituro so that he could take photographs and measure temperatures.",
        "chinese": "这次他设法爬进了基图罗火山口，以便能拍摄照片和测试温度。",
        "note": "1. 核心短语 manage to climb 意为“设法成功爬进”，强调克服困难。【关联点】这和我们之前遇到的 managed to take (设法拍到) 和 managed to escape (设法逃离) 用法完全一致，都凸显了主人公在逆境中的能力与毅力。\n\n2. so that 引导目的状语从句，解释主句动作的目的。【关联点】这和我们之前遇到的 to observe a new volcano (为了观察) 作用类似，都是用来回答“为什么做某事”。注意 so that 后面跟的是一个完整的句子。\n\n3. take photographs (拍照) 和 measure temperatures (测量温度) 是并列的两个动作。【关联点】它们和之前的 observe (观察) 一样，都是对首句 studying active volcanoes (研究活火山) 这一宏大主题的具体化，让我们看到他研究工作的细节。"
    },
    {
        "english": "Tazieff has often risked his life in this way.",
        "chinese": "塔捷耶夫经常冒这样的生命危险。",
        "note": "1. 核心短语 risk one's life 意为“冒生命危险”。in this way (以这种方式) 是一个总结性短语，指代了前文描述的各种危险研究方法，如在火山喷发时靠近观察、拍照等。\n\n2. 现在完成时 has risked 强调这种冒险是其科考事业中的常态。【关联点】这和开篇的 has spent (已花费一生) 及结尾的 has been able to (一直能够) 遥相呼应，共同勾勒出他一生的事业、风险与成就。\n\n3.【关联点】注意这里的 life (生命) 指具体的生命本身，与首句中强调时间跨度的 lifetime (一生) 形成对比，深化了对他为事业奉献的理解。"
    },
    {
        "english": "He has been able to tell us more about active volcanoes than any man alive.",
        "chinese": "他能告诉我们的有关活火山的情况比任何在世的人都要多。",
        "note": "1. 核心句型是 more...than any...，用于表达最高级含义，即“比任何人都...”，相当于“最...”。短语 any man alive 意为“任何在世的人”，是强调范围的常用表达。\n\n2.【关联点】has been able to 是 be able to 的现在完成时。这和我们之前遇到的 was able to set up (能够搭建) 和 was able to return (能够返回) 类似，但时态不同。过去时表示单次成功，而现在完成时则总结了他一生积累至今的能力。\n\n3.【关联点】现在完成时 has been able to 与开篇的 has spent (已花费一生) 和中段的 has risked (冒过险) 遥相呼应。这三个时态共同总结了主人公一生的事业、付出的代价以及最终取得的卓越成就。\n\n4.【关联点】本句是全文的点睛之笔。句中的 active volcanoes (活火山) 与首句的 studying active volcanoes 形成呼应，清晰地展示了他一生研究的成果，使文章结构完整。"
    }
]