[
    {
        "english": "Dan Robinson has been worried all week.",
        "chinese": "丹.鲁宾逊焦虑了整整一个星期。",
        "note": "1. 核心句型：has been worried (一直很焦虑)。这是现在完成时，用于描述一个从过去开始，并一直持续到现在的“状态”。时间短语 all week (整整一周) 恰好强调了这种持续性。\n\n2. 【关联点】这和我们后面遇到的 now he is not worried anymore (他现在不再担心了) 形成鲜明对比。前者描述持续到现在的状态，后者则点明了现在的状态已经改变，这是理解故事情绪变化的关键。\n\n3. 【关联点】注意 be + 形容词 这个描述状态的核心模式。本句的 has been worried 和后面的 was surprised (感到惊讶) 结构一致，都是用 be 动词的不同时态来描述人物感受。"
    },
    {
        "english": "Last Tuesday he received a letter from the local police. In the letter he was asked to call at the station.",
        "chinese": "上星期二他收到当地警察局的一封信，要他到警察局去一趟。",
        "note": "1. 核心短语：call at (拜访某地)，指短暂的停留。station 在此特指 the police station (警察局)。\n\n2. 核心句型：he was asked to... (他被要求去做...)，这是一个被动语态，强调“他”是动作的接受者，而不是发出者。\n\n3. 【关联点】注意被动语态的连续使用。本句的 was asked (被要求) 和我们后面遇到的 was wanted (被寻找), was told (被告知), was found (被找到) 结构完全相同。这节课大量使用被动语态来叙事。"
    },
    {
        "english": "Dan wondered why he was wanted by the police, but he went to the station yesterday and now he is not worried anymore.",
        "chinese": "丹奇怪警察为什么找他，但昨天还是去了，结果他不再担心了。",
        "note": "1. 核心结构：这是一个由but和and连接的完整故事链：wondered why (感到疑惑) -> went to the station (采取行动) -> not worried anymore (结果释然)。这个结构清晰地展示了事件的转折和结果。\n\n2. 核心句型：wondered why... (想知道为什么...)。why引导的句子完整地充当了wondered的宾语，说明了他感到奇怪的具体内容。\n\n3. 【关联点】was wanted by the police (被警察寻找) 是被动语态。这和我们之前遇到的 was asked (被要求), was told (被告知), had been found (被找到) 是完全一样的结构，都是本课的核心句型。\n\n4. 【关联点】not worried anymore (不再担心了) 与开头的 has been worried all week (担心了一整周) 形成完美呼应。这两个短语是理解整个故事中丹情绪变化的关键，从持续的焦虑到最终的解脱。"
    },
    {
        "english": "At the station, he was told by a smiling policeman that his bicycle had been found.",
        "chinese": "在警察局里，一位面带笑容的警察告诉他，他的自行车找到了。",
        "note": "1. 核心句型：he was told that... (他被告知某事...)。这是一个被动语态的宾语从句结构，that引导的从句完整说明了“被告知”的内容。\n\n2. 时态逻辑：注意两个被动语态的时态差异。was told (被告知) 发生在过去，而 had been found (被找到) 发生在“被告知”之前，即“过去的过去”，表示动作的先后顺序。\n\n3. 【关联点】本句的 was told by... (被...告知) 与我们之前遇到的 was asked (被要求) 和 was wanted by... (被寻找) 结构完全一致，都是本课反复出现的被动语态核心用法。"
    },
    {
        "english": "Five days ago, the policeman told him, the bicycle was picked up in a small village four hundred miles away. It is now being sent to his home by train.",
        "chinese": "那位警察对他说，那辆自行车是5天前在400英里外的一个小村里发现的，现在正用火车给他运回家来。",
        "note": "1. 核心时态对比：was picked up (过去被动) 描述已完成的“找到”动作；is now being sent (现在进行时被动) 描述“正在运送”的当前状态。一句话交代了过去和现在。\n\n2. 【关联点】本句的 was picked up 和 is being sent 延续了本课被动语态的核心。这和我们遇到的 was asked, was wanted, was told, had been found 结构完全一致。\n\n3. 【关联点】注意 a policeman told him (警察告诉他) 是主动语态。这与我们之前遇到的 he was told (他被告知) 形成对比，从不同视角描述了“告知”这个动作。\n\n4. 核心短语：by train (乘火车)。这是表示交通方式的固定用法，类似的还有 by bus, by car, by plane。"
    },
    {
        "english": "Dan was most surprised when he heard the news. He was amused too, because he never expected the bicycle to be found.",
        "chinese": "丹听到这个消息后，惊奇万分，但又感到非常好笑，因为他从未指望那辆自行车还能找到。",
        "note": "1. 核心词汇：most 在此意为“非常”，加强语气。surprised (惊讶的) 和 amused (觉得好笑的) 都是描述人感受的-ed形容词。\n\n2. 【关联点】was surprised (感到惊讶) 的用法，和我们开篇遇到的 has been worried (一直担心) 结构一致，都是用 be 动词的不同形式来描述人物感受。\n\n3. 核心句型：expect sth. to be found (预料某物被找到)。这里的 to be found 是不定式的被动语态，强调自行车是“被找到”，而不是自己找到。\n\n4. 【关联点】注意区分 to be found (不定式被动) 和我们之前遇到的 was found, was picked up (谓语动词被动)。它们都表示“被动”，但前者跟在 expect 后面，形式不同。"
    },
    {
        "english": "It was stolen twenty years ago when Dan was a boy of fifteen!",
        "chinese": "这是20年前丹还是一个15岁的孩子时被人偷走的！",
        "note": "1. 核心句型：It was stolen (它被偷了)。这是一个过去时被动语态，强调“它”是动作的承受者，而不是发出者。\n\n2. 【关联点】这延续了本课被动语态的核心。这和我们遇到的 was asked (被要求), was wanted (被寻找), was told (被告知), was picked up (被捡到) 等结构完全一致。\n\n3. 结构解析：when引导的从句，是对主句时间状语 twenty years ago 的进一步解释，精确说明了“20年前”具体是哪个时间点。\n\n4. 核心短语：a boy of fifteen (一个15岁的男孩)。这是表达年龄的一种方式，与 a fifteen-year-old boy 意思相同。"
    }
]