[
    {
        "english": "I used to travel by air a great deal when I was a boy.",
        "chinese": "我在幼年的时候，曾多次乘飞机旅行。",
        "note": "1. used to do sth: 意为“过去常常做某事”，强调这个习惯现在已经没有了，形成今昔对比。\n2. a great deal: 固定搭配，意为“大量地，非常”，在这里用来强调过去乘飞机旅行的频率很高。\n3. 【关联点】注意区分！我们后面会学到 \"I am used to traveling by air\" (我习惯于乘飞机)，这里的 \"be used to doing\" 表示“习惯于”现在的状态，与本句的过去习惯完全不同。\n4. 【关联点】这和我们遇到的 \"A flight attendant would take charge of me\" 中的 \"would\" 类似，两者都可描述过去的习惯性动作，但 \"used to\" 更常用。\n5. 句型: \"I used to...\" 是主句，\"when I was a boy\" 是时间状语从句，用以限定这个过去习惯发生的时间段，结构清晰。"
    },
    {
        "english": "My parents used to live in South America and I used to fly there from Europe in the holidays.",
        "chinese": "我的父母曾经住在南美洲，所以假期里我常从欧洲乘飞机到他们那里。",
        "note": "1. used to do sth: 再次出现，表示“过去常常”的状态（live）或习惯性动作（fly），强调现在已不再如此。\n2. 【关联点】这和本课第一句 \"I used to travel by air...\" 结构几乎一样，都是用 used to 描述过去的习惯，是核心句型。\n3. 【关联点】再次提醒，这和我们之前遇到的 \"would\" (过去常常) 意思相近，但要与 \"be used to doing\" (习惯于现在) 严格区分。\n4. 句型: 这是一个由 and 连接的并列句，前后两部分结构对称，共同描述了“过去常常”发生的两件事，逻辑清晰。"
    },
    {
        "english": "A flight attendant would take charge of me and I never had an unpleasant experience.",
        "chinese": "我总是由一位空中乘务员照管，从未遇到过不愉快的经历。",
        "note": "1. would 在此不表示意愿，而是指过去的习惯性动作，意为“过去常常”。【关联点】这和我们之前遇到的 \"I used to travel...\" 中的 \"used to\" 作用非常类似，都用来描述过去的习惯。\n\n2. take charge of: 固定短语，意为“负责，照管”。\n\n3. unpleasant: 形容词，由 un- (不) + pleasant (愉快的) 构成。never had an unpleasant experience 意为“从未有过不愉快的经历”，用强烈的否定词强调了体验很好。\n\n4. 【关联点】flight attendant (空乘) 这个词在本课中反复出现，比如在 \"a flight attendant told us...\" 中，是核心场景词汇。"
    },
    {
        "english": "I am used to traveling by air and only on one occasion have I ever felt frightened.",
        "chinese": "我习惯了乘飞机旅行，只是有一次把我吓坏了。",
        "note": "1. be used to doing sth: 意为“习惯于做某事”，表示一种当前的状态或习惯。这里的 to 是介词，因此后面必须跟动名词(ing)或名词。\n\n2. 【关联点】注意区分！这和我们之前遇到的 \"I used to travel...\" (过去常常) 完全不同。前者描述现在的习惯，后者描述已不存在的过去习惯。\n\n3. only on one occasion: 意为“仅仅在一次”，是一个起强调作用的状语。当 “only” 修饰的状语放在句首时，主句需要部分倒装。\n\n4. 倒装结构: \"have I ever felt frightened\" 是倒装形式，助动词 have 被提到了主语 I 的前面。其正常语序是 \"I have ever felt frightened\"。\n\n5. 句型: 句子由 and 连接，前半句描述常态（习惯），后半句用倒装句强调唯一的例外（害怕），形成强烈对比，使表达更生动。"
    },
    {
        "english": "After taking off, we were flying low over the city and slowly gaining height, when the plane suddenly turned round and flew back to the airport.",
        "chinese": "起飞之后，我们在城市上空低低地飞行，然后慢慢爬高。这时飞机突然调转头来，飞回了机场。",
        "note": "1. 核心短语: take off (起飞)，gain height (爬高)，turn round (掉头)。这三个短语生动地描绘了飞机的连续动作。\n\n2. 句型: “...were flying...gaining..., when the plane turned...” 是一个经典叙事句型。用过去进行时描绘持续的背景，再用 when 引出一般过去时的突发动作，意为“正在做……，就在这时突然……”。\n\n3. 【关联点】take off 在本课结尾 “...able to take off again” 中再次出现，是核心动词。它与后面的 land (降落) 和 touch down (着陆) 形成一组航空主题词汇。\n\n4. 【关联点】这和我们遇到的 “While we were waiting to land...” 结构类似，都用进行时态来设置故事背景。注意这里的 when 意为“就在那时”，与 “when I was a boy” 中表示“当……的时候”的宽泛时间段不同。"
    },
    {
        "english": "While we were waiting to land, a flight attendant told us to keep calm and to get off the plane quietly as soon as it had touched down.",
        "chinese": "在我们等待降落时，一位空中乘务员告诉我们要保持镇静，待飞机一着陆，就马上不声不响地离开飞机。",
        "note": "1. 核心短语: keep calm (保持镇静)；touch down (着陆)。后者是 land 的生动表达，描绘飞机触地瞬间。\n\n2. 【关联点】这和我们之前遇到的 take off (起飞) 形成反义词组，共同构成本课的航空主题词汇。\n\n3. 句型: \"told us to keep calm and to get off...\" 是 \"tell sb to do sth\" (告诉某人做某事) 的经典用法，用于转述指令。\n\n4. 时态: \"While we were waiting...\" 用过去进行时描绘背景。【关联点】这和我们遇到的 \"...we were flying low...\" 结构类似，都是为后续的突发事件铺垫。\n\n5. 时态: \"as soon as it had touched down\" 用过去完成时，强调“着陆”发生在“离开飞机”之前。【关联点】本课多次使用过去完成时来厘清动作的先后顺序，比如在 \"...what had happened\" 和 \"...a bomb had been planted\" 中。"
    },
    {
        "english": "Everybody on board was worried and we were curious to find out what had happened.",
        "chinese": "飞机上的人都很着急，大家都急于想知道究竟出了什么事。",
        "note": "1. 核心短语: on board (在交通工具上)；be curious to do sth (急于想做某事)；find out (查明)。\n\n2. 时态: 句中用过去时 (was worried, were curious) 描述当时的情绪，用过去完成时 (had happened) 表示“出事”发生在“着急”之前，动作有先后。\n\n3. 【关联点】过去完成时是本课重点。这和我们遇到的 '...as soon as it had touched down' 和 '...a bomb had been planted' 类似，都用来清晰地表示一个动作发生在另一个过去动作之前。\n\n4. 【关联点】on board 这个短语在本课反复出现，比如在 '...a very important person on board' 中，是核心场景词汇。\n\n5. 句型: what had happened 是一个宾语从句，作 find out 的宾语，解释了“想知道”的具体内容。"
    },
    {
        "english": "Later we learnt that there was a very important person on board.",
        "chinese": "后来我们才得知，飞机上坐了一位非常重要的人物。",
        "note": "1. learnt that...: 意为“得知了某件事”，that引导的宾语从句解释了“得知”的具体内容。【关联点】这和我们后面遇到的 'The police had been told that...' 结构类似，都是用that从句来引出被告知或发现的信息。\n\n2. there was...: 经典的“there be”句型，表示“（过去）有...”，强调“存在”这一事实。这是英语中介绍新信息或人物的常用方式。\n\n3. on board: 固定短语，意为“在交通工具上”。【关联点】这和我们之前遇到的 'Everybody on board was worried' 中的用法完全相同，是本课的核心场景词汇。"
    },
    {
        "english": "The police had been told that a bomb had been planted on the plane.",
        "chinese": "有人报告警察，说飞机上安放了一枚炸弹。",
        "note": "1. 句型结构: \"had been told that...\" 结构，用that引导的宾语从句来解释“被告知”的具体内容。【关联点】这和我们之前遇到的 'we learnt that...' 结构类似，都是用that从句引出信息。\n\n2. 时态层次: 连用两个过去完成时被动语态 (had been told, had been planted)，清晰地展示了动作的先后顺序：炸弹“被安放”在先，警察“被告知”在后。\n\n3. 【关联点】过去完成时和被动语态是本课重点。这与 'what had happened' (时态) 和 'the plane was searched' (语态) 的用法一脉相承，需重点掌握。\n\n4. 核心词汇: plant 在此意为“安放”，而非我们熟知的“种植”，如 plant a bomb (安放炸弹)。"
    },
    {
        "english": "After we had landed, the plane was searched thoroughly.",
        "chinese": "我们降落之后，飞机被彻底搜查了一遍。",
        "note": "1. 时态层次: \"After we had landed\" 使用过去完成时，清晰地表明“降落”这个动作发生在主句“搜查”之前，强调了动作的先后顺序。\n\n2. 【关联点】这和我们遇到的 '...as soon as it had touched down' 和 '...a bomb had been planted' 类似，都是用过去完成时来厘清事件的先后，是本课重点。\n\n3. 语态: 主句 \"the plane was searched\" 使用被动语态，因为飞机是动作的承受者，它“被”搜查，而不是主动去搜查。\n\n4. 【关联点】被动语态是本课核心。这与 'a bomb had been planted' (炸弹被安放) 和 'nothing was found' (什么也没被找到) 的用法一脉相承。\n\n5. 核心词汇: land (降落)。【关联点】这与本课的 take off (起飞) 和 touch down (着陆) 构成一组核心航空词汇，需一并记忆。"
    },
    {
        "english": "Fortunately, nothing was found and five hours later we were able to take off again.",
        "chinese": "幸运的是，什么也没有找到。5个小时后，我们又起飞了。",
        "note": "1. 核心用法: nothing was found (什么也没被找到)。这里使用了被动语态，强调“被找到”这个动作的结果，而不在乎是谁在找。\n2. 【关联点】被动语态是本课核心。这和我们之前遇到的 'the plane was searched' (飞机被搜查) 以及 'a bomb had been planted' (炸弹被安放) 的用法一脉相承。\n3. 核心短语: take off (起飞)。【关联点】这和我们之前遇到的 'After taking off...' 中的用法相同，与 land (降落) 和 touch down (着陆) 共同构成了本课的航空主题词汇。\n4. 句型: 这是一个由 and 连接的并列句，描述了搜查后的两个结果。were able to 意为“能够”，在这里相当于 could，表示经过等待后，我们终于获得了起飞的能力。"
    }
]