[
    {
        "english": "When he had killed the guard, the prisoner of war quickly dragged him into the bushes.",
        "chinese": "那个战俘杀死卫兵以后，迅速地把尸体拖进了灌木丛。",
        "note": "1. 核心词汇: prisoner of war (战俘)，dragged (拖拽，动词drag的过去式)。这个故事的主角 prisoner (战俘) 将贯穿全文。\n\n2. 句型解析: 这是一个描述过去先后发生两个动作的经典句型。“When + 过去完成时 (had killed)” 表示先发生的动作，“主句用一般过去时 (dragged)” 表示后发生的动作。\n\n3. 【关联点】副词quickly (迅速地) 与之前遇到的rapidly意思相近。本句用过去完成时(had killed)表示更早的动作，这个关键用法会在“When they had gone...”和“...had escaped”中反复出现。"
    },
    {
        "english": "Working rapidly in the darkness, he soon changed into the dead man's clothes.",
        "chinese": "他在黑暗中忙活了一阵儿，很快就换上了死者的衣服。",
        "note": "1. 句型解析: 句首的 \"Working...\" 是现在分词短语，生动地描绘了主语 \"he\" 在主句动作发生时的伴随动作，让画面感更强。整个句子的核心是 \"he changed into...clothes\"。\n\n2. 核心词汇: rapidly (迅速地)，与之前遇到的 quickly 意思相近；change into (换上)，强调从一种状态变为另一种，这里指换衣服。\n\n3. 【关联点】这个 \"V-ing, 主句\" 的结构，和我们后面将遇到的 \"jumping into the car, he drove off\" 用法完全相同。同时，请注意区分本句的 \"Working...\" (现在分词，表主动) 与之前 \"dressed in a uniform...\" (过去分词，表被动状态) 的用法。"
    },
    {
        "english": "Now, dressed in a blue uniform and with a rifle over his shoulder, the prisoner marched boldly up and down in front of the camp.",
        "chinese": "现在他身穿蓝军装，肩扛步枪，在军营门前大胆地来回走看。",
        "note": "1. 核心词汇: dressed in (穿着)，过去分词表状态；march boldly (大胆行进)，动词与副词的生动搭配；up and down (来回地)。\n\n2. 句型解析: 核心主干是 \"the prisoner marched\"。句首的 \"dressed in...\" (过去分词短语) 和 \"with a rifle...\" (介词短语) 像两个特写镜头，生动描绘了主语的状态和装备，让画面感十足。\n\n3. 【关联点】注意区分本句的 \"dressed in...\" (过去分词，表被动状态) 和之前遇到的 \"Working rapidly...\" (现在分词，表主动动作)。同时，用 \"with...\" 结构来补充描述，这和我们后面将遇到的 \"a car with four officers\" 的用法完全相同。"
    },
    {
        "english": "He could hear shouting in the camp itself.",
        "chinese": "他听得军营里面的喧闹声。",
        "note": "1. 核心词汇: shouting (动词shout加-ing作名词，指“喊叫声”)；itself (反身代词，用于强调地点“就在营地内部，而非别处”)。\n\n2. 句型解析: 核心是“主语 + could hear + 宾语(shouting)”，表达过去有能力听见某种声音。情态动词 could 在此表示“能够”。\n\n3. 【关联点】情态动词 could 在本课多次出现。这和我们之后遇到的“nothing else he could do”及“as quickly as he could”中的用法一致。同时注意区分 shouting (作名词) 和之前 Working... (分词作状语) 的用法。"
    },
    {
        "english": "Lights were blazing and men were running here and there: they had just discovered that a prisoner had escaped.",
        "chinese": "那里灯米通明，人们在东奔西跑：他们刚刚发现有一个俘虏跑了。",
        "note": "1. 句型解析: 句子前半部分用过去进行时 (were blazing, were running) 描绘了一个动态的混乱场面，如同电影镜头。核心词汇: blaze (闪耀)，here and there (到处)。\n\n2. 时态逻辑: 后半句用冒号引出原因。注意时态的先后顺序：用过去完成时 (had escaped) 表示“逃跑”这个动作，发生在“发现”(discovered) 之前，是“过去的过去”。\n\n3. 【关联点】这里的过去完成时 (had escaped) 用法，和我们开篇遇到的 'When he had killed the guard' 以及后面将遇到的 'When they had gone' 完全一致，都表示发生在过去某个时间点之前的动作。"
    },
    {
        "english": "At that moment, a large black car with four officers inside it, stopped at the camp gates.",
        "chinese": "正在此时，一辆黑色大轿车在军营门口停了下来。里面坐了4个军官。",
        "note": "1. 句型解析: 核心主干是 \"a car stopped\"，一个简单的主谓结构。句子的其余部分都是修饰成分，如同给这个核心动作添加了时间、地点和细节的“插件”，让信息更丰富。\n\n2. 核心结构: \"a car with four officers inside it\" 是一个关键表达。用介词 \"with\" 引出短语来补充描述名词，是一种高效添加细节的方式，让描述更具体生动。\n\n3. 【关联点】这和我们之前遇到的 \"...with a rifle over his shoulder\" 用法完全相同。都是用 \"with + 名词短语\" 的结构，像贴标签一样，给核心名词补充生动的细节描述。"
    },
    {
        "english": "The officers got out and the prisoner stood to attention and saluted as they passed.",
        "chinese": "军官们下了车，战俘立正站好，并在他们从他面前经过时敬了礼。",
        "note": "1. 核心词汇: get out (下车), stand to attention (立正), salute (敬礼)。这三个动词短语生动地描绘了场景中的连续动作。got 和 stood 分别是 get 和 stand 的过去式。\n\n2. 句型解析: 句子由 and 连接了两个并列的事件：军官下车，以及战俘立正敬礼。句末的 \"as they passed\" 是一个时间状语从句，表示“当他们经过时”，精确地说明了敬礼发生的时刻。\n\n3. 【关联点】这里的 \"as\" (当...时) 与我们之后会遇到的 \"As the man came near\" 用法一致，都表示动作同时发生。注意它和之前 \"When he had killed...\" 的区别，\"when\" 更多指一个时间点或先后顺序，而 \"as\" 强调过程中的伴随。"
    },
    {
        "english": "When they had gone, the driver of the car came towards him. The man obviously wanted to talk.",
        "chinese": "他们走后，汽车司机向他走来，这人显然是想聊天。",
        "note": "1. 核心词汇: came towards (向...走来)，描述方向；obviously (显然地)，点明意图。第二句的 want to talk (想聊天) 是动词不定式作宾语的常见用法。\n\n2. 时态逻辑: 句首的 \"When they had gone\" 使用过去完成时，表示“他们离开”这个动作发生在主句动作 \"came\" (走来) 之前，清晰地交代了动作的先后顺序。\n\n3. 【关联点】\"When + 过去完成时\" 的用法，与开篇的 \"When he had killed...\" 和之前的 \"...had escaped\" 完全一致。这清晰地表示了动作的先后顺序，注意与之前 \"as they passed\" 中 as 强调伴随发生进行区分。"
    },
    {
        "english": "He was rather elderly with grey hair and clear blue eyes.",
        "chinese": "他上了年纪，有着灰白的头发和明亮的蓝眼睛。",
        "note": "1. 核心词汇: rather (相当地)，elderly (上了年纪的，比old更礼貌)。句子的主干是 “He was elderly”，后面用 “with...” 来补充外貌细节，如同给人物画像，让形象更丰满。\n\n2. 【关联点】用介词 with 补充描述，这和我们遇到的 “...with a rifle over his shoulder” 和 “a car with four officers” 用法完全相同，都是给核心名词添加生动细节的高效方式。"
    },
    {
        "english": "The prisoner felt sorry for him, but there was nothing else he could do.",
        "chinese": "战俘为他感到惋惜，但却没有别的选择。",
        "note": "1. 核心词汇: feel sorry for (为...感到惋惜)，表达同情。nothing else (没有别的了)，表示别无他法。\n\n2. 句型解析: 句子由 but 连接，表示转折。后半句 there was nothing else (that) he could do 是一个经典句型，(that) he could do 是一个省略了关系词的定语从句，用来修饰 nothing else。\n\n3. 【关联点】这里的 could do (能做) 与我们之前遇到的 could hear (能听见) 及之后将遇到的 as quickly as he could (尽可能快) 用法一致，都表示过去的能力或可能性。"
    },
    {
        "english": "As the man came near, the prisoner knocked him to the ground with a sharp blow. Then, jumping into the car, he drove off as quickly as he could.",
        "chinese": "当这个人走近时，战俘一拳把他打倒在地，然后跳进车里，以最快的速度把车开走了。",
        "note": "1. 核心词汇: knock someone to the ground (把某人打倒在地), drive off (开车离开)。句末的 as quickly as he could (尽可能快地) 是一个强调“尽最大努力”的黄金句型。\n\n2. 句型解析: 句子用 As... (当...时) 引入背景，再用现在分词短语 jumping into... 衔接了两个连贯的动作 (打倒 -> 跳进车 -> 开走)，节奏紧凑，画面感强。\n\n3. 【关联点】这里的 As (当...时) 与我们遇到的 'saluted as they passed' 用法一致。'jumping into...' 结构则与 'Working rapidly...' 完全相同。句末的 could 也与之前的 could hear 和 could do 一致。"
    }
]