[
    {
        "english": "Last Christmas, the circus owner, Jimmy Gates, decided to take some presents to a children's hospital.",
        "chinese": "去年圣诞节，马戏团老板吉米.盖茨决定送些礼物给儿童医院。",
        "note": "1. 核心句型: decide to do sth. (决定做某事)。这里的to do不定式是decided的宾语，说明“决定”的具体内容。\n【关联点】这和我们之后遇到的 agreed to go (同意去) 和 refused to move (拒绝移动) 属于同一类用法，都是“动词 + to do”结构，表示意愿或决定。\n\n2. owner (n.) 老板，物主。由动词 own (拥有) + er (表示“人”) 构成，指“拥有…的人”。\n\n3. Last Christmas: 去年圣诞节。这个时间状语为整个故事设定了背景。\n【关联点】注意，下一句中的 Father Christmas (圣诞老人) 就与此相关，交代了老板Jimmy的装扮。\n\n4. 结构亮点: the circus owner, Jimmy Gates... 这里的 Jimmy Gates 是 the circus owner 的同位语，即补充说明这个老板的名字是谁，让人物更具体。"
    },
    {
        "english": "Dressed up as Father Christmas and accompanied by a 'guard of honour' of six pretty girls, he set off down the main street of the city riding a baby elephant called Jumbo.",
        "chinese": "他打扮成圣诞老人，在由6个漂亮姑娘组成的“仪仗队”的陪同下，骑上一头名叫江伯的小象，沿着城里的主要街道出发了。",
        "note": "1. 句子的主干是 he set off (他出发了)。其他部分都是修饰成分，用来描绘主角出发时的状态和方式，让画面感十足。\n\n2. Dressed up as... (被打扮成) 和 accompanied by... (被...陪同) 均为过去分词短语，修饰主语 he，说明他出发时的状态。\n【关联点】Father Christmas (圣诞老人) 呼应了故事开头的 Last Christmas。\n\n3. riding a baby elephant... (骑着一头小象) 是现在分词短语，表示主语 he 在 set off 时伴随的动作。\n【关联点】这头名叫 Jumbo 的小象就是后来拒绝移动、让警察头疼的主角。\n\n4. set off (出发) 是一个常用短语。\n【关联点】正是因为他 set off down the main street (沿着主街出发)，才导致了后面 Jumbo was holding up the traffic (堵塞交通) 的情节。"
    },
    {
        "english": "He should have known that the police would never allow this sort of thing. A policeman approached Jimmy and told him he ought to have gone along a side street as Jumbo was holding up the traffic.",
        "chinese": "他本该知道警察绝不会允许这类事情发生。一个警察走过来告诉吉米，他应该走一条小路，因为江泊阻碍了交通。",
        "note": "1. 核心句型: should/ought to have done, 表达对过去行为的批评或遗憾，意为“本该做某事(但实际没做)”。\n【关联点】注意区分: 这里的 should have done (对过去) 表示“本该做”，而之后警察说的 we should arrest him (对现在/将来) 表示“应该做”。前者是批评，后者是义务。\n\n2. 核心短语: hold up the traffic, 意为“阻碍/堵塞交通”。\n【关联点】这个短语解释了前文行为的后果: 正因为 Jimmy `set off down the main street` (沿主街出发)，才导致了 Jumbo `holding up the traffic` (堵塞交通)。\n\n3. 句式流动: A approached B and told him... as... (A走近B并告诉他...因为...)。这是一个描述“发生问题 -> 解释原因”的经典叙事句型，清晰地交代了警察介入的前因后果。"
    },
    {
        "english": "Though Jimmy agreed to go at once, Jumbo refused to move. Fifteen policemen had to push very hard to get him off the main street. The police had a difficult time, but they were most amused.",
        "chinese": "虽然吉米同意马上就走，但江伯却拒绝移动。15个警察不得不用很大的力气把它推离主要街道。警察虽然吃了苦头，但他们还是感到很有趣。",
        "note": "1. 核心句型: agree to do (同意做) 与 refuse to do (拒绝做) 形成鲜明对比。\n【关联点】这和我们开篇遇到的 decide to do (决定做) 属于同一类用法，都是用不定式作宾语，表达意愿或决定。\n\n2. had to (不得不): 表示过去的强制性义务。警察们别无选择，只能用力推。\n【关联点】这和之后警察庆幸自己 didn't have to carry him (不必抬走他) 形成对比，强调了推的辛苦。\n\n3. 情感对比: had a difficult time (吃了苦头) 与 were most amused (感到很有趣) 用but连接，生动描绘了警察哭笑不得的心情。amused是以-ed结尾的形容词，表示“感到…的”。"
    },
    {
        "english": "'Jumbo must weigh a few tons,' said a policeman afterwards, 'so it was fortunate that we didn't have to carry him. Of course, we should arrest him, but as he has a good record, we shall let him off this time.'",
        "chinese": "“江伯一定有好几吨重，”一个警察事后这样说，“值得庆幸的是它没让我们抬它走。当然，我们应该逮捕它，但由于它一贯表现很好，这次我们饶了它。”",
        "note": "1. 核心句型: must + 动词原形, 表示“一定...”，用于有把握的推测。警察由此引出庆幸之事: it was fortunate that... (幸运的是...)。\n\n2. 核心短语: let sb. off, 意为“放过某人，饶恕某人”。这是警察在权衡“应该逮捕 (should arrest)”和“它有良好记录 (a good record)”后做出的决定。\n\n3. 【关联点】警察庆幸 didn't have to carry him (不必抬他)，这与之前他们 had to push him (不得不推他) 形成鲜明对比，突显出Jumbo的重量。\n\n4. 【关联点】注意区分情态动词: 这里的 we should arrest him (我们应该逮捕他) 指现在的义务，而之前提到的 he should have known (他本该知道) 是对过去的批评。"
    }
]