[
    {
        "english": "Fish and chips has always been a favourite dish in Britain, but as the oceans have been overfished, fish has become more and more expensive.",
        "chinese": "油煎鱼加炸土豆片一直是英国人喜爱的一道菜，但是随着海洋里的滥捕滥捞，鱼已经变得越来越昂贵。",
        "note": "1. 核心表达：Fish and chips被视为一道菜，故用单数动词has。overfished中的前缀over-表示“过度”。more and more expensive表示“越来越贵”，强调持续变化的趋势。\n\n2. 时态焦点：句中三次使用现在完成时（has been, have been overfished, has become），都强调了过去的行为或状态对现在造成的影响，将过去与现在紧密联系起来。\n\n3. 【关联点】本句的favourite dish与后文的favourite eating varieties用法一致。have been overfished的“现在完成时被动语态”，与divers have been frightened结构相同，都表示“已经被...”。\n\n4. 【关联点】more and more expensive的结构，与后文描述鱼“eat and eat and grow and grow”的重复手法相似，都用来强调持续的增长或变化。这恰好形成对比：普通海域的鱼因滥捕而变贵，而钻井平台的鱼却因无人捕捞而疯长。"
    },
    {
        "english": "So it comes as a surprise to learn that giant fish are terrifying the divers on North Sea oil rigs.",
        "chinese": "因此，听说北海石油钻井平台上的潜水员受到巨型鱼类的恐吓，确实很让人吃惊。",
        "note": "1. 核心句型：It comes as a surprise to do sth. 这是一个固定句型，其中it是形式主语，真正的主语是后面的不定式短语to learn that...，用来表达“得知某事令人惊讶”。\n\n2. 【关联点】这和我们之前遇到的 divers... have been frightened 形成对比。本句用主动语态 are terrifying (正在吓唬)，强调鱼是动作的发出者；而前句用被动语态，强调潜水员是动作的承受者。\n\n3. 【关联点】这里的 giant fish (巨型鱼) 呼应了前文，也与后文用 monsters (怪物) 和 unnatural sizes (不正常的大小) 来形容这些鱼的表述一致，共同描绘出鱼的巨大体型。"
    },
    {
        "english": "Oil rigs have to be repaired frequently and divers, who often have to work in darkness a hundred feet under water, have been frightened out of their wits by giant fish bumping into them as they work.",
        "chinese": "钻井平台需要经常修理，潜水员常常要在水面100英尺以下摸黑工作，他们曾在工作时被撞到他们身上的大鱼吓得惊惶失措。",
        "note": "1. 结构拆解：本句由and连接两个分句。第一分句描述钻井平台（Oil rigs have to be repaired），第二分句描述潜水员（divers...have been frightened），结构清晰。\n\n2. 核心短语：frightened out of their wits是一个生动短语，意为“吓得魂飞魄散”，极大地增强了表达效果。bumping into them是现在分词短语，说明了鱼是如何吓到潜水员的。\n\n3. 【关联点】本句的have been frightened（已被吓到）与第一句中的have been overfished（已被过度捕捞）结构完全相同，都是“现在完成时被动语态”，强调一个已完成的被动动作对现在造成的影响。\n\n4. 【关联点】注意区分：本句用被动语态be frightened强调潜水员的感受，而前文用主动语态are terrifying强调鱼的行为。一主一被，视角不同，生动地描绘了“谁吓唬谁”的场景。"
    },
    {
        "english": "Now they have had special cages made to protect them from these monsters.",
        "chinese": "现在他们有了特制的笼子，用来保护他们免受大鱼的侵袭。",
        "note": "1. 核心句型：have something done (have + 宾语 + 过去分词)，意为“让某事被做”。这里指“他们让特制的笼子被制造出来”，强调是请人或安排去做的，而非自己动手。\n\n2. 【关联点】这里的monsters(怪物)与前文的giant fish(巨型鱼)和unnatural sizes(不正常的大小)相互呼应，层层递进地描绘出鱼的恐怖形象，解释了为何需要笼子。\n\n3. 【关联点】注意区分：本句的have cages made(让笼子被造)与后文的cause fish to grow(导致鱼生长)都表达因果，但前者是“安排某事被完成”，后者是“直接导致某事发生”。"
    },
    {
        "english": "The fish are not sharks or killer whales, but favourite eating varieties like cod and skate which grow to unnatural sizes, sometimes as much as twelve feet in length.",
        "chinese": "这些鱼并不是鲨鱼或逆戟鲸，而是深受人们喜爱的食用鱼品种，如鳕鱼和鳐鱼，只不过它们长得出奇地大，有时长达12英尺。",
        "note": "1. 核心结构：not A but B... (不是A，而是B)。这个句型清晰地否定了鱼是鲨鱼，转而肯定它们是食用鱼，起到了澄清和强调的作用。\n\n2. 细节描述：which引导定语从句，补充说明这些鱼的特点：grow to unnatural sizes (长到反常的大小)。as much as (多达)则进一步强调了其惊人尺寸。\n\n3. 【关联点】这和我们开篇遇到的favourite dish (最受欢迎的菜肴) 用法一致，这里的favourite eating varieties指“受欢迎的食用鱼品种”。\n\n4. 【关联点】unnatural sizes (反常的大小) 与前文的giant fish (巨型鱼) 和monsters (怪物) 相互呼应，共同描绘出鱼的巨大。后文将解释它们疯长(grow and grow)的原因。"
    },
    {
        "english": "Three factors have caused these fish to grow so large: the warm water round the hot oil pipes under the sea; the plentiful supply of food thrown overboard by the crews on the rigs; the total absence of fishing boats around the oil rigs.",
        "chinese": "这些鱼能长得这么大是由3个因素造成的：海底热的输油管道附近的温暖的海水；钻井平台工作人员抛到海里充足的食物；钻井平台周围根本没有捕鱼船只。",
        "note": "1. 核心句型：cause + 宾语 + to do sth.，意为“导致某物做某事”。这是表达因果关系的直接方式，清晰地指出了“三个因素”是导致“鱼生长”的直接原因。\n\n2. 结构焦点：冒号在此处引出三个并列的名词短语，具体阐释了前文提到的“三个因素”(Three factors)，使文章结构清晰，条理分明。\n\n3. 【关联点】本句详细解释了鱼变大的三个原因，直接引出了后文的结果：As a result, the fish just eat and eat and grow and grow...。一因一果，逻辑链条完整。\n\n4. 【关联点】注意区分：本句的cause fish to grow (直接导致鱼生长) 与前文的have cages made (安排笼子被造) 都表达因果，但前者是直接引发，后者是间接安排，侧重点不同。"
    },
    {
        "english": "As a result, the fish just eat and eat and grow and grow in the lovely warm water.",
        "chinese": "结果是，这些鱼就在可爱的温暖的水流中吃呀吃，长呀长。",
        "note": "1. 核心短语：As a result, (结果是) 直接引出上文三个因素(factors)导致的后果，形成清晰的因果链。\n\n2. 核心结构：eat and eat, grow and grow。重复动词以强调动作的持续性，画面感十足。【关联点】这和我们开篇遇到的more and more expensive用法相似，都表示“不断增长”。\n\n3. 【关联点】这里的grow and grow直接解释了为何前文中的鱼能长到unnatural sizes(反常的大小)，并被称为giant fish(巨型鱼)或monsters(怪物)。"
    },
    {
        "english": "Who eats who?",
        "chinese": "究竟谁吃谁呢？",
        "note": "1. 核心结构：Who + 动词 + who? 这是一个高度浓缩的疑问句，用以询问动作的发出者（主语）和承受者（宾语）分别是谁。\n\n2. 角色分析：第一个Who是主语，代表捕食者；第二个who是宾语，代表被捕食者。一句话清晰地揭示了捕食关系。\n\n3. 【关联点】这个问题精准概括了前文的核心冲突。我们学过 giant fish are terrifying divers (鱼吓唬人) 和 divers have been frightened (人被鱼吓到)，这两种主被动语态正是对“究竟谁吓唬谁”这个问题的不同回答。"
    }
]