[
    {
        "english": "Dreams of finding lost treasure almost came true recently.",
        "chinese": "最近，找到失踪宝藏的梦想差一点儿变成现实。",
        "note": "1. 核心短语：come true 意为“（梦想、愿望）实现”。句子的主语是一个较长的名词短语 Dreams of finding lost treasure，其中 of finding... 部分详细说明了是什么样的梦想。这和我们之后会学到的 hoping to find buried treasure 表达了同样的主题。\n\n2. 关键副词 almost：意为“差一点儿，几乎”，表示事情非常接近发生但最终没有发生，彻底扭转了句子的结果。 【关联点】这和我们后面遇到的 a small gold coin which was almost worthless（几乎一钱不值的小金币）用法完全相同，都强调了“无限接近但并未达到”的状态。\n\n3. 句型解析：本句主干是 Dreams came true（梦想实现了）。修饰成分 of finding lost treasure 用来具体说明是什么梦想；副词 almost 和 recently 则分别点明了实现的程度（差一点）和时间（最近）。整个句子结构清晰，重点突出。"
    },
    {
        "english": "A new machine called 'The Revealer' has been invented and it has been used to detect gold which has been buried in the ground.",
        "chinese": "一种叫“探宝器”的新机器已经发明出来，并被人们用来探测地下埋藏的金子。",
        "note": "1. 核心语法：现在完成时被动语态 (has been + 过去分词) 在句中出现三次 (invented, used, buried)，强调动作已完成且结果持续至今。【关联点】这和我们遇到的 The machine was used... (一般过去时被动) 形成对比，一个强调“现在已经”，一个只描述“过去曾经”。\n\n2. 结构解析：句子由and连接两个并列分句。注意两种修饰方法：用过去分词短语 called 'The Revealer' 修饰machine；用定语从句 which has been buried... 修饰gold。【关联点】这和我们遇到的 buried treasure (埋藏的财宝) 和 a small gold coin which was almost worthless (几乎一钱不值的金币) 的修饰方式类似。"
    },
    {
        "english": "The machine was used in a cave near the seashore where -- it is said -- pirates used to hide gold.",
        "chinese": "在靠近海边的一个据说过去海盗常在里面藏金子的岩洞里，这种机器被派上了用场。",
        "note": "1. 结构核心是“地点 + where引导的定语从句”。这里的where等于in which，修饰前面的名词cave，解释了这个洞穴的用途。【关联点】这和我们之前遇到的 which was almost worthless 类似，都是定语从句，但where专门修饰地点。\n\n2. 重点短语：used to hide gold 意为“过去常藏金子”，强调现在已不再如此。【关联点】这和我们之前遇到的 pirates would often bury gold 类似，都表示过去的习惯。注意区分：used to 强调今昔对比，而 would often 仅描述重复动作。\n\n3. 语法细节：主句动词 was used 是一般过去时被动语态，只陈述过去发生的动作。【关联点】这和我们之前遇到的 has been used (现在完成时被动) 不同，后者强调动作已完成并对现在有影响。另外，-- it is said -- 是插入语，表示“据说”。"
    },
    {
        "english": "The pirates would often bury gold in the cave and then fail to collect it.",
        "chinese": "海盗们过去常把金子埋藏在那个洞里，可后来却没能取走。",
        "note": "1. 核心短语：would often bury 意为“过去常常埋藏”。【关联点】这和我们之后遇到的 pirates used to hide gold (海盗过去常藏金子) 意思非常接近，都用来描述过去的习惯性动作。\n\n2. 重点词汇：bury (埋藏)。【关联点】注意它在本课中的其他形式：过去分词作定语的 buried，如 gold which has been buried (被埋藏的金子) 和 buried treasure (埋藏的财宝)。\n\n3. 结构解析：句子用 and then 连接两个动作，形成“埋藏”与“未能取走”的对比。fail to do sth 意为“未能做成某事”，强调一种事与愿违的结果，解释了宝藏被留下的原因。"
    },
    {
        "english": "Armed with the new machine, a search party went into the cave hoping to find buried treasure.",
        "chinese": "一支用这种新机器装备起来的探宝队进入了这个岩洞，希望找到埋藏着的金子。",
        "note": "1. 结构解析：句首的 Armed with... (过去分词) 表明探宝队的状态；句尾的 hoping to... (现在分词) 则说明其目的。这种用分词短语修饰主句的结构非常高效。【关联点】hoping to find buried treasure 与开篇 Dreams of finding lost treasure 主题一致，都表达了寻宝的动机。\n\n2. 核心短语：buried treasure (埋藏的财宝)。这里的buried是过去分词作形容词。【关联点】这和我们之前遇到的 gold which has been buried 及 The pirates would often bury gold 形成呼应，通过动词bury的不同形式串联起“埋藏”这一核心线索。\n\n3. 重点词汇：search party (搜寻队)。【关联点】注意这里的party意为“队伍”，而非“派对”。这和我们后面遇到的 The leader of the party 和 The party then searched... 中的用法完全相同，指代同一群人。"
    },
    {
        "english": "The leader of the party was examining the soil near the entrance to the cave when the machine showed that there was gold under the ground.",
        "chinese": "当这个队的队长正在检查洞口附近的土壤时，那台机器显示出它的下面埋有金子。",
        "note": "1. 核心结构：“was doing... when... did...”，表示一个持续的背景动作（正在检查）被一个瞬间的动作（显示）打断。这是描述过去故事的经典句型。\n\n2. 重点词汇：party (队伍)。【关联点】这和我们之前遇到的 search party (搜寻队) 以及之后 The party then searched... 中的 party 意思完全相同，都指这群探宝队员，而非“派对”。\n\n3. 句型解析：showed that... 引导宾语从句，说明“显示”的具体内容。【关联点】这和我们之后会遇到的 confident that... 结构类似，都是用 that 引导一个完整的句子，来具体说明前面的动词或形容词。"
    },
    {
        "english": "Very excited, the party dug a hole two feet deep. They finally found a small gold coin which was almost worthless.",
        "chinese": "队员们异常激动，就地挖了一个两英尺深的坑 ，但最后找到的是一枚几乎一钱不值的小金币 。",
        "note": "1. 句首的 Very excited, ... 结构生动描绘了队员们挖坑时的激动心情，为后文的失望结果作铺垫。【关联点】这和我们之前遇到的 Armed with the new machine... 结构类似，都是用分词短语来描述主语的状态。\n\n2. 核心词汇 worthless (无价值的) 与 almost 连用，形成巨大反差。【关联点】这和开篇的 almost came true (差一点实现) 遥相呼应，都用 almost 强调了“无限接近但最终落空”的戏剧性结果。\n\n3. 定语从句 which was almost worthless 用来修饰 a small gold coin，补充说明其价值。【关联点】这和我们遇到的 which has been buried... 和 where... pirates used to hide gold 都是定语从句，是修饰名词的常用高级句型。"
    },
    {
        "english": "The party then searched the whole cave thoroughly but did not find anything except an empty tin trunk.",
        "chinese": "队员们接着又把整个洞彻底搜寻了一遍 ，但除了一只空铁皮箱外什么也没找到 。",
        "note": "1. 核心词汇：party 意为“队伍”。【关联点】这和我们之前遇到的 search party 和 The leader of the party 用法完全相同，都指这群探宝队员。\n\n2. 结构解析：句子用 but 连接两个相反的情况。searched... thoroughly (彻底搜寻) 强调了努力，而 did not find anything except... (除...外一无所获) 则突出了令人失望的结局。\n\n3. 重点短语：did not find anything except... (除了...什么也没找到)。【关联点】这个“一无所获”的结果，与之前 Very excited 的状态和 found a small gold coin 的微小收获形成对比，共同营造了故事的失望感。"
    },
    {
        "english": "In spite of this, many people are confident that 'The Revealer' may reveal something of value fairly soon.",
        "chinese": "尽管如此，很多人仍然相信“探宝器”很快就会探出值钱的东西来。",
        "note": "1. 句型 confident that... 用that从句解释“相信”的具体内容。【关联点】这和我们之前遇到的 showed that... 结构类似，用一个句子作补充说明。\n\n2. 短语 of value (有价值的) 与前文的 almost worthless 形成鲜明对比，表达了人们未减的希望。\n\n3. 动词 reveal (揭示) 呼应了机器的名字 'The Revealer' (探宝器)，也和之前提到的 detect (探测) 意思相近，都体现了机器的功能。"
    }
]