[
    {
        "english": "My old friend, Harrison, had lived in the Mediterranean for many years before he returned to England.",
        "chinese": "我的老朋友哈里森在回到英国以前曾多年居住在地中海地区。",
        "note": "1. 核心时态是过去完成时(had lived)，表示“居住”这个动作，发生在过去另一个动作“返回英国”(returned)之前。连词before清晰地标示了这两个动作的先后顺序。\n\n2. 【关联点】这和我们后面会遇到的had dreamed, had planned, had returned一样，都是用过去完成时来交代故事背景，即在主要事件发生前，主角已经历过的事情。\n\n3. 句中的“, Harrison,”是“My old friend”的同位语，用来补充说明老朋友的名字。这种插入语结构很常见，能让信息更具体。"
    },
    {
        "english": "He had often dreamed of retiring in England and had planned to settle down in the country.",
        "chinese": "过去他常幻想退休后到英国，并计划在乡间安顿下来。",
        "note": "1. 核心结构是and连接的两个并列动作：had dreamed of (梦想做某事) 和 had planned to (计划做某事)。两者都使用过去完成时，交代了主角回国前的长期愿望，为整个故事设定了背景。\n\n2. 【关联点】这和我们之前遇到的had lived一样，都是用过去完成时来交代故事背景。本课大量使用过去完成时来描述主角在回到英国“之前”的想法和经历，这是理解全文时间线的关键。\n\n3. 【关联点】短语settle down(安顿)在后文“he had hardly had time to settle down”中会再次出现。同时注意区分这里的in the country(在乡下)和后文left the country(离开国家)中country的不同含义。"
    },
    {
        "english": "He had no sooner returned than he bought a house and went to live there.",
        "chinese": "他刚一回到英国便买下了一幢房子住了进去。",
        "note": "1. 核心句型no sooner... than...意为“一...就...”，强调动作紧接发生。注意其固定的时态搭配：no sooner后用过去完成时(had returned)，than后用一般过去时(bought)。\n\n2. 【关联点】这个句型和我们后面遇到的“He had hardly... when he sold the house...”功能完全相同，都表示“一...就...”。这是英语中表达动作紧密衔接的经典方式，可以替换使用。\n\n3. 【关联点】句中的过去完成时(had returned)延续了本课的叙事风格。和开头的had lived, had dreamed一样，它标志着一个发生在过去主要事件(买房)之前的动作，构成了故事的时间线。"
    },
    {
        "english": "Almost immediately he began to complain about the weather, for even though it was still summer, it rained continually and it was often bitterly cold.",
        "chinese": "但紧接着他就开始抱怨那里的天气了。因为即使那时仍为夏季，但雨总是下个不停，而且常常冷得厉害。",
        "note": "1. 句子的后半部分由for引导，解释抱怨的原因，作用等同于because。从句内部结构为“even though (即便)..., it... and it... (但却...)”，用转折和并列的方式强调了天气的恶劣。\n\n2. 核心词汇是bitterly cold (刺骨的寒冷)，生动地描绘了天气的恶劣程度。bitterly常用来加强负面感受，如bitterly disappointed (极度失望)。\n\n3. 【关联点】这句话直接解释了上一句“Harrison got a shock”的原因。地中海多年的“sunshine”与英国“continually”下雨和“bitterly cold”形成鲜明对比，是整个故事的转折点。"
    },
    {
        "english": "After so many years of sunshine, Harrison got a shock.",
        "chinese": "在阳光下生活了那么多年的哈里森对此感到惊奇。",
        "note": "1. 核心短语是get a shock，意为“大吃一惊”，生动地表达了哈里森在经历巨大反差后内心的强烈震动，比he was surprised更有画面感。\n\n2. 句首的\"After so many years of sunshine\"是理解“shock”的关键背景。它与哈里森在地中海(Mediterranean)的生活直接对应，为即将到来的巨大反差埋下伏笔。\n\n3. 【关联点】这个“shock”到底是什么？答案就在后面的句子中：英国“continually”下雨且“bitterly cold”的天气。这里的“sunshine”和那里的坏天气形成了故事的核心冲突。"
    },
    {
        "english": "He acted as if he had never lived in England before.",
        "chinese": "他的举动就好像他从未在英国生活过一样。",
        "note": "1. 核心句型是as if引导的虚拟语气从句，用来描述一种与事实相反的假设。主句动词acted是过去时，因此从句用过去完成时(had never lived)表示与“当时”事实相反的情况。\n\n2. 【关联点】注意区分这里的had never lived与之前遇到的had lived。前者是虚拟语气，表示与过去事实相反的假设；后者是过去完成时，叙述真实发生过的“过去的过去”的事件。\n\n3. 这种“表里不一”的描述生动地刻画了人物。例如：She speaks as if she knew everything. (她说话的口气好像她什么都懂似的)，暗示她其实并非全知。"
    },
    {
        "english": "In the end, it was more than he could bear. He had hardly had time to settle down when he sold the house and left the country.",
        "chinese": "最后，他再也忍受不住，还没等安顿下来就卖掉了房子，离开了这个国家。",
        "note": "1. 核心句型是hardly... when...，意为“一...就...”，用来强调两个动作衔接得非常快。它有固定的时态搭配：hardly所在的主句用过去完成时(had hardly had)，when引导的从句用一般过去时(sold, left)。\n\n2. 【关联点】这个句型与我们之前遇到的no sooner... than...功能完全相同，可以互换使用。例如，本句也可以说成：He had no sooner had time to settle down than he sold the house...\n\n3. 【关联点】短语settle down(安顿)在此处与前文“planned to settle down”(计划安顿)形成强烈对比，凸显其梦想的破灭。同时，注意这里的left the country(离开国家)与之前的in the country(在乡下)中country一词含义的不同。"
    },
    {
        "english": "The dream he had had for so many years ended there.",
        "chinese": "他多年来的幻想从此破灭。",
        "note": "1. 核心时态是过去完成时(had had)，即have的过去完成形式。它强调“拥有梦想”这个状态，发生在过去“梦想破灭”(ended)这个时间点之前。这个用法完全符合过去完成时的规则，只是看起来特殊。\n\n2. 【关联点】这个had had与我们之前遇到的had lived, had dreamed, had planned等在语法上完全一致，都是“助动词had + 动词的过去分词”结构。通过对比，可以彻底理解过去完成时的构成。\n\n3. 【关联点】这里的The dream直接呼应了前文的“He had often dreamed of retiring in England”。作者用词环环相扣，清晰地展示了哈里森从怀揣梦想(dreamed of)到梦想破灭(dream ended)的全过程。"
    },
    {
        "english": "Harrison had thought of everything except the weather.",
        "chinese": "哈里森把每件事情都考虑到了，唯独没想到天气。",
        "note": "1. 核心短语是think of (考虑到) 和except (除了)。这个句子用过去完成时(had thought of)交代了哈里森在回国前自认为已万事俱备，而except则点出了他计划中的唯一疏漏，为故事的转折埋下伏笔。\n\n2. 【关联点】时态上，had thought of延续了本课的叙事风格。这和之前的had lived, had dreamed一样，都是用过去完成时来交代故事背景，即主角在遇到问题“之前”的周密计划。\n\n3. 【关联点】他唯独没想到的the weather，正是后文他抱怨(complain about the weather)并最终无法忍受(more than he could bear)的根源。这句话是整个故事戏剧性冲突的关键。"
    }
]